Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

source: Your personal information helps us calculate your specific nutritional needs, including daily calorie requirements, portion sizes, and nutrient recommendations based on your age, gender, and physical characteristics.
es: Tu información personal nos ayuda a calcular tus necesidades nutricionales específicas, incluyendo requerimientos calóricos diarios, tamaños de porciones y recomendaciones de nutrientes basadas en tu edad, género y características físicas.
fr: Vos informations personnelles nous aident à calculer vos besoins nutritionnels spécifiques, y compris les besoins caloriques quotidiens, les tailles de portions et les recommandations nutritionnelles basées sur votre âge, sexe et caractéristiques physiques.

source: Set Up Profile
es: Configurar perfil
fr: Configurer le profil

source: Add Physical Information
es: Agregar información física
fr: Ajouter des informations physiques

source: Height, weight, and body measurements
es: Altura, peso y medidas corporales
fr: Taille, poids et mesures corporelles

source: Your height and weight are crucial for calculating your Basal Metabolic Rate (BMR) and daily calorie needs. This ensures our nutrition analysis provides accurate recommendations for maintaining or reaching your health goals.
es: Tu altura y peso son cruciales para calcular tu tasa metabólica basal (TMB) y necesidades calóricas diarias. Esto asegura que nuestro análisis nutricional proporcione recomendaciones precisas para mantener o alcanzar tus objetivos de salud.
fr: Votre taille et poids sont cruciaux pour calculer votre taux métabolique de base (TMB) et vos besoins caloriques quotidiens. Cela garantit que notre analyse nutritionnelle fournit des recommandations précises pour maintenir ou atteindre vos objectifs de santé.

source: Add Measurements
es: Agregar medidas
fr: Ajouter des mesures

source: Medical Conditions Matter
es: Las condiciones médicas importan
fr: Les conditions médicales comptent

source: Help us keep you safe and healthy
es: Ayúdanos a mantenerte seguro y saludable
fr: Aidez-nous à vous garder en sécurité et en bonne santé

source: Adding your medical conditions allows us to provide nutrition advice that's safe for your specific health situation. We'll warn you about foods that might interact with your conditions and suggest beneficial alternatives.
es: Agregar tus condiciones médicas nos permite proporcionar consejos nutricionales seguros para tu situación de salud específica. Te advertiremos sobre alimentos que podrían interactuar con tus condiciones y sugeriremos alternativas beneficiosas.
fr: Ajouter vos conditions médicales nous permet de fournir des conseils nutritionnels sûrs pour votre situation de santé spécifique. Nous vous avertirons des aliments qui pourraient interagir avec vos conditions et suggérerons des alternatives bénéfiques.

source: Add Conditions
es: Agregar condiciones
fr: Ajouter des conditions

source: Dietary Restrictions & Preferences
es: Restricciones y preferencias dietéticas
fr: Restrictions et préférences alimentaires

source: Customize your nutrition experience
es: Personaliza tu experiencia nutricional
fr: Personnalisez votre expérience nutritionnelle

source: Whether you're vegetarian, have food allergies, or follow specific diets, this information ensures all our recommendations fit your lifestyle and dietary needs safely.
es: Ya seas vegetariano, tengas alergias alimentarias o sigas dietas específicas, esta información asegura que todas nuestras recomendaciones se ajusten a tu estilo de vida y necesidades dietéticas de manera segura.
fr: Que vous soyez végétarien, ayez des allergies alimentaires ou suiviez des régimes spécifiques, cette information garantit que toutes nos recommandations correspondent à votre style de vie et besoins alimentaires en toute sécurité.

source: Set Preferences
es: Establecer preferencias
fr: Définir les préférences

source: Start Tracking Your Health
es: Comienza a rastrear tu salud
fr: Commencez à suivre votre santé

source: Begin your wellness journey
es: Comienza tu viaje de bienestar
fr: Commencez votre parcours bien-être

source: Now that your profile is complete, you can start logging meals, tracking health metrics, and receiving personalized nutrition analysis. The more data you provide, the better our recommendations become!
es: Ahora que tu perfil está completo, puedes comenzar a registrar comidas, rastrear métricas de salud y recibir análisis nutricional personalizado. ¡Cuantos más datos proporciones, mejores se vuelven nuestras recomendaciones!
fr: Maintenant que votre profil est complet, vous pouvez commencer à enregistrer les repas, suivre les métriques de santé et recevoir une analyse nutritionnelle personnalisée. Plus vous fournissez de données, meilleures deviennent nos recommandations !

source: Start Tracking
es: Comenzar seguimiento
fr: Commencer le suivi

source: Personalized nutrition recommendations
es: Recomendaciones nutricionales personalizadas
fr: Recommandations nutritionnelles personnalisées

source: Accurate calorie and nutrient tracking
es: Seguimiento preciso de calorías y nutrientes
fr: Suivi précis des calories et nutriments

source: Health-aware meal suggestions
es: Sugerencias de comidas conscientes de la salud
fr: Suggestions de repas conscientes de la santé

source: Better medication and meal timing
es: Mejor sincronización de medicamentos y comidas
fr: Meilleur timing des médicaments et repas

source: Accurate daily calorie calculations
es: Cálculos calóricos diarios precisos
fr: Calculs caloriques quotidiens précis

source: Age-appropriate nutrient recommendations
es: Recomendaciones de nutrientes apropiadas para la edad
fr: Recommandations nutritionnelles adaptées à l'âge

source: Proper portion size guidance
es: Guía de tamaño de porción adecuada
fr: Conseils de taille de portion appropriés

source: Gender-specific health considerations
es: Consideraciones de salud específicas del género
fr: Considérations de santé spécifiques au sexe

source: Precise BMR and calorie calculations
es: Cálculos precisos de TMB y calorías
fr: Calculs BMR et caloriques précis

source: Accurate BMI tracking
es: Seguimiento preciso del IMC
fr: Suivi IMC précis

source: Proper portion recommendations
es: Recomendaciones de porciones adecuadas
fr: Recommandations de portions appropriées

source: Weight management guidance
es: Guía de manejo del peso
fr: Conseils de gestion du poids

source: Safe food recommendations
es: Recomendaciones alimentarias seguras
fr: Recommandations alimentaires sûres

source: Condition-specific nutrition alerts
es: Alertas nutricionales específicas de condición
fr: Alertes nutritionnelles spécifiques aux conditions

source: Medication interaction warnings
es: Advertencias de interacción medicamentosa
fr: Avertissements d'interaction médicamenteuse

source: Tailored health advice
es: Consejos de salud personalizados
fr: Conseils de santé sur mesure

source: Allergen-free recommendations
es: Recomendaciones libres de alérgenos
fr: Recommandations sans allergènes

source: Diet-compliant meal suggestions
es: Sugerencias de comidas compatibles con dieta
fr: Suggestions de repas conformes au régime

source: Safe ingredient alternatives
es: Alternativas de ingredientes seguros
fr: Alternatives d'ingrédients sûres

source: Personalized recipe filtering
es: Filtrado de recetas personalizado
fr: Filtrage de recettes personnalisé

source: Accurate nutrition analysis
es: Análisis nutricional preciso
fr: Analyse nutritionnelle précise

source: Personalized meal recommendations
es: Recomendaciones de comidas personalizadas
fr: Recommandations de repas personnalisées

source: Health trend monitoring
es: Monitoreo de tendencias de salud
fr: Surveillance des tendances de santé

source: Progress tracking
es: Seguimiento de progreso
fr: Suivi des progrès

source: Benefits include:
es: Los beneficios incluyen:
fr: Les avantages incluent :

source: Cuisine
es: Cocina

source: %@ in %@
es: %@ en %@

source: 1 minute
es: 1 minuto

source: %d minutes
es: %d minutos

source: Nutrition
es: Nutrición

# nutrition_tracking_description
source: Learn how to log and analyze your meals
es: Aprenda a registrar y analizar sus comidas

# voice_assistance_title
source: Voice Assistance
es: Asistencia por Voz

# voice_assistance_description
source: Learn how to use voice commands
es: Aprenda a usar los comandos de voz

# watch_video_tutorial_button
source: Watch Video Tutorial
es: Ver Video Tutorial

source: Calories
es: Calorías

source: Folate
es: Folato

source: Calcium
es: Calcio

source: Your personal companion for healthy aging. Track nutrition, manage medications, and monitor your health with ease.
es: Su compañero personal para un envejecimiento saludable. Realice un seguimiento de la nutrición, gestione los medicamentos y controle su salud con facilidad.

source: Personalized Nutrition
es: Nutrición Personalizada

source: Log your meals, analyze nutritional content, and get personalized recommendations to support your health goals.
es: Registre sus comidas, analice el contenido nutricional y obtenga recomendaciones personalizadas para apoyar sus objetivos de salud.

source: Stay hydrated with easy water logging, customizable goals, and smart reminders throughout your day.
es: Manténgase hidratado con un fácil registro de agua, metas personalizables y recordatorios inteligentes durante todo el día.

source: Manage intermittent fasting schedules with visual timers, progress tracking, and customizable protocols.
es: Gestione los horarios de ayuno intermitente con temporizadores visuales, seguimiento del progreso y protocolos personalizables.

source: Never miss a dose with smart reminders, medication tracking, and easy refill alerts.
es: No se pierda nunca una dosis con recordatorios inteligentes, seguimiento de medicamentos y alertas de resurtido fáciles.

source: Track blood pressure, blood sugar, weight, and heart rate with detailed history and trends.
es: Realice un seguimiento de la presión arterial, el azúcar en la sangre, el peso y la frecuencia cardíaca con un historial y tendencias detallados.

source: Accessibility & Support
es: Accesibilidad y Soporte

source: Large text options, voice assistance, comprehensive help, and emergency contacts for your safety.
es: Opciones de texto grande, asistencia por voz, ayuda completa y contactos de emergencia para su seguridad.

source: Premium Features
es: Funciones Premium

source: Unlock advanced analytics, unlimited meal tracking, detailed reports, and priority support.
es: Desbloquee análisis avanzados, seguimiento ilimitado de comidas, informes detallados y soporte prioritario.

source: Ready to Get Started
es: ¡Listo para Empezar!

source: Set up your profile, add your first meal, and begin your journey to better health today!
es: ¡Configure su perfil, agregue su primera comida y comience su viaje hacia una mejor salud hoy!

# print_date_label
source: Date
es: Fecha

# dosage_label
source: Dosage
es: Dosis

# notes_label
source: Notes
es: Notas

source: Urgent
es: Urgente

source: Nutrition Trends
es: Tendencias Nutricionales

source: No nutrition data available for the selected time range
es: No hay datos nutricionales disponibles para el rango de tiempo seleccionado

source: Goal
es: Objetivo

source: Insights
es: Análisis

source: Add more meals to see nutrition insights and trends.
es: Agrega más comidas para ver análisis y tendencias nutricionales.

source: Great job! Your calorie intake is well-balanced and close to your goal.
es: ¡Excelente trabajo! Tu ingesta calórica está bien equilibrada y cerca de tu objetivo.

source: You're consuming about %.0f calories above your daily goal. Consider adjusting portion sizes or meal choices.
es: Estás consumiendo aproximadamente %.0f calorías por encima de tu objetivo diario. Considera ajustar las porciones o las opciones de comida.

source: You're consuming about %.0f calories below your daily goal. Consider adding nutritious snacks or larger portions.
es: Estás consumiendo aproximadamente %.0f calorías por debajo de tu objetivo diario. Considera agregar bocadillos nutritivos o porciones más grandes.

source: Free users can view up to 7 days of nutrition analytics. Upgrade for extended history.
es: Los usuarios gratuitos pueden ver hasta 7 días de análisis nutricional. Actualiza para historial extendido.

source: Extended nutrition analytics history is available with Advanced or Premium subscription. Free users can view up to 7 days of data.
es: El historial extendido de análisis nutricional está disponible con suscripción Avanzada o Premium. Los usuarios gratuitos pueden ver hasta 7 días de datos.

source: Premium Feature
es: Función Premium

source: Upgrade
es: Actualizar

source: Sample medication schedule for demonstration:
es: Horario de medicamentos de muestra para demostración:

source: Atorvastatin
es: Atorvastatina

source: Take with breakfast
es: Tomar con el desayuno

source: Take with dinner
es: Tomar con la cena

source: Take with lunch
es: Tomar con el almuerzo

# Disclaimer.Modal.Title
source: Important Disclaimer
es: Aviso importante

# Disclaimer.Modal.Body
source: The information provided by Senior Nutrition is for educational purposes only and is not intended as medical advice. Always consult your physician or a qualified healthcare provider before making any changes to your diet, medication, or fasting routine. If you feel unwell, stop immediately and seek medical attention.
es: La información proporcionada por Senior Nutrition es solo para fines educativos y no constituye asesoramiento médico. Consulte siempre a su médico o a un profesional de la salud calificado antes de realizar cambios en su dieta, medicación o rutina de ayuno. Si se siente mal, deténgase de inmediato y busque atención médica.

# Disclaimer.Modal.Button
source: I Understand
es: Entiendo

# Disclaimer.Fasting.Banner
source: Fasting advice is for educational purposes only. Always consult your doctor before starting a fast. If you feel unwell, stop immediately and seek medical attention.
es: El consejo sobre el ayuno es solo para fines educativos. Consulte siempre a su médico antes de comenzar un ayuno. Si se siente mal, deténgase de inmediato y busque atención médica.

# Disclaimer.HealthTips.Banner
source: Health tips are for educational purposes only. Always consult your doctor before making changes to your health routine.
es: Los consejos de salud son solo para fines educativos. Consulte siempre a su médico antes de realizar cambios en su rutina de salud.

# Disclaimer.NutritionTips.Banner
source: Nutrition tips are for educational purposes only. Always consult your doctor or a registered dietitian before making changes to your diet.
es: Los consejos de nutrición son solo para fines educativos. Consulte siempre a su médico o a un dietista registrado antes de realizar cambios en su dieta.

source: Little or no exercise
es: Poco o ningún ejercicio

source: Light exercise 1-3 days/week
es: Ejercicio ligero 1-3 días/semana

source: Moderate exercise 3-5 days/week
es: Ejercicio moderado 3-5 días/semana

source: Hard exercise 6-7 days/week
es: Ejercicio intenso 6-7 días/semana

source: Very hard exercise or physical job
es: Ejercicio muy intenso o trabajo físico

source: Harris-Benedict (Traditional)
es: Harris-Benedict (Tradicional)

source: Mifflin-St Jeor (More accurate for seniors)
es: Mifflin-St Jeor (Más preciso para adultos mayores)

source: Use calculated calorie goal
es: Usar objetivo calórico calculado

source: Based on your profile and activity level
es: Basado en tu perfil y nivel de actividad

source: Calorie Calculation Details
es: Detalles del cálculo calórico

source: BMR:
es: TMB:

source: Activity Level
es: Nivel de actividad

source: Select your typical activity level to calculate accurate calorie needs:
es: Selecciona tu nivel de actividad típico para calcular las necesidades calóricas precisas:

source: Calorie Calculation Method:
es: Método de cálculo calórico:

source: Estimated Daily Calorie Needs:
es: Necesidades calóricas diarias estimadas:

source: Based on your profile: BMR %@ cal/day × %@ activity = %@ cal/day maintenance. Recommended goal: %@ cal/day.
es: Basado en tu perfil: TMB %@ cal/día × actividad %@ = %@ cal/día mantenimiento. Objetivo recomendado: %@ cal/día.

source: (500 cal deficit for 1 lb/week weight loss)
es: (déficit de 500 cal para perder 1 lb/semana)

source: (500 cal surplus for 1 lb/week weight gain)
es: (superávit de 500 cal para ganar 1 lb/semana)

source: Health & Wellness Tracking
es: Seguimiento de Salud y Bienestar

source: Monitor your health metrics safely and securely
es: Monitorea tus métricas de salud de forma segura

source: Your Health Data Privacy
es: Privacidad de tus Datos de Salud

source: This app stores and manages your health information securely on your device.
es: Esta aplicación almacena y gestiona tu información de salud de forma segura en tu dispositivo.

source: All health data is stored securely on your device
es: Todos los datos de salud se almacenan de forma segura en tu dispositivo

source: No health information is shared without your permission
es: No se comparte información de salud sin tu permiso

source: Data is encrypted and protected
es: Los datos están cifrados y protegidos

source: Health & Wellness App
es: Aplicación de Salud y Bienestar

source: Health Data Categories
es: Categorías de Datos de Salud

source: Important Medical Disclaimer
es: Importante Descargo Médico

source: Health App Information
es: Información de la Aplicación de Salud

source: I Understand - Continue
es: Entiendo - Continuar

source: Blood pressure and heart rate monitoring
es: Monitoreo de presión arterial y frecuencia cardíaca

source: Glucose level tracking for diabetes management
es: Seguimiento de niveles de glucosa para el manejo de diabetes

source: Body Metrics
es: Métricas Corporales

source: Weight tracking and BMI calculations
es: Seguimiento de peso y cálculos de IMC

source: Meal tracking and nutritional analysis
es: Seguimiento de comidas y análisis nutricional

source: Start with a 7-day free trial, then continue for just $9.99/month.
es: Comienza con una prueba gratuita de 7 días, luego continúa por solo $9.99/mes.

source: Simple Subscription Model
es: Modelo de Suscripción Simple

source: Enjoy full access with our straightforward pricing: 7 days free, then just $9.99/month. Cancel anytime.
es: Disfruta de acceso completo con nuestro precio directo: 7 días gratis, luego solo $9.99/mes. Cancela en cualquier momento.

source: 7-day free trial with no commitment
es: Prueba gratuita de 7 días sin compromiso

source: $9.99/month after trial period
es: $9.99/mes después del período de prueba

source: Cancel anytime through App Store
es: Cancela en cualquier momento a través de App Store

source: Important Disclaimer
es: Descargo Importante

source: The information provided by Senior Nutrition is for educational purposes only and is not intended as medical advice. Always consult your physician or a qualified healthcare provider before making any changes to your diet, medication, or fasting routine. If you feel unwell, stop immediately and seek medical attention.
es: La información proporcionada por Senior Nutrition es solo para fines educativos y no está destinada como consejo médico. Siempre consulte a su médico o a un proveedor de atención médica calificado antes de realizar cambios en su dieta, medicamentos o rutina de ayuno. Si se siente mal, deténgase inmediatamente y busque atención médica.

source: I Understand
es: Entiendo

source: Your personal nutrition companion designed specifically for seniors, with enhanced accessibility and intuitive navigation. Start with a 7-day free trial, then continue for just $9.99/month.
es: Su compañero personal de nutrición diseñado específicamente para personas mayores, con accesibilidad mejorada y navegación intuitiva. Comience con una prueba gratuita de 7 días, luego continúe por solo $9.99/mes.

source: Built-in barcode scanner
de: Integrierter Barcode-Scanner
es: Escáner de código de barras integrado

source: Subscription Information
es: Información de Suscripción

source: Clear information about our premium features and pricing
es: Información clara sobre nuestras funciones premium y precios

source: How Our App Works
es: Cómo Funciona Nuestra Aplicación

# subscription_info_how_app_works_content
source: Senior Nutrition App uses a freemium business model: • Core features are completely free • Premium subscription unlocks advanced features • All purchases are through Apple's App Store • 7-day free trial with full access
es: Senior Nutrition App usa un modelo de negocio freemium: • Las funciones principales son completamente gratuitas • La suscripción Premium desbloquea funciones avanzadas • Todas las compras son a través de App Store de Apple • Prueba gratuita de 7 días con acceso completo

source: Who Benefits from Premium?
es: ¿Quién se Beneficia del Premium?

# subscription_info_who_benefits_content
source: Premium subscriptions are designed for: • Adults 50+ managing health conditions • Seniors wanting personalized nutrition advice • Family caregivers helping older relatives • Health-conscious users seeking advanced tracking
es: Las suscripciones Premium están diseñadas para: • Adultos de 50+ que manejan condiciones de salud • Personas mayores que quieren consejos de nutrición personalizados • Cuidadores familiares que ayudan a parientes mayores • Usuarios conscientes de la salud que buscan seguimiento avanzado

source: Subscription Options
es: Opciones de Suscripción

# subscription_info_options_content
source: All subscriptions are purchased through Apple: • Monthly Premium: $9.99/month • Annual Premium: $99.99/year (17% savings) • 7-day free trial included • Cancel anytime in iOS Settings
es: Todas las suscripciones se compran a través de Apple: • Premium Mensual: $9.99/mes • Premium Anual: $99.99/año (17% de ahorro) • Prueba gratuita de 7 días incluida • Cancela en cualquier momento en Configuración de iOS

source: Feature Comparison
es: Comparación de Funciones

source: Free Features
es: Funciones Gratuitas

source: Premium Features ($9.99/month)
es: Funciones Premium ($9.99/mes)

source: How to Purchase
es: Cómo Comprar

# subscription_info_how_to_purchase_content
source: All subscriptions are handled by Apple: 1. Tap "Upgrade to Premium" in the app 2. Choose monthly or annual plan 3. Confirm with Face ID, Touch ID, or password 4. Start your 7-day free trial immediately Manage your subscription anytime in iOS Settings > [Your Name] > Subscriptions.
es: Todas las suscripciones son manejadas por Apple: 1. Toca "Actualizar a Premium" en la aplicación 2. Elige plan mensual o anual 3. Confirma con Face ID, Touch ID o contraseña 4. Comienza tu prueba gratuita de 7 días inmediatamente Maneja tu suscripción en cualquier momento en Configuración de iOS > [Tu Nombre] > Suscripciones.

source: Our Commitment
es: Nuestro Compromiso

# subscription_info_commitment_content
source: We believe in transparent pricing: • No hidden fees or surprise charges • Clear feature differentiation • Easy cancellation process • All features clearly described • Privacy-focused (no data selling)
es: Creemos en precios transparentes: • Sin tarifas ocultas o cargos sorpresa • Diferenciación clara de funciones • Proceso de cancelación fácil • Todas las funciones claramente descritas • Enfocados en privacidad (sin venta de datos)

source: Your Current Status
es: Tu Estado Actual

source: Premium Subscriber
es: Suscriptor Premium

source: Free User
es: Usuario Gratuito

source: Free trial: %d days remaining
es: Prueba gratuita: %d días restantes

source: Upgrade to Premium
es: Actualizar a Premium
