Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

source: Maintain consistent fasting periods
es: Mantenga períodos de ayuno consistentes
fr: Maintenez des périodes de jeûne cohérentes

source: Listen to your body's signals
es: Escuche las señales de su cuerpo
fr: Écoutez les signaux de votre corps

source: Adjust the protocol as needed
es: Ajuste el protocolo según sea necesario
fr: Ajustez le protocole si besoin

source: Keep track of your progress
es: Lleve un registro de su progreso
fr: Suivez vos progrès

# health_tip_fasting_hydration_title
source: Stay Hydrated While Fasting
es: Hidratación durante el ayuno
fr: Hydratation pendant le jeûne

# health_tip_fasting_hydration_description
source: You may want to drink plenty of water during your fasting periods. Consider aiming for at least 8-10 glasses daily to help prevent dehydration.
es: Considere beber mucha agua durante sus períodos de ayuno. Intente tomar al menos 8-10 vasos diarios para ayudar a prevenir la deshidratación.
fr: Pensez à boire beaucoup d'eau pendant vos périodes de jeûne. Visez au moins 8 à 10 verres par jour pour prévenir la déshydratation.

# health_tip_fasting_listen_body_title
source: Listen to Your Body
es: Escuche a su cuerpo
fr: Écoutez votre corps

# health_tip_fasting_listen_body_description
source: If you feel unwell during fasting - such as experiencing dizziness, extreme fatigue, or confusion - you might want to consider breaking your fast and consulting your healthcare provider.
es: Si no se siente bien durante el ayuno - como mareos, fatiga extrema o confusión - considere romper su ayuno y consulte con su proveedor de salud.
fr: Si vous ne vous sentez pas bien pendant le jeûne - comme des étourdissements, une fatigue extrême ou de la confusion - envisagez d'arrêter votre jeûne et consultez votre professionnel de santé.

# health_tip_fasting_break_title
source: Break Fast Gently
es: Romper el ayuno
fr: Rompre le jeûne

# health_tip_fasting_break_description
source: You might find it helpful to break your fast with easily digestible foods like soups, fruits, or small portions of protein to help avoid digestive discomfort.
es: Podría encontrar útil romper su ayuno con alimentos fácilmente digeribles como sopas, frutas o pequeñas porciones de proteína para evitar molestias digestivas.
fr: Vous pourriez trouver utile de rompre votre jeûne avec des aliments facilement digestibles comme des soupes, des fruits ou de petites portions de protéines pour éviter l'inconfort digestif.

# health_tip_fasting_sleep_title
source: Quality Sleep Helps Fasting
es: Sueño y ayuno
fr: Sommeil et jeûne

# health_tip_fasting_sleep_description
source: Quality sleep may help support your fasting routine. Consider maintaining a consistent sleep schedule to help with your intermittent fasting goals.
es: El sueño de calidad puede ayudar a mantener su rutina de ayuno. Considere mantener un horario de sueño regular para facilitar sus objetivos de ayuno intermitente.
fr: Un sommeil de qualité peut aider à soutenir votre routine de jeûne. Envisagez de maintenir un horaire de sommeil régulier pour faciliter vos objectifs de jeûne intermittent.

# health_tip_hydration_reminder_title
source: Set Hydration Reminders
es: Establecer Recordatorios de Hidratación
fr: Rappels d'hydratation

# health_tip_hydration_reminder_description
source: You might find it helpful to set reminders to drink water throughout the day, as the sense of thirst can decrease with age.
es: Use la aplicación para configurar recordatorios para beber agua durante todo el día, no solo cuando tenga sed.
fr: Vous pourriez trouver utile de configurer des rappels pour boire de l'eau tout au long de la journée, car la sensation de soif peut diminuer avec l'âge.

# health_tip_hydration_foods_title
source: Eat Hydrating Foods
es: Comer Alimentos Hidratantes
fr: Aliments hydratants

# health_tip_hydration_foods_description
source: Consider including hydrating foods like watermelon, oranges, cucumber, and lettuce in your diet as additional sources of hydration beyond plain water.
es: Complemente su ingesta de líquidos con alimentos ricos en agua como pepinos, sandías y naranjas.
fr: Envisagez d'inclure des aliments hydratants comme la pastèque, les oranges, le concombre et la laitue dans votre alimentation comme sources supplémentaires d'hydratation en plus de l'eau.

# health_tip_activity_walking_title
source: Daily Walking Benefits
es: Caminar Diariamente
fr: Marche quotidienne

# health_tip_activity_walking_description
source: A daily 30-minute walk may help improve circulation, heart health, and mood. Many seniors find this to be one of the most accessible and effective forms of exercise.
es: Intente caminar al menos 30 minutos la mayoría de los días. Es una excelente manera de mantenerse activo y mejorar la salud cardiovascular.
fr: Une marche quotidienne de 30 minutes peut aider à améliorer la circulation, la santé cardiaque et l'humeur. De nombreuses personnes âgées trouvent que c'est l'une des formes d'exercice les plus accessibles et efficaces.

# health_tip_activity_strength_title
source: Strength Training Matters
es: Entrenamiento de Fuerza
fr: Exercices de force

# health_tip_activity_strength_description
source: You might want to consider light strength training 2-3 times weekly, as many seniors find it helps maintain muscle mass, bone density, and independence.
es: Incorpore ejercicios de entrenamiento de fuerza 2-3 veces por semana para mantener la masa muscular y el metabolismo.
fr: Envisagez un entraînement de force léger 2-3 fois par semaine, car de nombreuses personnes âgées trouvent que cela aide à maintenir la masse musculaire, la densité osseuse et l'indépendance.

source: Accessibility Help
es: Ayuda de Accesibilidad
fr: Aide à l'accessibilité

source: Accessibility Features
es: Funciones de Accesibilidad
fr: Fonctionnalités d'accessibilité

source: Make the app easier to use with accessibility options
es: Facilita el uso de la aplicación con opciones de accesibilidad
fr: Facilitez l'utilisation de l'application avec les options d'accessibilité

source: Text Size Options
es: Opciones de Tamaño de Texto
fr: Options de taille de texte

source: Small: Compact text for more information on screen
es: Pequeño: Texto compacto para más información en pantalla
fr: Petit : Texte compact pour plus d'informations à l'écran

source: Medium: Standard text size (default)
es: Mediano: Tamaño de texto estándar (predeterminado)
fr: Moyen : Taille de texte standard (par défaut)

source: Large: Easier to read for vision challenges
es: Grande: Más fácil de leer para dificultades de visión
fr: Grand : Plus facile à lire pour les problèmes de vision

source: Extra Large: Maximum readability for low vision
es: Extra Grande: Máxima legibilidad para baja visión
fr: Très grand : Lisibilité maximale pour une basse vision

source: Change text size in Settings > Accessibility
es: Cambia el tamaño del texto en Ajustes > Accesibilidad
fr: Changez la taille du texte dans Paramètres > Accessibilité

source: Enhances text and button visibility
es: Mejora la visibilidad del texto y los botones
fr: Améliore la visibilité du texte et des boutons

source: Increases contrast between elements
es: Aumenta el contraste entre elementos
fr: Augmente le contraste entre les éléments

source: Makes the app easier to navigate
es: Facilita la navegación en la aplicación
fr: Facilite la navigation dans l'application

source: Helpful for users with vision impairments
es: Útil para usuarios con discapacidades visuales
fr: Utile pour les utilisateurs ayant une déficience visuelle

source: Toggle in Settings > Accessibility
es: Actívalo en Ajustes > Accesibilidad
fr: Activez dans Paramètres > Accessibilité

source: Use voice commands to navigate the app
es: Usa comandos de voz para navegar por la aplicación
fr: Utilisez les commandes vocales pour naviguer dans l'application

source: Hands-free operation for mobility challenges
es: Operación manos libres para dificultades de movilidad
fr: Fonctionnement mains libres pour les problèmes de mobilité

source: Voice feedback for all app actions
es: Respuesta de voz para todas las acciones de la aplicación
fr: Retour vocal pour toutes les actions de l'application

source: Customizable voice settings and speed
es: Ajustes de voz y velocidad personalizables
fr: Paramètres vocaux et vitesse personnalisables

source: Access detailed voice help in Voice Assistance section
es: Accede a la ayuda detallada de voz en la sección de Asistencia por Voz
fr: Accédez à l'aide vocale détaillée dans la section Assistance vocale

source: Navigation Assistance
es: Asistencia de Navegación
fr: Assistance à la navigation

source: Large, easy-to-tap buttons throughout the app
es: Botones grandes y fáciles de tocar en toda la aplicación
fr: Boutons larges et faciles à toucher dans toute l'application

source: Clear visual hierarchy and organization
es: Jerarquía visual y organización claras
fr: Hiérarchie visuelle et organisation claires

source: Consistent navigation patterns
es: Patrones de navegación consistentes
fr: Modèles de navigation cohérents

source: Back buttons always visible
es: Botones de retroceso siempre visibles
fr: Boutons de retour toujours visibles

source: Minimal gestures required for operation
es: Mínimos gestos requeridos para la operación
fr: Gestes minimaux requis pour le fonctionnement

source: Color-coded sections for easy identification
es: Secciones codificadas por colores para una fácil identificación
fr: Sections avec code couleur pour une identification facile

source: Icons accompany all text labels
es: Los iconos acompañan todas las etiquetas de texto
fr: Les icônes accompagnent toutes les étiquettes de texte

source: Clear visual feedback for all actions
es: Respuesta visual clara para todas las acciones
fr: Retour visuel clair pour toutes les actions

source: Progress indicators for long operations
es: Indicadores de progreso para operaciones largas
fr: Indicateurs de progression pour les opérations longues

source: Consistent color scheme throughout
es: Esquema de colores consistente en toda la aplicación
fr: Palette de couleurs cohérente partout

source: Cognitive Support Features
es: Funciones de Apoyo Cognitivo
fr: Fonctionnalités de soutien cognitif

source: Simple, intuitive interface design
es: Diseño de interfaz simple e intuitivo
fr: Conception d'interface simple et intuitive

source: Step-by-step guidance for complex tasks
es: Guía paso a paso para tareas complejas
fr: Guidage étape par étape pour les tâches complexes

source: Clear confirmation messages
es: Mensajes de confirmación claros
fr: Messages de confirmation clairs

source: Consistent terminology throughout
es: Terminología consistente en toda la aplicación
fr: Terminologie cohérente partout

source: Helpful tooltips and explanations
es: Consejos y explicaciones útiles
fr: Info-bulles et explications utiles

source: Undo options for most actions
es: Opciones de deshacer para la mayoría de las acciones
fr: Options d'annulation pour la plupart des actions

source: Motor Assistance
es: Asistencia Motora
fr: Assistance motrice

source: Large touch targets for easy tapping
es: Objetivos táctiles grandes para tocar con facilidad
fr: Grandes zones tactiles pour un tapotement facile

source: Minimal fine motor skills required
es: Se requieren habilidades motoras finas mínimas
fr: Compétences motrices fines minimales requises

source: Voice commands reduce physical interaction
es: Los comandos de voz reducen la interacción física
fr: Les commandes vocales réduisent l'interaction physique

source: Simple swipe gestures only
es: Solo gestos de deslizamiento simples
fr: Uniquement des gestes de balayage simples

source: No complex multi-finger gestures
es: Sin gestos complejos de varios dedos
fr: Pas de gestes complexes à plusieurs doigts

source: Settings and Customization
es: Ajustes y Personalización
fr: Paramètres et personnalisation

source: Access all accessibility settings in Settings tab
es: Accede a todos los ajustes de accesibilidad en la pestaña de Ajustes
fr: Accédez à tous les paramètres d'accessibilité dans l'onglet Paramètres

source: Changes apply immediately across the app
es: Los cambios se aplican inmediatamente en toda la aplicación
fr: Les modifications s'appliquent immédiatement dans toute l'application

source: Settings are saved automatically
es: Los ajustes se guardan automáticamente
fr: Les paramètres sont enregistrés automatiquement

source: Reset to defaults option available
es: Opción de restablecer a los valores predeterminados disponible
fr: Option de réinitialisation aux valeurs par défaut disponible

source: Test settings before committing to changes
es: Prueba los ajustes antes de confirmar los cambios
fr: Testez les paramètres avant de valider les modifications

source: Troubleshooting
es: Solución de Problemas
fr: Dépannage

source: If text is too small, increase text size in Settings
es: Si el texto es demasiado pequeño, aumenta el tamaño en Ajustes
fr: Si le texte est trop petit, augmentez la taille du texte dans les Paramètres

source: If buttons are hard to tap, enable high contrast
es: Si los botones son difíciles de tocar, activa el alto contraste
fr: Si les boutons sont difficiles à toucher, activez le contraste élevé

source: If voice commands aren't working, check microphone permissions
es: Si los comandos de voz no funcionan, comprueba los permisos del micrófono
fr: Si les commandes vocales ne fonctionnent pas, vérifiez les autorisations du microphone

source: If app seems slow, try reducing text size
es: Si la aplicación parece lenta, intenta reducir el tamaño del texto
fr: Si l'application semble lente, essayez de réduire la taille du texte

source: Contact support for additional accessibility needs
es: Contacta a soporte para necesidades de accesibilidad adicionales
fr: Contactez le support pour des besoins d'accessibilité supplémentaires

source: Health Data Help
es: Ayuda de Datos de Salud
fr: Aide sur les données de santé

source: Monitor vital signs and track your health progress
es: Monitorea los signos vitales y sigue tu progreso de salud
fr: Surveillez les signes vitaux et suivez vos progrès de santé

source: Available Health Metrics
es: Métricas de Salud Disponibles
fr: Métriques de santé disponibles

source: Blood Pressure: Track systolic and diastolic readings
es: Presión Arterial: Sigue las lecturas sistólica y diastólica
fr: Tension artérielle : Suivez les lectures systoliques et diastoliques

source: Blood Sugar: Monitor glucose levels for diabetes management
es: Azúcar en Sangre: Monitorea los niveles de glucosa para el manejo de la diabetes
fr: Glycémie : Surveillez les niveaux de glucose pour la gestion du diabète

source: Heart Rate: Record resting and active heart rates
es: Frecuencia Cardíaca: Registra las frecuencias cardíacas en reposo y activas
fr: Fréquence cardiaque : Enregistrez les fréquences cardiaques au repos et actives

source: Weight: Track body weight changes over time
es: Peso: Sigue los cambios de peso corporal a lo largo del tiempo
fr: Poids : Suivez l'évolution du poids corporel dans le temps

source: Body Mass Index (BMI): Automatic calculation from height and weight
es: Índice de Masa Corporal (IMC): Cálculo automático a partir de la altura y el peso
fr: Indice de masse corporelle (IMC) : Calcul automatique à partir de la taille et du poids

source: Tap the 'Health' tab at the bottom of your screen
es: Toca la pestaña 'Salud' en la parte inferior de tu pantalla
fr: Appuyez sur l'onglet 'Santé' en bas de votre écran

source: Select the health metric you want to track
es: Selecciona la métrica de salud que quieres seguir
fr: Sélectionnez la métrique de santé que vous souhaitez suivre

source: Tap 'Add' to enter a new reading
es: Toca 'Añadir' para introducir una nueva lectura
fr: Appuyez sur 'Ajouter' pour entrer une nouvelle lecture

source: Enter your measurement and any notes
es: Introduce tu medida y cualquier nota
fr: Entrez votre mesure et toutes les notes

source: View your history and trends over time
es: Consulta tu historial y tendencias a lo largo del tiempo
fr: Consultez votre historique et vos tendances au fil du temps

source: Key Features
es: Características Clave
fr: Fonctionnalités clés

source: Data Entry: Easy input forms for each health metric
es: Entrada de Datos: Formularios de entrada fáciles para cada métrica de salud
fr: Saisie de données : Formulaires de saisie faciles pour chaque métrique de santé

source: History Tracking: View all your past readings
es: Seguimiento del Historial: Consulta todas tus lecturas pasadas
fr: Suivi de l'historique : Consultez toutes vos lectures passées

source: Trend Analysis: See patterns and changes over time
es: Análisis de Tendencias: Observa patrones y cambios a lo largo del tiempo
fr: Analyse des tendances : Voyez les modèles et les changements au fil du temps

source: Target Ranges: Set personal health goals
es: Rangos Objetivo: Establece metas de salud personales
fr: Plages cibles : Définissez des objectifs de santé personnels

source: Export Data: Share with healthcare providers
es: Exportar Datos: Comparte con proveedores de atención médica
fr: Exporter les données : Partagez avec les prestataires de soins de santé

source: Reminders: Get notifications for regular check-ins
es: Recordatorios: Recibe notificaciones para controles regulares
fr: Rappels : Recevez des notifications pour des contrôles réguliers

source: Health Monitoring Tips
es: Consejos para el Monitoreo de la Salud
fr: Conseils de surveillance de la santé

source: Take measurements at the same time each day
es: Toma las medidas a la misma hora cada día
fr: Prenez les mesures à la même heure chaque jour

source: Use proper equipment for accurate readings
es: Usa equipo adecuado para lecturas precisas
fr: Utilisez un équipement approprié pour des lectures précises

source: Record any factors that might affect your readings
es: Registra cualquier factor que pueda afectar tus lecturas
fr: Enregistrez tous les facteurs qui pourraient affecter vos lectures

source: Share your data with your healthcare provider
es: Comparte tus datos con tu proveedor de atención médica
fr: Partagez vos données avec votre prestataire de soins de santé

source: Set realistic health goals with your doctor
es: Establece metas de salud realistas con tu médico
fr: Fixez des objectifs de santé réalistes avec votre médecin

source: Privacy & Security
es: Privacidad y Seguridad
fr: Confidentialité et sécurité

source: Your health data is stored locally on your device
es: Tus datos de salud se almacenan localmente en tu dispositivo
fr: Vos données de santé sont stockées localement sur votre appareil

source: Data is encrypted and secure
es: Los datos están encriptados y seguros
fr: Les données sont cryptées et sécurisées

source: You control what data to share
es: Tú controlas qué datos compartir
fr: Vous contrôlez les données à partager

source: No health data is sent to third parties
es: No se envían datos de salud a terceros
fr: Aucune donnée de santé n'est envoyée à des tiers

source: You can export or delete your data anytime
es: Puedes exportar o eliminar tus datos en cualquier momento
fr: Vous pouvez exporter ou supprimer vos données à tout moment

source: If readings seem unusual, double-check your measurements
es: Si las lecturas parecen inusuales, verifica tus mediciones
fr: Si les lectures semblent inhabituelles, vérifiez vos mesures

source: Use the notes field to record any special circumstances
es: Usa el campo de notas para registrar cualquier circunstancia especial
fr: Utilisez le champ des notes pour enregistrer toute circonstance particulière

source: Set up reminders to maintain consistent tracking
es: Configura recordatorios para mantener un seguimiento constante
fr: Configurez des rappels pour maintenir un suivi cohérent

source: Export your data regularly as a backup
es: Exporta tus datos regularmente como copia de seguridad
fr: Exportez régulièrement vos données comme sauvegarde

source: Contact support if you need help with data entry
es: Contacta a soporte si necesitas ayuda con la entrada de datos
fr: Contactez le support si vous avez besoin d'aide pour la saisie des données

source: Appointments Help
es: Ayuda para Citas
fr: Aide pour les rendez-vous

source: Organize and track your medical appointments
es: Organiza y sigue tus citas médicas
fr: Organisez et suivez vos rendez-vous médicaux

source: Tap the 'More' tab and select 'Appointments'
es: Toca la pestaña 'Más' y selecciona 'Citas'
fr: Appuyez sur l'onglet 'Plus' et sélectionnez 'Rendez-vous'

source: Tap 'Add Appointment' to create a new entry
es: Toca 'Añadir Cita' para crear una nueva entrada
fr: Appuyez sur 'Ajouter un rendez-vous' pour créer une nouvelle entrée

source: Enter appointment details including date, time, and provider
es: Introduce los detalles de la cita, incluyendo fecha, hora y proveedor
fr: Entrez les détails du rendez-vous, y compris la date, l'heure et le prestataire

source: Add notes about what to discuss or prepare
es: Añade notas sobre qué discutir o preparar
fr: Ajoutez des notes sur ce qu'il faut discuter ou préparer

source: Set reminders to ensure you don't miss appointments
es: Configura recordatorios para no olvidar las citas
fr: Définissez des rappels pour vous assurer de ne pas manquer vos rendez-vous

source: Appointment Scheduling: Add new appointments with full details
es: Programación de Citas: Añade nuevas citas con todos los detalles
fr: Planification de rendez-vous : Ajoutez de nouveaux rendez-vous avec tous les détails

source: Provider Information: Store doctor and facility contact details
es: Información del Proveedor: Guarda los datos de contacto del médico y del centro
fr: Informations sur le prestataire : Stockez les coordonnées du médecin et de l'établissement

source: Reminder System: Get notifications before appointments
es: Sistema de Recordatorios: Recibe notificaciones antes de las citas
fr: Système de rappel : Recevez des notifications avant les rendez-vous

source: Notes & Preparation: Add important information to discuss
es: Notas y Preparación: Añade información importante para discutir
fr: Notes et préparation : Ajoutez des informations importantes à discuter

source: Calendar View: See all appointments in chronological order
es: Vista de Calendario: Consulta todas las citas en orden cronológico
fr: Vue Calendrier : Voir tous les rendez-vous par ordre chronologique

source: History Tracking: Keep records of past appointments
es: Seguimiento del Historial: Mantén registros de citas pasadas
fr: Suivi de l'historique : Conservez les enregistrements des rendez-vous passés

source: Location Details: Store addresses and directions
es: Detalles de Ubicación: Guarda direcciones e indicaciones
fr: Détails de l'emplacement : Stockez les adresses et les itinéraires

source: Best Practices
es: Mejores Prácticas
fr: Meilleures pratiques

source: Add appointments as soon as you schedule them
es: Añade las citas tan pronto como las programes
fr: Ajoutez les rendez-vous dès que vous les planifiez

source: Include provider contact information for easy access
es: Incluye la información de contacto del proveedor para un acceso fácil
fr: Incluez les coordonnées du prestataire pour un accès facile

source: Set reminders 1-2 days before appointments
es: Configura recordatorios 1-2 días antes de las citas
fr: Définissez des rappels 1 à 2 jours avant les rendez-vous

source: Add notes about questions to ask or symptoms to discuss
es: Añade notas sobre preguntas a realizar o síntomas a discutir
fr: Ajoutez des notes sur les questions à poser ou les symptômes à discuter

source: Record appointment outcomes and follow-up instructions
es: Registra los resultados de la cita y las instrucciones de seguimiento
fr: Enregistrez les résultats des rendez-vous et les instructions de suivi
