Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

source: Medical sources for health information provided in this tip:
es: Fuentes médicas para la información de salud proporcionada en este consejo:

source: View Source
es: Ver Fuente

# health_disclaimer
source: Disclaimer: This information is for educational purposes only and should not replace professional medical advice. Always consult with your healthcare provider before making health decisions.
es: Descargo de responsabilidad: Esta información es solo para fines educativos y no debe reemplazar el consejo médico profesional. Siempre consulte con su proveedor de atención médica antes de tomar decisiones de salud.

source: Medical Sources
es: Fuentes Médicas

source: Sources & References
es: Fuentes y Referencias

source: No citations available for this section.
es: No hay citas disponibles para esta sección.

source: Version 1.0.0
es: Versión 1.0.0

# about_app_description
source: Senior Nutrition is a comprehensive health and wellness app designed specifically for adults aged 50 and above. Our mission is to support healthy aging through personalized nutrition guidance, mindful eating practices, and safe fasting protocols tailored for seniors.
es: Senior Nutrition es una aplicación integral de salud y bienestar diseñada específicamente para adultos de 50 años en adelante. Nuestra misión es apoyar el envejecimiento saludable a través de orientación nutricional personalizada, prácticas de alimentación consciente y protocolos de ayuno seguros adaptados para personas mayores.

# about_vision_description
source: We believe that proper nutrition is fundamental to healthy aging. Our app combines the latest research in senior nutrition with user-friendly technology to help older adults maintain their health, independence, and quality of life.
es: Creemos que la nutrición adecuada es fundamental para el envejecimiento saludable. Nuestra aplicación combina la investigación más reciente en nutrición para personas mayores con tecnología fácil de usar para ayudar a los adultos mayores a mantener su salud, independencia y calidad de vida.

# about_feature_nutrition
source: Personalized nutrition tracking and recommendations
es: Seguimiento nutricional personalizado y recomendaciones

# about_feature_fasting
source: Senior-friendly fasting protocols with safety features
es: Protocolos de ayuno amigables para personas mayores con características de seguridad

# about_feature_medication
source: Medication and meal schedule integration
es: Integración de horarios de medicamentos y comidas

# about_feature_languages
source: Multi-language support (English, French, Spanish, Hebrew)
es: Soporte multiidioma (inglés, francés, español, hebreo)

# about_feature_accessibility
source: Enhanced accessibility with adjustable text sizes
es: Accesibilidad mejorada con tamaños de texto ajustables

# about_feature_voice
source: Voice assistance for hands-free operation
es: Asistencia de voz para operación manos libres

# about_story_description
source: This app was born from a deep understanding of the unique nutritional needs of seniors and the challenges they face in maintaining healthy eating habits. We worked closely with nutritionists, geriatric care specialists, and seniors themselves to create a tool that's both comprehensive and easy to use.
es: Esta aplicación nació de una comprensión profunda de las necesidades nutricionales únicas de las personas mayores y los desafíos que enfrentan para mantener hábitos alimentarios saludables. Trabajamos estrechamente con nutricionistas, especialistas en cuidado geriátrico y las propias personas mayores para crear una herramienta que sea tanto integral como fácil de usar.

# about_safety_description
source: All our features, especially the fasting protocols, are designed with senior safety in mind. We incorporate regular reminders, health checks, and emergency override options to ensure a safe and healthy experience.
es: Todas nuestras características, especialmente los protocolos de ayuno, están diseñadas teniendo en mente la seguridad de las personas mayores. Incorporamos recordatorios regulares, controles de salud y opciones de anulación de emergencia para garantizar una experiencia segura y saludable.

# about_disclaimer
source: This app is designed for informational purposes only and should not replace professional medical advice. Always consult with your healthcare provider before starting any new diet or fasting program.
es: Esta aplicación está diseñada solo para fines informativos y no debe reemplazar el consejo médico profesional. Siempre consulte con su proveedor de atención médica antes de comenzar cualquier nueva dieta o programa de ayuno.
