Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

source: Check Macronutrients: Progress bars show how close you are to your protein, carbs, and fat goals
fr: Vérifier les macronutriments : Les barres de progression montrent votre proximité avec vos objectifs de protéines, glucides et lipides

source: Monitor Micronutrients: Circular indicators show vitamin and mineral intake
fr: Surveiller les micronutriments : Des indicateurs circulaires montrent votre apport en vitamines et minéraux

source: Change Date: Use the arrows in the date selector to view different days
fr: Changer de date : Utilisez les flèches du sélecteur de date pour voir différents jours

source: Meals Section
fr: Section des repas

source: The Meals section lets you log and manage your daily meals, access commonly eaten items, and view nutrition tips.
fr: La section Repas vous permet d'enregistrer et gérer vos repas quotidiens, d'accéder aux aliments fréquemment consommés et de consulter des conseils nutritionnels.

source: Today's Meals: Lists all meals logged for the current day
fr: Repas du jour : Liste tous les repas enregistrés pour la journée en cours

source: Common Meals: Quick access to your frequently eaten meals
fr: Repas courants : Accès rapide à vos repas fréquemment consommés

source: Nutrition Tips: Provides advice tailored to your health profile
fr: Conseils nutritionnels : Fournit des conseils adaptés à votre profil de santé

source: Food Database: Access to detailed nutritional information
fr: Base de données alimentaire : Accès aux informations nutritionnelles détaillées

source: Managing Meals
fr: Gestion des repas

source: Add a Meal: Tap the + button in the header or the Add button in Today's Meals
fr: Ajouter un repas : Appuyez sur le bouton + dans l'en-tête ou sur le bouton Ajouter dans Repas du jour

source: Edit a Meal: Tap on any meal in your Today's Meals list to edit it
fr: Modifier un repas : Appuyez sur n'importe quel repas dans votre liste Repas du jour pour le modifier

source: Use Common Meals: Tap any meal in the Common Meals section to quickly add it to today
fr: Utiliser les repas courants : Appuyez sur n'importe quel repas dans la section Repas courants pour l'ajouter rapidement à aujourd'hui

source: Add to Common Meals: Long-press on a meal and select Add to Common Meals
fr: Ajouter aux repas courants : Appuyez longuement sur un repas et sélectionnez Ajouter aux repas courants

source: Delete a Meal: Long-press on a meal and select Delete
fr: Supprimer un repas : Appuyez longuement sur un repas et sélectionnez Supprimer

source: Adding a New Meal
fr: Ajout d'un nouveau repas

source: When adding a meal, follow these steps:
fr: Lors de l'ajout d'un repas, suivez ces étapes :

source: Good morning
fr: Bonjour

source: Good afternoon
fr: Bon après-midi

source: Good evening
fr: Bonsoir

source: High Blood Pressure
fr: Hypertension artérielle

source: Diabetes
fr: Diabète

source: Heart Disease
fr: Maladie cardiaque

source: Arthritis
fr: Arthrite

source: Osteoporosis
fr: Ostéoporose

source: Asthma
fr: Asthme

source: COPD
fr: BPCO

source: Stroke
fr: AVC

source: Alzheimer's
fr: Alzheimer

source: Parkinson's
fr: Parkinson

source: Kidney Disease
fr: Maladie rénale

source: Thyroid Disorder
fr: Trouble de la thyroïde

source: Chronic Pain
fr: Douleur chronique

source: Vegetarian
fr: Végétarien

source: Vegan
fr: Végétalien

source: Gluten-Free
fr: Sans gluten

source: Dairy-Free
fr: Sans produits laitiers

source: Nut-Free
fr: Sans noix

source: Low Sodium
fr: Faible en sodium

source: Low Sugar
fr: Faible en sucre

source: Low Fat
fr: Faible en gras

source: Kosher
fr: Casher

source: Pescatarian
fr: Pescetarien

source: Keto
fr: Cétogène

source: Paleo
fr: Paléo

source: Select from common conditions:
fr: Sélectionnez parmi les conditions courantes:

source: Select from common restrictions:
fr: Sélectionnez parmi les restrictions courantes:

source: Add medical condition
fr: Ajouter une condition médicale

source: Add dietary restriction
fr: Ajouter une restriction alimentaire

source: No medical conditions added
fr: Aucune condition médicale ajoutée

source: No dietary restrictions added
fr: Aucune restriction alimentaire ajoutée

source: American Units
fr: Unités Américaines

source: Using feet/inches and pounds
fr: Utilisation des pieds/pouces et livres

source: Using centimeters and kilograms
fr: Utilisation des centimètres et kilogrammes

source: Height:
fr: Taille:

source: Weight:
fr: Poids:

source: ft
fr: pi

source: in
es: en
fr: po

source: lbs
fr: lb

source: First Name
fr: Prénom

source: Last Name
fr: Nom de famille

source: Date of Birth
fr: Date de naissance

source: Height (cm)
fr: Taille (cm)

source: Weight (kg)
fr: Poids (kg)

source: Gender
fr: Genre

source: Male
fr: Masculin

source: Female
fr: Féminin

source: Other
fr: Autre

source: %d years, %d months
fr: %d ans, %d mois

source: %d months
fr: %d mois

source: Severely Underweight
fr: Insuffisance pondérale sévère

source: Underweight
fr: Insuffisance pondérale

source: Normal Weight
es: Peso normal
fr: Poids normal

source: Overweight
es: Sobrepeso
fr: Surpoids

source: Obese Class I
es: Obesidad clase I
fr: Obésité classe I

source: Obese Class II
es: Obesidad clase II
fr: Obésité classe II

source: Obese Class III
es: Obesidad clase III
fr: Obésité classe III

source: BMI below 18.5
es: IMC por debajo de 18.5
fr: IMC inférieur à 18,5

source: BMI 18.5 - 24.9
es: IMC 18.5 - 24.9
fr: IMC 18,5 - 24,9

source: BMI 25.0 - 29.9
es: IMC 25.0 - 29.9
fr: IMC 25,0 - 29,9

source: BMI 30.0 - 34.9
es: IMC 30.0 - 34.9
fr: IMC 30,0 - 34,9

source: BMI 35.0 - 39.9
es: IMC 35.0 - 39.9
fr: IMC 35,0 - 39,9

source: BMI 40.0 and above
es: IMC 40.0 y superior
fr: IMC 40,0 et plus

source: Obese (Class I)
fr: Obésité (Classe I)

source: Obese (Class II)
fr: Obésité (Classe II)

source: Obese (Class III)
fr: Obésité (Classe III)

source: Search for Food: Tap 'Search Food Database' to find foods
fr: Rechercher un aliment : Appuyez sur 'Rechercher dans la base de données alimentaire' pour trouver des aliments

source: Enter Meal Details: Add a name, select meal type (breakfast, lunch, dinner, or snack)
fr: Saisir les détails du repas : Ajoutez un nom, sélectionnez le type de repas (petit-déjeuner, déjeuner, dîner ou collation)

source: Set Portion Size: Choose small, medium, or large to adjust calories accordingly
fr: Définir la taille de la portion : Choisissez petite, moyenne ou grande pour ajuster les calories en conséquence

source: Add Notes: Optionally add notes about the meal
fr: Ajouter des notes : Ajoutez éventuellement des notes concernant le repas

source: Analyze Nutrition: View detailed nutritional breakdown before saving
fr: Analyser la nutrition : Consultez la répartition nutritionnelle détaillée avant d'enregistrer

source: Save Meal: Tap 'Save Meal' to add it to your day
fr: Enregistrer le repas : Appuyez sur 'Enregistrer le repas' pour l'ajouter à votre journée

source: Finding Foods
fr: Recherche d'aliments

source: The food search feature helps you quickly find foods and their nutritional information:
fr: La fonction de recherche d'aliments vous aide à trouver rapidement des aliments et leurs informations nutritionnelles :

source: Search Bar: Type food names to filter results
fr: Barre de recherche : Tapez des noms d'aliments pour filtrer les résultats

source: Category Filter: Use category buttons to narrow down options
fr: Filtre par catégorie : Utilisez les boutons de catégorie pour affiner les options

source: Food Selection: Tap any food item to select it
fr: Sélection d'aliments : Appuyez sur n'importe quel aliment pour le sélectionner

source: Food Details: View calories, protein, carbs, and fat for each food
fr: Détails des aliments : Consultez les calories, protéines, glucides et lipides pour chaque aliment

source: Custom Foods: Items marked 'Custom Food' are ones you've added yourself
fr: Aliments personnalisés : Les éléments marqués 'Aliment personnalisé' sont ceux que vous avez ajoutés vous-même

source: The Food Database section provides detailed nutritional information for thousands of foods:
fr: La section Base de données alimentaire fournit des informations nutritionnelles détaillées pour des milliers d'aliments :

source: Access the Database: Scroll down in the Meals tab and tap the Food Database card
fr: Accéder à la base de données : Faites défiler vers le bas dans l'onglet Repas et appuyez sur la carte Base de données alimentaire

source: Browse Foods: Search or filter by category to find specific items
fr: Parcourir les aliments : Recherchez ou filtrez par catégorie pour trouver des éléments spécifiques

source: View Details: Tap any food to see complete nutritional information
fr: Voir les détails : Appuyez sur n'importe quel aliment pour voir les informations nutritionnelles complètes

source: Detailed Nutrients: See macronutrients, vitamins, minerals, and serving information
fr: Nutriments détaillés : Consultez les macronutriments, vitamines, minéraux et informations sur les portions

source: Return to Meals: Tap the back button to go back to the Meals section
fr: Retour aux repas : Appuyez sur le bouton retour pour revenir à la section Repas

source: Nutrition Tips
fr: Conseils nutritionnels

source: Access personalized nutrition recommendations based on your health profile:
fr: Accédez à des recommandations nutritionnelles personnalisées basées sur votre profil de santé :

source: View Tips: See general tips directly in the Meals section
fr: Voir les conseils : Consultez les conseils généraux directement dans la section Repas

source: Personalized Advice: Tap 'View More Tips' for recommendations tailored to your health conditions
fr: Conseils personnalisés : Appuyez sur 'Voir plus de conseils' pour des recommandations adaptées à vos conditions de santé

source: Medical Condition Tips: Get advice specific to conditions you've entered in your profile
fr: Conseils sur les conditions médicales : Obtenez des conseils spécifiques aux conditions que vous avez saisies dans votre profil

source: Dietary Restriction Tips: Receive guidance for your specific dietary needs
fr: Conseils sur les restrictions alimentaires : Recevez des conseils pour vos besoins alimentaires spécifiques

source: Supplement Recommendations: Learn about supplements that may benefit your health
fr: Recommandations de suppléments : Renseignez-vous sur les suppléments qui pourraient bénéficier à votre santé

source: Tips for Seniors
fr: Conseils pour les seniors

source: Senior-Friendly Nutrition Tips:
fr: Conseils nutritionnels adaptés aux seniors :

source: Focus on protein-rich foods to maintain muscle mass
fr: Concentrez-vous sur les aliments riches en protéines pour maintenir la masse musculaire

source: Choose nutrient-dense foods over empty calories
fr: Choisissez des aliments riches en nutriments plutôt que des calories vides

source: Stay well-hydrated throughout the day
fr: Restez bien hydraté tout au long de la journée

source: Include calcium and vitamin D for bone health
fr: Incluez du calcium et de la vitamine D pour la santé des os

source: Eat fiber-rich foods for digestive health
fr: Mangez des aliments riches en fibres pour la santé digestive

source: Incorporate omega-3 fatty acids for heart and brain health
fr: Incorporez des acides gras oméga-3 pour la santé du cœur et du cerveau

source: Meals Not Appearing: Pull down to refresh if recently added meals don't show
fr: Repas non visibles : Tirez vers le bas pour actualiser si les repas récemment ajoutés n'apparaissent pas

source: Search Not Working: Try simplifying your search terms or use category filters
fr: Recherche non fonctionnelle : Essayez de simplifier vos termes de recherche ou utilisez les filtres par catégorie

source: Nutrient Goals: Your nutrient goals are based on your profile information
fr: Objectifs nutritionnels : Vos objectifs nutritionnels sont basés sur les informations de votre profil

source: Adding Custom Foods: If you can't find a food, you can add custom entries
fr: Ajout d'aliments personnalisés : Si vous ne trouvez pas un aliment, vous pouvez ajouter des entrées personnalisées

source: Meal History: View past days using the date selector in the Dashboard
fr: Historique des repas : Consultez les jours passés en utilisant le sélecteur de date dans le Tableau de bord

source: For additional assistance with the Nutrition features, tap the Support button in Settings or use the voice assistant by tapping the microphone icon at the top of the screen.
fr: Pour une assistance supplémentaire concernant les fonctionnalités de Nutrition, appuyez sur le bouton Support dans les Paramètres ou utilisez l'assistant vocal en appuyant sur l'icône du microphone en haut de l'écran.

source: Help: More
fr: Aide : Plus

source: The More section provides access to essential app settings, your profile, help resources, and additional tools. This centralized hub lets you customize the app experience and access important information.
fr: La section Plus donne accès aux paramètres essentiels de l'application, à votre profil, aux ressources d'aide et aux outils supplémentaires. Ce centre centralisé vous permet de personnaliser l'expérience de l'application et d'accéder à des informations importantes.

source: Settings: Customize app appearance, notifications, and preferences
fr: Paramètres : Personnalisez l'apparence de l'application, les notifications et les préférences

source: Profile: View and update your personal health information
fr: Profil : Consultez et mettez à jour vos informations de santé personnelles

source: Help & Support: Access guides, tutorials, and contact support
fr: Aide et Support : Accédez aux guides, tutoriels et contactez le support

source: About: View app version, privacy policy, and terms of service
fr: À propos : Consultez la version de l'application, la politique de confidentialité et les conditions d'utilisation

source: Print Materials: Generate printable health summaries and reports
fr: Documents à Imprimer : Générez des résumés et rapports de santé imprimables

source: Settings Options
fr: Options de Paramètres

source: The Settings section allows you to customize how the app works and looks:
fr: La section Paramètres vous permet de personnaliser le fonctionnement et l'apparence de l'application :

source: Text Size: Adjust text size for better readability
fr: Taille du Texte : Ajustez la taille du texte pour une meilleure lisibilité

source: Voice Settings: Configure voice assistant and reading features
fr: Paramètres Vocaux : Configurez l'assistant vocal et les fonctionnalités de lecture

source: Appearance: Toggle dark mode, high contrast, and other visual options
fr: Apparence : Activez le mode sombre, le contraste élevé et d'autres options visuelles

source: Notifications: Customize alert types, sounds, and timing
fr: Notifications : Personnalisez les types d'alertes, les sons et le minutage

source: Data Management: Back up and restore your app data
fr: Gestion des Données : Sauvegardez et restaurez les données de votre application

source: Using Settings
fr: Utilisation des Paramètres

source: Access Settings: Tap the Settings option in the More screen
fr: Accéder aux Paramètres : Appuyez sur l'option Paramètres dans l'écran Plus

source: Adjust Text: Use the text size slider to make text larger or smaller
fr: Ajuster le Texte : Utilisez le curseur de taille de texte pour agrandir ou réduire le texte

source: Change Language: Tap Language to select from available options
fr: Changer de Langue : Appuyez sur Langue pour sélectionner parmi les options disponibles

source: Manage Notifications: Customize timing and types of alerts
fr: Gérer les Notifications : Personnalisez le minutage et les types d'alertes

source: Toggle Features: Turn features on/off using the switches
fr: Activer/Désactiver les Fonctionnalités : Utilisez les interrupteurs pour activer ou désactiver les fonctionnalités

source: Save Changes: Most settings are applied immediately when changed
fr: Enregistrer les Modifications : La plupart des paramètres sont appliqués immédiatement après modification

source: Profile Management
fr: Gestion du Profil

source: Your profile contains important information that helps personalize the app:
fr: Votre profil contient des informations importantes qui aident à personnaliser l'application :

source: Personal Information: Name, age, gender, and contact details
fr: Informations Personnelles : Nom, âge, sexe et coordonnées

source: Medical Conditions: Health conditions that affect recommendations
fr: Conditions Médicales : Conditions de santé qui affectent les recommandations

source: Dietary Restrictions: Food allergies, intolerances, and preferences
fr: Restrictions Alimentaires : Allergies alimentaires, intolérances et préférences

source: Medications: Current medication list that integrates with reminders
fr: Médicaments : Liste actuelle de médicaments qui s'intègre aux rappels

source: Emergency Contacts: People to contact in case of emergency
fr: Contacts d'Urgence : Personnes à contacter en cas d'urgence

source: Updating Profile
fr: Mise à jour du Profil

source: Access Profile: Tap the Profile option in the More screen
fr: Accéder au Profil : Appuyez sur l'option Profil dans l'écran Plus

source: Edit Information: Tap Edit button to modify any section
fr: Modifier les Informations : Appuyez sur le bouton Modifier pour modifier une section

source: Add Items: Use + buttons to add new conditions, medications, etc.
fr: Ajouter des Éléments : Utilisez les boutons + pour ajouter de nouvelles conditions, médicaments, etc.

source: Remove Items: Swipe left on any item to delete it
fr: Supprimer des Éléments : Glissez vers la gauche sur un élément pour le supprimer

source: Save Changes: Tap Save button to confirm your updates
fr: Enregistrer les Modifications : Appuyez sur le bouton Enregistrer pour confirmer vos mises à jour

source: Help & Support Options
fr: Options d'Aide et de Support

source: Find assistance with using the app through various resources:
fr: Trouvez de l'aide pour utiliser l'application grâce à diverses ressources :

source: Help Guides: Detailed instructions for each app section
fr: Guides d'Aide : Instructions détaillées pour chaque section de l'application

source: Video Tutorials: Step-by-step visual guides for key features
fr: Tutoriels Vidéo : Guides visuels étape par étape pour les fonctionnalités clés

source: Contact Support: Email, phone, or in-app messaging options
fr: Contacter le Support : Options de courrier électronique, téléphone ou messagerie dans l'application

source: Interactive Tour: Guided walkthrough of app features
fr: Visite Interactive : Présentation guidée des fonctionnalités de l'application

source: FAQ: Answers to common questions
fr: FAQ : Réponses aux questions fréquentes

source: Getting Help
fr: Obtenir de l'Aide

source: Access Help: Tap Help & Support in the More screen
fr: Accéder à l'Aide : Appuyez sur Aide et Support dans l'écran Plus

source: Browse Topics: Select from available help categories
fr: Parcourir les Sujets : Sélectionnez parmi les catégories d'aide disponibles

source: Watch Videos: Tap any video tutorial to start playback
fr: Regarder des Vidéos : Appuyez sur n'importe quel tutoriel vidéo pour démarrer la lecture

source: Contact Team: Use the Contact Support option to reach our team
fr: Contacter l'Équipe : Utilisez l'option Contacter le Support pour joindre notre équipe

source: Emergency Help: Use the Emergency button on the home screen for urgent issues
fr: Aide d'Urgence : Utilisez le bouton Urgence sur l'écran d'accueil pour les problèmes urgents

source: Generate printer-friendly documents for various purposes:
fr: Générez des documents adaptés à l'impression pour divers usages :

source: Health Summary: Comprehensive overview of your health data
fr: Résumé de Santé : Aperçu complet de vos données de santé

source: Medication List: Detailed list of current medications
fr: Liste de Médicaments : Liste détaillée des médicaments actuels

source: Nutrition Report: Summary of your dietary intake and patterns
fr: Rapport Nutritionnel : Résumé de votre apport alimentaire et de vos habitudes

source: Appointment Schedule: List of upcoming medical appointments
fr: Calendrier des Rendez-vous : Liste des prochains rendez-vous médicaux

source: Fasting Protocol: Details of your current fasting schedule
fr: Protocole de Jeûne : Détails de votre programme de jeûne actuel

source: Printing Documents
fr: Impression de Documents

source: Access Print: Tap Print Materials in the More screen
fr: Accéder à l'Impression : Appuyez sur Documents à Imprimer dans l'écran Plus

source: Select Document: Choose which report to generate
fr: Sélectionner un Document : Choisissez quel rapport générer

source: Set Date Range: Specify the time period for the report
fr: Définir la Plage de Dates : Spécifiez la période pour le rapport

source: Preview: Review the document before printing
fr: Aperçu : Examinez le document avant l'impression

source: Print or Share: Send to a printer or share digitally
fr: Imprimer ou Partager : Envoyez vers une imprimante ou partagez numériquement

source: Help with Printing: Get assistance with printer setup if needed
fr: Aide à l'Impression : Obtenez de l'aide pour la configuration de l'imprimante si nécessaire

source: The More section includes several helpful accessibility options:
fr: La section Plus comprend plusieurs options d'accessibilité utiles :

source: Voice Assistant: Get spoken guidance through app features
fr: Assistant Vocal : Recevez des instructions vocales sur les fonctionnalités de l'application

source: Text to Speech: Have content read aloud to you
fr: Synthèse Vocale : Faites lire le contenu à haute voix

source: High Contrast: Make text and buttons more visible
fr: Contraste Élevé : Rendez le texte et les boutons plus visibles

source: Large Text: Increase text size throughout the app
fr: Texte Large : Augmentez la taille du texte dans toute l'application

source: Button Labels: Add descriptive text to all buttons
fr: Étiquettes de Boutons : Ajoutez du texte descriptif à tous les boutons

source: Make the most of the More section with these helpful tips:
fr: Profitez au maximum de la section Plus avec ces conseils utiles :

source: Customize First: Take time to adjust text size and contrast for optimal viewing
fr: Personnalisez d'Abord : Prenez le temps d'ajuster la taille du texte et le contraste pour une visualisation optimale

source: Set Up Voice: Configure voice features for hands-free navigation
fr: Configurez la Voix : Configurez les fonctionnalités vocales pour une navigation mains libres

source: Emergency Contacts: Keep your emergency contact list updated
fr: Contacts d'Urgence : Maintenez votre liste de contacts d'urgence à jour

source: Regular Backups: Use the backup feature to protect your data
fr: Sauvegardes Régulières : Utilisez la fonction de sauvegarde pour protéger vos données

source: Print Key Info: Consider printing your medication list to keep in your wallet
fr: Imprimez les Informations Clés : Envisagez d'imprimer votre liste de médicaments pour la garder dans votre portefeuille

source: Settings Not Saving: Restart the app if settings aren't being applied
fr: Paramètres Non Enregistrés : Redémarrez l'application si les paramètres ne sont pas appliqués

source: Profile Updates: Make sure to tap Save after changing profile information
fr: Mises à Jour du Profil : Assurez-vous d'appuyer sur Enregistrer après avoir modifié les informations du profil

source: Printing Problems: Ensure your device is connected to a printer or sharing service
fr: Problèmes d'Impression : Assurez-vous que votre appareil est connecté à une imprimante ou à un service de partage
