Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

source: Language Issues: If text appears cut off after changing language, restart the app
fr: Problèmes de Langue : Si le texte apparaît coupé après avoir changé de langue, redémarrez l'application

source: Help Videos: If videos won't play, check your internet connection
fr: Vidéos d'Aide : Si les vidéos ne se lisent pas, vérifiez votre connexion Internet

source: Need Additional Help?
fr: Besoin d'Aide Supplémentaire ?

source: If you need further assistance with the More section or any other features, please contact our support team through the Help & Support option or call our senior support line.
fr: Si vous avez besoin d'aide supplémentaire avec la section Plus ou toute autre fonctionnalité, veuillez contacter notre équipe de support via l'option Aide et Support ou appelez notre ligne d'assistance pour seniors.

source: Stuffed Dishes
fr: Plats Farcis

source: Seeds
fr: Graines

source: Condiments / Spreads
fr: Condiments / Tartinades

source: Macronutrients
es: Macronutrientes
fr: Macronutriments

source: Vitamin C
es: Vitamina C
fr: Vitamine C

source: Iron
es: Hierro
fr: Fer

source: Translate All Foods
es: Traducir Todos los Alimentos
fr: Traduire Tous les Aliments

# food_database_promo_title
source: Food Database
fr: Base de Données Alimentaire

source: Hydration
es: Hidratación
fr: Hydratation

source: Activity
es: Actividad
fr: Activité

source: Medication
es: Medicación
fr: Médicaments

# SeniorSpecific
source: Senior Health
es: Específico para Mayores
fr: Spécifique aux Seniors

source: Blood Pressure
fr: Pression Artérielle

source: Weight Management
fr: Gestion du Poids

# health_tip_sleep_title
source: Prioritize Quality Sleep
es: Priorizar el Sueño de Calidad
fr: Priorisez un Sommeil de Qualité

# health_tip_diabetes_monitor_title
source: Monitor Blood Sugar Regularly
fr: Surveillez Régulièrement Votre Glycémie

# health_tip_diabetes_monitor_description
source: Check your blood glucose levels as recommended by your healthcare provider. Regular monitoring helps you understand how food, activity, and medication affect your levels.
fr: Vérifiez votre taux de glucose sanguin selon les recommandations de votre professionnel de santé. Une surveillance régulière vous aide à comprendre comment l'alimentation, l'activité et les médicaments affectent vos niveaux.

# health_tip_diabetes_glycemic_title
source: Choose Low Glycemic Foods
fr: Choisissez des Aliments à Faible Index Glycémique

# health_tip_diabetes_glycemic_description
source: Foods with a low glycemic index (GI) raise blood sugar more slowly. Choose whole grains, legumes, and non-starchy vegetables over refined carbohydrates.
fr: Les aliments à faible index glycémique (IG) font monter la glycémie plus lentement. Préférez les céréales complètes, les légumineuses et les légumes non féculents aux glucides raffinés.

# health_tip_diabetes_meal_timing_title
source: Time Your Meals Consistently
fr: Prenez Vos Repas à Heures Régulières

# health_tip_diabetes_meal_timing_description
source: Try to eat meals at the same time each day to help maintain stable blood sugar levels. Avoid skipping meals, especially if you take medication.
fr: Essayez de manger à la même heure chaque jour pour maintenir une glycémie stable. Évitez de sauter des repas, surtout si vous prenez des médicaments.

# health_tip_diabetes_active_title
source: Stay Active After Eating
fr: Restez Actif Après les Repas

# health_tip_diabetes_active_description
source: A short walk after meals can help lower post-meal blood sugar spikes. Aim for a 10-15 minute stroll after your largest meal of the day.
fr: Une courte marche après les repas peut aider à réduire les pics de glycémie post-repas. Visez une promenade de 10-15 minutes après votre repas principal de la journée.

# health_tip_diabetes_stress_title
source: Manage Stress Levels
fr: Gérez Votre Niveau de Stress

# health_tip_diabetes_stress_description
source: Stress can raise blood sugar levels. Practice relaxation techniques like deep breathing, meditation, or gentle yoga to help manage stress.
fr: Le stress peut augmenter la glycémie. Pratiquez des techniques de relaxation comme la respiration profonde, la méditation ou le yoga doux pour aider à gérer le stress.

# health_tip_diabetes_feet_title
source: Check Your Feet Daily
fr: Examinez Vos Pieds Quotidiennement

# health_tip_diabetes_feet_description
source: People with diabetes should inspect their feet daily for cuts, blisters, redness, or swelling. Good foot care prevents complications.
fr: Les personnes diabétiques doivent inspecter leurs pieds quotidiennement pour détecter coupures, ampoules, rougeurs ou gonflements. Un bon soin des pieds prévient les complications.

# health_tip_diabetes_hydration_title
source: Stay Hydrated
fr: Restez Hydraté

# health_tip_diabetes_hydration_description
source: Proper hydration helps your kidneys flush out excess sugar through urine. Aim for 8 glasses of water daily, more if your blood sugar is high.
fr: Une bonne hydratation aide vos reins à éliminer l'excès de sucre par l'urine. Visez 8 verres d'eau par jour, davantage si votre glycémie est élevée.

# health_tip_diabetes_fiber_title
source: Include Fiber in Every Meal
fr: Incluez des Fibres à Chaque Repas

# health_tip_diabetes_fiber_description
source: Fiber slows sugar absorption and improves blood glucose levels. Aim for 25-30 grams of fiber daily from vegetables, fruits, whole grains, and legumes.
fr: Les fibres ralentissent l'absorption du sucre et améliorent la glycémie. Visez 25-30 grammes de fibres quotidiennement provenant de légumes, fruits, céréales complètes et légumineuses.

# health_tip_diabetes_alcohol_title
source: Limit Alcohol Consumption
fr: Limitez la Consommation d'Alcool

# health_tip_diabetes_alcohol_description
source: Alcohol can cause blood sugar to drop too low if you take insulin or certain diabetes medications. If you drink, do so in moderation and always with food.
fr: L'alcool peut faire chuter dangereusement la glycémie si vous prenez de l'insuline ou certains médicaments antidiabétiques. Si vous buvez, faites-le avec modération et toujours avec de la nourriture.

# health_tip_diabetes_abc_title
source: Know Your ABCs
fr: Connaissez Vos ABC

# health_tip_diabetes_abc_description
source: For diabetes management, remember your ABCs: A1C (blood glucose test), Blood pressure, and Cholesterol. Keep all three within target ranges.
fr: Pour la gestion du diabète, rappelez-vous vos ABC : A1C (test de glycémie), Blood pressure (pression artérielle) et Cholesterol (cholestérol). Maintenez les trois dans les plages cibles.

# health_tip_diabetes_portion_title
source: Portion Control Matters
fr: Le Contrôle des Portions Est Important

# health_tip_diabetes_portion_description
source: Even healthy foods can raise blood sugar if portions are too large. Use measuring cups or a food scale until you can accurately estimate portion sizes.
fr: Même les aliments sains peuvent augmenter la glycémie si les portions sont trop grandes. Utilisez des tasses à mesurer ou une balance alimentaire jusqu'à ce que vous puissiez estimer précisément les tailles de portions.

# health_tip_diabetes_fats_title
source: Choose Healthy Fats
fr: Choisissez des Graisses Saines

# health_tip_diabetes_fats_description
source: Replace saturated fats with healthy fats from sources like olive oil, avocados, and nuts to improve insulin sensitivity and heart health.
fr: Remplacez les graisses saturées par des graisses saines provenant de sources comme l'huile d'olive, les avocats et les noix pour améliorer la sensibilité à l'insuline et la santé cardiaque.

# health_tip_diabetes_low_sugar_title
source: Be Prepared for Low Blood Sugar
fr: Soyez Préparé pour l'Hypoglycémie

# health_tip_diabetes_low_sugar_description
source: Always carry a fast-acting carbohydrate like glucose tablets, juice, or hard candy to treat hypoglycemia (low blood sugar).
fr: Ayez toujours sur vous un glucide à action rapide comme des comprimés de glucose, du jus ou des bonbons durs pour traiter l'hypoglycémie (baisse du taux de sucre dans le sang).

# health_tip_diabetes_eye_title
source: Schedule Regular Eye Exams
fr: Planifiez des Examens Oculaires Réguliers

# health_tip_diabetes_eye_description
source: Diabetes increases the risk of eye problems. Have a comprehensive dilated eye exam at least once a year to detect issues early.
fr: Le diabète augmente le risque de problèmes oculaires. Faites-vous faire un examen oculaire complet avec dilatation au moins une fois par an pour détecter les problèmes précocement.

# health_tip_diabetes_sleep_title
source: Prioritize Quality Sleep
fr: Priorisez un Sommeil de Qualité

# health_tip_diabetes_sleep_description
source: Poor sleep can affect blood sugar control and insulin sensitivity. Aim for 7-8 hours of quality sleep each night.
fr: Un mauvais sommeil peut affecter le contrôle de la glycémie et la sensibilité à l'insuline. Visez 7-8 heures de sommeil de qualité chaque nuit.

# health_tip_bp_sodium_title
source: Reduce Sodium Intake
fr: Réduisez Votre Consommation de Sodium

# health_tip_bp_sodium_description
source: Limit sodium to 1,500-2,300 mg per day. Read food labels, avoid processed foods, and use herbs and spices instead of salt for flavoring.
fr: Limitez le sodium à 1 500-2 300 mg par jour. Lisez les étiquettes des aliments, évitez les aliments transformés et utilisez des herbes et épices au lieu du sel pour assaisonner.

# health_tip_bp_dash_title
source: Follow the DASH Diet
fr: Suivez le Régime DASH

# health_tip_bp_dash_description
source: The DASH diet (Dietary Approaches to Stop Hypertension) emphasizes fruits, vegetables, whole grains, lean proteins, and low-fat dairy while limiting sodium and saturated fats.
fr: Le régime DASH (Approches Diététiques pour Stopper l'Hypertension) met l'accent sur les fruits, légumes, céréales complètes, protéines maigres et produits laitiers faibles en gras, tout en limitant le sodium et les graisses saturées.

# health_tip_bp_monitor_title
source: Monitor Your Blood Pressure
fr: Surveillez Votre Tension Artérielle

# health_tip_bp_monitor_description
source: Regular home monitoring helps you track your progress and alert you to potential problems. Keep a log of your readings to share with your doctor.
fr: La surveillance régulière à domicile vous aide à suivre vos progrès et vous alerte sur d'éventuels problèmes. Tenez un journal de vos mesures pour le partager avec votre médecin.

# health_tip_bp_alcohol_title
source: Limit Alcohol Consumption
fr: Limitez la Consommation d'Alcool

# health_tip_bp_alcohol_description
source: Excessive alcohol can raise blood pressure. Limit to one drink daily for women and two for men, or consider avoiding alcohol altogether.
fr: L'alcool excessif peut augmenter la tension artérielle. Limitez-vous à un verre par jour pour les femmes et deux pour les hommes, ou envisagez d'éviter complètement l'alcool.

# health_tip_bp_potassium_title
source: Increase Potassium Intake
fr: Augmentez Votre Apport en Potassium

# health_tip_bp_potassium_description
source: Potassium helps balance sodium in your cells. Include potassium-rich foods like bananas, potatoes, avocados, and leafy greens in your diet.
fr: Le potassium aide à équilibrer le sodium dans vos cellules. Incluez des aliments riches en potassium comme les bananes, les pommes de terre, les avocats et les légumes verts dans votre alimentation.

# health_tip_bp_stress_title
source: Practice Stress Management
fr: Pratiquez la Gestion du Stress

# health_tip_bp_stress_description
source: Chronic stress contributes to high blood pressure. Try deep breathing, meditation, yoga, or other relaxation techniques daily.
fr: Le stress chronique contribue à l'hypertension. Essayez la respiration profonde, la méditation, le yoga ou d'autres techniques de relaxation quotidiennement.

# health_tip_bp_weight_title
source: Maintain a Healthy Weight
fr: Maintenez un Poids Santé

# health_tip_bp_weight_description
source: Even modest weight loss can significantly lower blood pressure. Aim for a BMI between 18.5 and 24.9.
fr: Même une perte de poids modeste peut réduire significativement la tension artérielle. Visez un IMC entre 18,5 et 24,9.

# health_tip_bp_exercise_title
source: Exercise Regularly
fr: Faites de l'Exercice Régulièrement

# health_tip_bp_exercise_description
source: Aim for at least 150 minutes of moderate activity weekly. Regular exercise strengthens your heart and helps it pump more efficiently.
fr: Visez au moins 150 minutes d'activité modérée par semaine. L'exercice régulier renforce votre cœur et l'aide à pomper plus efficacement.

# health_tip_bp_caffeine_title
source: Limit Caffeine Intake
fr: Limitez Votre Consommation de Caféine

# health_tip_bp_caffeine_description
source: Caffeine can temporarily spike blood pressure. Limit coffee, tea, and energy drinks, especially if you have hypertension.
fr: La caféine peut temporairement faire monter la tension artérielle. Limitez le café, le thé et les boissons énergétiques, surtout si vous souffrez d'hypertension.

# health_tip_bp_medication_title
source: Take Medications as Prescribed
fr: Prenez Vos Médicaments Comme Prescrit

# health_tip_bp_medication_description
source: Blood pressure medications work best when taken consistently as directed. Never skip doses or stop taking medication without consulting your doctor.
fr: Les médicaments contre l'hypertension fonctionnent mieux lorsqu'ils sont pris régulièrement selon les indications. Ne sautez jamais de doses et n'arrêtez jamais de prendre vos médicaments sans consulter votre médecin.

# health_tip_bp_calcium_title
source: Increase Calcium Intake
fr: Augmentez Votre Apport en Calcium

# health_tip_bp_calcium_description
source: Adequate calcium helps regulate blood pressure. Include low-fat dairy, fortified plant milks, or calcium supplements if recommended by your doctor.
fr: Un apport adéquat en calcium aide à réguler la tension artérielle. Incluez des produits laitiers faibles en gras, des laits végétaux fortifiés ou des suppléments de calcium si recommandés par votre médecin.

# health_tip_bp_smoking_title
source: Quit Smoking
fr: Arrêtez de Fumer

# health_tip_bp_smoking_description
source: Each cigarette temporarily raises blood pressure. Quitting smoking helps lower blood pressure and improves overall cardiovascular health.
fr: Chaque cigarette augmente temporairement la tension artérielle. Arrêter de fumer aide à réduire la tension artérielle et améliore la santé cardiovasculaire globale.

# health_tip_bp_breathing_title
source: Practice Deep Breathing
fr: Pratiquez la Respiration Profonde

# health_tip_bp_breathing_description
source: Slow, deep breathing for 5-10 minutes daily can help lower blood pressure. Try breathing in deeply through your nose and out through your mouth.
fr: Une respiration lente et profonde pendant 5-10 minutes par jour peut aider à réduire la tension artérielle. Essayez de respirer profondément par le nez et d'expirer par la bouche.

# health_tip_bp_processed_title
source: Limit Processed Foods
fr: Limitez les Aliments Transformés

# health_tip_bp_processed_description
source: Highly processed foods often contain hidden sodium and unhealthy fats. Choose whole, unprocessed foods whenever possible.
fr: Les aliments hautement transformés contiennent souvent du sodium caché et des graisses malsaines. Choisissez des aliments entiers et non transformés dans la mesure du possible.

# health_tip_bp_sleep_title
source: Stay Consistent with Sleep
fr: Maintenez un Sommeil Régulier

# health_tip_bp_sleep_description
source: Aim for 7-8 hours of quality sleep each night. Poor sleep quality and sleep apnea can contribute to high blood pressure.
fr: Visez 7-8 heures de sommeil de qualité chaque nuit. Une mauvaise qualité de sommeil et l'apnée du sommeil peuvent contribuer à l'hypertension.

# health_tip_weight_portion_title
source: Practice Portion Control
fr: Pratiquez le Contrôle des Portions

# health_tip_weight_portion_description
source: Use smaller plates, measure servings, and be mindful of portion sizes. Even healthy foods can contribute to weight gain when portions are too large.
fr: Utilisez des assiettes plus petites, mesurez les portions et soyez conscient des tailles de portions. Même les aliments sains peuvent contribuer à la prise de poids lorsque les portions sont trop grandes.

# health_tip_weight_mindful_title
source: Eat Mindfully
fr: Mangez en Pleine Conscience

# health_tip_weight_mindful_description
source: Slow down while eating, savor each bite, and pay attention to hunger and fullness cues. Avoid distractions like TV or phones during meals.
fr: Ralentissez en mangeant, savourez chaque bouchée et soyez attentif aux signaux de faim et de satiété. Évitez les distractions comme la télévision ou les téléphones pendant les repas.

# health_tip_weight_planning_title
source: Plan Meals Ahead
fr: Planifiez les Repas à l'Avance

# health_tip_weight_planning_description
source: Planning and preparing meals in advance helps prevent impulsive, unhealthy food choices. Try batch cooking on weekends for easy weekday meals.
fr: Planifier et préparer les repas à l'avance aide à prévenir les choix impulsifs et malsains. Essayez de cuisiner en lots le week-end pour faciliter les repas en semaine.

# health_tip_weight_hydration_title
source: Stay Hydrated
fr: Restez Hydraté

# health_tip_weight_hydration_description
source: Sometimes thirst is mistaken for hunger. Drink water before meals and throughout the day to stay hydrated and help control appetite.
fr: Parfois, la soif est confondue avec la faim. Buvez de l'eau avant les repas et tout au long de la journée pour rester hydraté et aider à contrôler l'appétit.

# health_tip_weight_protein_title
source: Include Protein in Every Meal
fr: Incluez des Protéines à Chaque Repas

# health_tip_weight_protein_description
source: Protein increases satiety and helps preserve muscle mass during weight loss. Include lean protein sources like fish, poultry, beans, or tofu at each meal.
fr: Les protéines augmentent la satiété et aident à préserver la masse musculaire pendant la perte de poids. Incluez des sources de protéines maigres comme le poisson, la volaille, les haricots ou le tofu à chaque repas.

# health_tip_weight_fiber_title
source: Focus on Fiber
fr: Concentrez-vous sur les Fibres

# health_tip_weight_fiber_description
source: High-fiber foods promote fullness and support digestive health. Aim for 25-30 grams daily from vegetables, fruits, whole grains, and legumes.
fr: Les aliments riches en fibres favorisent la satiété et soutiennent la santé digestive. Visez 25-30 grammes par jour provenant de légumes, fruits, céréales complètes et légumineuses.

# health_tip_weight_movement_title
source: Move Throughout the Day
fr: Bougez Tout au Long de la Journée

# health_tip_weight_movement_description
source: Beyond structured exercise, look for ways to increase daily movement. Take the stairs, park farther away, or stand during phone calls.
fr: Au-delà de l'exercice structuré, cherchez des moyens d'augmenter le mouvement quotidien. Utilisez les escaliers, garez-vous plus loin ou levez-vous pendant les appels téléphoniques.

# health_tip_weight_tracking_title
source: Track Your Progress
fr: Suivez Vos Progrès

# health_tip_weight_tracking_description
source: Keep a food and activity journal to increase awareness and accountability. Apps or simple notebooks can help track patterns over time.
fr: Tenez un journal alimentaire et d'activités pour augmenter la conscience et la responsabilité. Les applications ou les carnets simples peuvent aider à suivre les tendances au fil du temps.

# health_tip_weight_stress_title
source: Manage Stress Eating
fr: Gérez l'Alimentation Liée au Stress

# health_tip_weight_stress_description
source: Find non-food ways to cope with stress, such as walking, deep breathing, or calling a friend. Identify emotional eating triggers and develop alternative responses.
fr: Trouvez des moyens non alimentaires de faire face au stress, comme marcher, respirer profondément ou appeler un ami. Identifiez les déclencheurs de l'alimentation émotionnelle et développez des réponses alternatives.

# health_tip_weight_sleep_title
source: Get Adequate Sleep
fr: Obtenez un Sommeil Adéquat

# health_tip_weight_sleep_description
source: Poor sleep disrupts hunger hormones and increases cravings. Prioritize 7-8 hours of quality sleep to support weight management efforts.
fr: Un sommeil insuffisant perturbe les hormones de la faim et augmente les envies. Priorisez 7-8 heures de sommeil de qualité pour soutenir les efforts de contrôle du poids.

# health_tip_weight_strength_title
source: Build Muscle with Strength Training
fr: Développez du Muscle avec l'Entraînement en Force

# health_tip_weight_strength_description
source: Muscle burns more calories than fat, even at rest. Include strength training exercises 2-3 times weekly to boost metabolism.
fr: Le muscle brûle plus de calories que la graisse, même au repos. Incluez des exercices de renforcement musculaire 2-3 fois par semaine pour augmenter le métabolisme.

# health_tip_weight_nutrient_title
source: Choose Nutrient-Dense Foods
fr: Choisissez des Aliments Riches en Nutriments

# health_tip_weight_nutrient_description
source: Focus on foods that provide maximum nutrition for the calories. Fill your plate with colorful vegetables, lean proteins, and whole grains.
fr: Concentrez-vous sur les aliments qui fournissent un maximum de nutrition pour les calories. Remplissez votre assiette de légumes colorés, de protéines maigres et de céréales complètes.

# health_tip_weight_liquid_title
source: Be Mindful of Liquid Calories
fr: Soyez Conscient des Calories Liquides

# health_tip_weight_liquid_description
source: Calories from beverages add up quickly and often don't satisfy hunger. Limit sugary drinks, alcohol, and high-calorie coffee drinks.
fr: Les calories des boissons s'accumulent rapidement et ne satisfont souvent pas la faim. Limitez les boissons sucrées, l'alcool et les boissons au café à haute teneur en calories.

# health_tip_weight_goals_title
source: Set Realistic Goals
fr: Fixez des Objectifs Réalistes

# health_tip_weight_goals_description
source: Aim for gradual, sustainable weight loss of 1-2 pounds per week. Small, achievable goals lead to lasting success.
fr: Visez une perte de poids progressive et durable de 0,5-1 kg par semaine. Les petits objectifs atteignables mènent à un succès durable.

# health_tip_weight_activities_title
source: Find Activities You Enjoy
fr: Trouvez des Activités que Vous Aimez

# health_tip_weight_activities_description
source: Exercise shouldn't feel like punishment. Explore different activities until you find something enjoyable that you'll stick with long-term.
fr: L'exercice ne devrait pas être ressenti comme une punition. Explorez différentes activités jusqu'à ce que vous trouviez quelque chose d'agréable que vous maintiendrez à long terme.

# health_tip_stress_title
source: Manage Stress Levels
es: Manejar el Estrés
fr: Gérez les Niveaux de Stress

# health_tip_checkups_title
source: Schedule Regular Check-ups
es: Chequeos Regulares
fr: Planifiez des Examens Réguliers

# health_tip_protein_title
source: Prioritize Protein
es: Consumir Suficiente Proteína
fr: Privilégiez les Protéines

# health_tip_fiber_title
source: Increase Fiber Intake
es: Enfóquese en la Fibra
fr: Augmentez l'Apport en Fibres

# health_tip_calcium_title
source: Get Enough Calcium
es: Calcio para Huesos Fuertes
fr: Obtenez Suffisamment de Calcium

# health_tip_vitaminD_title
source: Don't Forget Vitamin D
es: No se Olvide de la Vitamina D
fr: N'Oubliez Pas la Vitamine D

# health_tip_medication_schedule_title
source: Medication Schedule
es: Siga su Horario de Medicamentos
fr: Calendrier des Médicaments
