Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

source: General
fr: Général

source: Chinese
es: Chino
fr: Chinois

source: Russian
es: Ruso
fr: Russe

source: Middle Eastern
es: Medio Oriental
fr: Moyen-Oriental

source: Korean
es: Coreano
fr: Coréen

source: Japanese
es: Japonés
fr: Japonais

source: Indian
es: Indio
fr: Indien

source: Mexican
es: Mexicano
fr: Mexicain

source: Italian
es: Italiano
fr: Italien

source: All Cuisines
es: Todas las Cocinas
fr: Toutes les Cuisines

source: No foods in this cuisine
es: No hay alimentos en esta cocina
fr: Aucun aliment dans cette cuisine

source: Skip
de: Überspringen
es: Omitir
fr: Passer

source: Close
de: Schließen
fr: Fermer

source: Previous
de: Zurück
es: Anterior
fr: Précédent

source: Next
de: Weiter
es: Siguiente
fr: Suivant

source: Get Started
de: Loslegen
es: Comenzar
fr: Commencer

source: Track Your Meals & Nutrition
de: Verfolgen Sie Ihre Mahlzeiten und Ernährung
es: Rastree sus Comidas y Nutrición
fr: Suivez vos repas et votre nutrition

source: Monitor your diet with our easy-to-use food tracking system, including nutritional analysis and personalized recommendations.
de: Überwachen Sie Ihre Ernährung mit unserem einfach zu bedienenden Lebensmittelerfassungssystem, einschließlich Nährwertanalyse und personalisierten Empfehlungen.
es: Monitoree su dieta con nuestro sistema de seguimiento de alimentos fácil de usar, incluyendo análisis nutricional y recomendaciones personalizadas.
fr: Surveillez votre alimentation avec notre système de suivi facile à utiliser, incluant une analyse nutritionnelle et des recommandations personnalisées.

source: Photo-based meal logging
de: Mahlzeitenprotokollierung per Foto
es: Registro de comidas basado en fotos
fr: Enregistrement des repas par photo

source: Voice input for hands-free recording
de: Spracheingabe für freihändiges Erfassen
es: Entrada de voz para grabación manos libres
fr: Saisie vocale pour un enregistrement mains libres

source: Personalized Fasting Protocols
de: Personalisierte Fastenprotokolle
es: Protocolos de Ayuno Personalizados
fr: Protocoles de jeûne personnalisés

source: Follow gentle, senior-friendly intermittent fasting schedules with built-in safety features and health monitoring.
de: Folgen Sie sanften, seniorengerechten Intervallfastenplänen mit integrierten Sicherheitsfunktionen und Gesundheitsüberwachung.
es: Siga horarios de ayuno intermitente suaves y amigables para personas mayores con características de seguridad integradas y monitoreo de salud.
fr: Suivez des horaires de jeûne intermittent adaptés aux seniors, avec des fonctions de sécurité intégrées et un suivi de la santé.

source: Multiple preset protocols available
de: Mehrere voreingestellte Protokolle verfügbar
es: Múltiples protocolos preestablecidos disponibles
fr: Plusieurs protocoles prédéfinis disponibles

source: Real-time progress tracking
de: Echtzeit-Fortschrittsverfolgung
es: Seguimiento de progreso en tiempo real
fr: Suivi des progrès en temps réel

source: Emergency override with one tap
de: Notfall-Übersteuerung mit einem Tipp
es: Anulación de emergencia con un toque
fr: Dérogation d'urgence en un clic

source: Health Data Tracking
de: Gesundheitsdaten verfolgen
es: Seguimiento de Datos de Salud
fr: Suivi des données de santé

source: Monitor vital health metrics like blood pressure, weight, blood sugar, and heart rate with detailed visualizations and trend analysis.
de: Überwachen Sie wichtige Gesundheitsmetriken wie Blutdruck, Gewicht, Blutzucker und Herzfrequenz mit detaillierten Visualisierungen und Trendanalysen.
es: Monitoree métricas vitales de salud como presión arterial, peso, azúcar en sangre y frecuencia cardíaca con visualizaciones detalladas y análisis de tendencias.
fr: Surveillez les indicateurs de santé vitaux comme la tension artérielle, le poids, la glycémie et le rythme cardiaque avec des visualisations détaillées et une analyse des tendances.

source: Easy data entry with voice option
de: Einfache Dateneingabe mit Sprachoption
es: Entrada de datos fácil con opción de voz
fr: Saisie facile des données avec option vocale

source: Visual trends and patterns
de: Visuelle Trends und Muster
es: Tendencias y patrones visuales
fr: Tendances et modèles visuels

source: Exportable reports for doctor visits
de: Exportierbare Berichte für Arztbesuche
es: Informes exportables para visitas médicas
fr: Rapports exportables pour les visites médicales

source: Appointment Management
de: Terminverwaltung
es: Gestión de Citas
fr: Gestion des rendez-vous

source: Never miss a medical appointment with our comprehensive calendar system, reminders, and location tracking.
de: Verpassen Sie nie einen Arzttermin mit unserem umfassenden Kalendersystem, Erinnerungen und Standortverfolgung.
es: Nunca pierda una cita médica con nuestro sistema de calendario integral, recordatorios y seguimiento de ubicación.
fr: Ne manquez jamais un rendez-vous médical grâce à notre système complet de calendrier, de rappels et de suivi de localisation.

source: Schedule doctor visits and check-ups
de: Arztbesuche und Untersuchungen planen
es: Programar visitas médicas y chequeos
fr: Planifiez les visites médicales et les bilans de santé

source: Get timely reminders
de: Rechtzeitige Erinnerungen erhalten
es: Recibir recordatorios oportunos
fr: Recevez des rappels opportuns

source: Store location and provider details
de: Standort- und Anbieterdetails speichern
es: Almacenar ubicación y detalles del proveedor
fr: Enregistrez les détails de localisation et du prestataire

source: Comprehensive Medication Management
de: Umfassende Medikamentenverwaltung
es: Gestión Integral de Medicamentos
fr: Gestion complète des médicaments

source: Keep track of all your medications with automatic reminders and integration with your fasting schedule.
de: Behalten Sie alle Ihre Medikamente mit automatischen Erinnerungen und Integration in Ihren Fastenplan im Blick.
es: Mantenga un registro de todos sus medicamentos con recordatorios automáticos e integración con su horario de ayuno.
fr: Suivez tous vos médicaments avec des rappels automatiques et une intégration à votre programme de jeûne.

source: Visual pill identification
de: Visuelle Pillenerkennung
es: Identificación visual de píldoras
fr: Identification visuelle des pilules

source: Meal requirements tracking
de: Verfolgung der Mahlzeitenanforderungen
es: Seguimiento de requisitos de comidas
fr: Suivi des exigences alimentaires

source: Smart notifications synchronized with your routine
de: Intelligente Benachrichtigungen, synchronisiert mit Ihrer Routine
es: Notificaciones inteligentes sincronizadas con su rutina
fr: Notifications intelligentes synchronisées avec votre routine

source: Health Monitoring & Support
de: Gesundheitsüberwachung & Unterstützung
es: Monitoreo de Salud y Soporte
fr: Surveillance et soutien de la santé

source: Track key health metrics and get personalized guidance with continuous support whenever you need it.
de: Verfolgen Sie wichtige Gesundheitsmetriken und erhalten Sie personalisierte Beratung mit kontinuierlicher Unterstützung, wann immer Sie sie benötigen.
es: Rastree métricas clave de salud y obtenga orientación personalizada con soporte continuo cuando lo necesite.
fr: Suivez les indicateurs de santé clés et obtenez des conseils personnalisés avec un soutien continu chaque fois que vous en avez besoin.

source: Video tutorials and live support
de: Videoanleitungen und Live-Support
es: Tutoriales en video y soporte en vivo
fr: Tutoriels vidéo et assistance en direct

source: Health data visualization
de: Gesundheitsdaten-Visualisierung
es: Visualización de datos de salud
fr: Visualisation des données de santé

source: Emergency contact system
de: Notfallkontaktsystem
es: Sistema de contacto de emergencia
fr: Système de contacts d'urgence

source: Settings
es: Ajustes
fr: Paramètres

source: High Contrast Mode
es: Modo de Alto Contraste
fr: Mode contraste élevé

source: Privacy Policy
es: Política de Privacidad
fr: Politique de confidentialité

source: Cancel
es: Cancelar
fr: Annuler

source: Save
es: Guardar
fr: Enregistrer

source: Done
es: Hecho
fr: Terminé

source: Add
es: Añadir
fr: Ajouter

source: Print
es: Imprimir
fr: Imprimer

source: Help with Printing
es: Ayuda con la Impresión
fr: Aide à l'impression

source: Print Materials
es: Materiales de Impresión
fr: Matériaux à imprimer

source: Add Meal
es: Agregar Comida
fr: Ajouter un repas

source: Edit Meal
es: Editar Comida
fr: Modifier le repas

source: Save Meal
fr: Enregistrer le repas

source: Save Anyway
fr: Enregistrer quand même

source: Analyze Nutrition
fr: Analyser la nutrition

source: Add Appointment
es: Agregar Cita
fr: Ajouter un rendez-vous

source: Emergency Contacts
es: Contactos de Emergencia
fr: Contacts d'urgence

source: Call
fr: Appeler

source: Personal Information
fr: Informations personnelles

source: Physical Information
fr: Informations physiques

source: Medical Conditions
fr: Conditions médicales

source: Dietary Restrictions
fr: Restrictions alimentaires

source: Today's Meals
es: Comidas de Hoy
fr: Repas du jour

source: No meals logged today
fr: Aucun repas enregistré aujourd'hui

source: Add First Meal
fr: Ajouter le premier repas

source: Common Meals
es: Comidas Comunes
fr: Repas courants

source: Food Database
es: Base de Datos de Alimentos
fr: Base de données alimentaire

source: View detailed nutrition information for all foods, including pasta dishes and more
es: Ver información nutricional detallada de todos los alimentos, incluyendo platos de pasta y más.
fr: Voir les informations nutritionnelles détaillées pour tous les aliments, y compris les plats de pâtes et plus

source: View More
es: Ver más
fr: Voir plus

source: All
es: Todos
fr: Tous

source: Health Tips
es: Consejos de Salud
fr: Conseils de santé

source: Search health tips
es: Buscar consejos de salud
fr: Rechercher des conseils santé

source: Stop
es: Parar
fr: Arrêter

source: Read
es: Leer
fr: Lire

source: Settings Saved!
es: ¡Configuración guardada!
fr: Paramètres enregistrés !

source: No data available to display chart
es: No hay datos disponibles para mostrar el gráfico
fr: Aucune donnée disponible pour afficher le graphique

source: Accessibility
es: Accesibilidad
fr: Accessibilité

source: About
es: Acerca de
fr: À propos

source: Video Tutorials
es: Tutoriales en Video
fr: Tutoriels vidéo

source: Voice Assistance
es: Asistencia por Voz
fr: Assistance vocale

source: Health Monitoring
es: Monitoreo de Salud
fr: Suivi de santé

source: Medication Management
es: Gestión de Medicamentos
fr: Gestion des médicaments

source: Quick Actions
es: Acciones Rápidas
fr: Actions rapides

source: Need More Help?
es: ¿Necesitas Más Ayuda?
fr: Besoin d'aide supplémentaire ?

source: Home
es: Inicio
fr: Accueil

source: Open Settings
es: Abrir Configuración
fr: Ouvrir les paramètres

source: Get Help
es: Obtener Ayuda
fr: Obtenir de l'aide

source: Good Morning
es: Buenos Días
fr: Bonjour

source: Good Afternoon
es: Buenas Tardes
fr: Bon après-midi

source: Good Evening
es: Buenas Noches
fr: Bonsoir

source: Read Welcome Summary
es: Leer Resumen de Bienvenida
fr: Lire le résumé d'accueil

source: Reads out your greeting and medication reminders
es: Lee tu saludo y recordatorios de medicamentos
fr: Lit votre salutation et vos rappels de médicaments

source: Eating reminder
es: Recordatorio de alimentación
fr: Rappel d'alimentation

source: Fasting reminder
es: Recordatorio de ayuno
fr: Rappel de jeûne

source: 1 hour
es: 1 hora
fr: 1 heure

source: %d hours
es: %d horas
fr: %d heures

source: 0 minutes
es: 0 minutos
fr: 0 minute

source: and
es: y
fr: et

source: Age: %d years, %d months
es: Edad: %d años, %d meses
fr: Âge : %d ans, %d mois

source: Age: %d months
es: Edad: %d meses
fr: Âge : %d mois

source: Today is %@
es: Hoy es %@
fr: Aujourd'hui c'est %@

source: Medication Reminders
es: Recordatorios de Medicamentos
fr: Rappels de médicaments

source: No medications scheduled for today
es: No hay medicamentos programados para hoy
fr: Aucun médicament prévu pour aujourd'hui

source: And your fasting status: %@
fr: Et votre statut de jeûne : %@

source: Time remaining: %@
fr: Temps restant : %@

source: %d percent remain.
es: %d por ciento restante.
fr: %d pour cent restants.

source: of fasting
es: de ayuno
fr: de jeûne

source: of eating window
es: de ventana de alimentación
fr: de fenêtre alimentaire

source: Profile
es: Perfil
fr: Profil

source: Appointments
es: Citas
fr: Rendez-vous

source: Add Medication
es: Agregar Medicamento
fr: Ajouter un médicament

source: Getting Started
es: Empezando
fr: Pour commencer

source: Core Features
es: Funciones Principales
fr: Fonctionnalités principales

source: Legal
fr: Légal

source: Track meals, analyze nutrition, and monitor daily intake
es: Rastrea comidas, analiza la nutrición y monitorea la ingesta diaria
fr: Suivez les repas, analysez la nutrition et surveillez l'apport quotidien

source: Manage intermittent fasting schedules and track progress
es: Gestiona los horarios de ayuno intermitente y sigue el progreso
fr: Gérez les horaires de jeûne intermittent et suivez les progrès

source: Water Tracking
es: Seguimiento de Agua
fr: Suivi de l'eau

source: Monitor daily hydration and set water intake goals
es: Monitorea la hidratación diaria y establece metas de ingesta de agua
fr: Surveillez l'hydratation quotidienne et fixez des objectifs de consommation d'eau

source: Set reminders, track medications, and manage your health
es: Establece recordatorios, rastrea medicamentos y gestiona tu salud
fr: Définissez des rappels, suivez les médicaments et gérez votre santé

source: Health Data
es: Datos de Salud
fr: Données de santé

source: Track blood pressure, blood sugar, heart rate, and weight
es: Rastrea la presión arterial, el azúcar en sangre, el ritmo cardíaco y el peso
fr: Suivez la tension artérielle, la glycémie, la fréquence cardiaque et le poids

source: Watch step-by-step video guides
es: Mira guías en video paso a paso
fr: Regardez des guides vidéo étape par étape

source: Terms of Use
es: Términos de Uso
fr: Conditions d'utilisation

source: Water Tracker
es: Seguimiento de Agua
fr: Suivi de l'eau

source: Emergency
es: Emergencia
fr: Urgence

source: Health
es: Salud
fr: Santé

source: Fasting
es: Ayuno
fr: Jeûne

source: Today's Schedule
es: Horario de Hoy
fr: Programme du jour

source: Read Today's Schedule
es: Leer Horario de Hoy
fr: Lire le programme du jour

source: Reads out your appointments and medications for today
es: Lee tus citas y medicamentos para hoy
fr: Lit vos rendez-vous et médicaments du jour

source: Upcoming Appointments
es: Próximas Citas
fr: Rendez-vous à venir

source: See All
es: Ver Todo
fr: Voir tout

source: No upcoming appointments
es: No hay citas próximas
fr: Aucun rendez-vous à venir

source: Fasting Timer
es: Temporizador de Ayuno
fr: Minuteur de jeûne

source: End Fasting Early
es: Terminar Ayuno Temprano
fr: Arrêter le jeûne plus tôt

source: Start Fasting
es: Comenzar Ayuno
fr: Commencer le jeûne

source: Emergency Override
es: Anulación de Emergencia
fr: Dérogation d'urgence

source: Change Fasting Protocol
fr: Changer le protocole de jeûne

source: Current Protocol: %@
fr: Protocole actuel : %@

source: Select Protocol
fr: Sélectionner le protocole

source: Currently Selected
es: Actualmente Seleccionado
fr: Actuellement sélectionné

source: Select This Protocol
es: Seleccionar este Protocolo
fr: Sélectionner ce protocole

source: Benefits
es: Beneficios
fr: Bénéfices

source: Recommended For
es: Recomendado Para
fr: Recommandé pour

source: Guidelines
es: Pautas
fr: Consignes

source: Custom Protocol Setup
fr: Configuration du protocole personnalisé

source: Fasting Hours: %d
fr: Heures de jeûne : %d

source: Eating Hours: %d
fr: Heures d'alimentation : %d

source: Total hours must equal 24
fr: Le total des heures doit être égal à 24

source: Save Protocol
es: Guardar Protocolo
fr: Enregistrer le protocole

source: Custom Protocol
es: Protocolo Personalizado
fr: Protocole personnalisé

source: Last Meal Time
fr: Heure du dernier repas

source: Next Meal Time
fr: Heure du prochain repas

source: Last Meal
es: Última Comida
fr: Dernier repas

source: Next Meal
es: Próxima Comida
fr: Prochain repas

source: Complete
fr: Terminé

source: %d%% remain
fr: %d%% restant

source: Fasting Window: %@
fr: Fenêtre de jeûne : %@

source: Eating Window: %@
fr: Fenêtre alimentaire : %@

source: Medication Schedule
es: Horario de Medicamentos
fr: Programme de médicaments

source: 12 AM
fr: 00h

source: 12 PM
fr: 12h

source: Remember to drink plenty of water during your fast
es: Recuerda beber mucha agua durante tu ayuno
fr: N'oubliez pas de boire beaucoup d'eau pendant votre jeûne

source: If you feel unwell, end your fast immediately
es: Si te sientes mal, termina tu ayuno inmediatamente
fr: Si vous ne vous sentez pas bien, arrêtez immédiatement votre jeûne

source: Quality sleep helps with fasting results
es: Un sueño de calidad ayuda con los resultados del ayuno
fr: Un sommeil de qualité aide les résultats du jeûne

source: View More Health Tips
es: Ver Más Consejos de Salud
fr: Voir plus de conseils de santé

source: Custom
es: Personalizado
fr: Personnalisé

source: Gentle introduction to intermittent fasting
es: Introducción suave al ayuno intermitente
fr: Introduction douce au jeûne intermittent

source: Helps regulate blood sugar levels
es: Ayuda a regular los niveles de azúcar en sangre
fr: Aide à réguler la glycémie

source: Supports better sleep patterns
es: Apoya mejores patrones de sueño
fr: Favorise de meilleurs cycles de sommeil

source: Minimal disruption to daily routine
es: Mínima interrupción de la rutina diaria
fr: Perturbation minimale de la routine quotidienne

source: Enhanced fat burning
es: Quema de grasa mejorada
fr: Brûlage de graisse amélioré

source: Improved metabolic flexibility
es: Flexibilidad metabólica mejorada
fr: Flexibilité métabolique améliorée

source: Better appetite control
es: Mejor control del apetito
fr: Meilleur contrôle de l'appétit

source: Increased mental clarity
es: Mayor claridad mental
fr: Clarté mentale accrue

source: Supports cellular repair processes
es: Apoya los procesos de reparación celular
fr: Soutient les processus de réparation cellulaire

source: Maximum autophagy benefits
es: Máximos beneficios de autofagia
fr: Bénéfices maximums de l'autophagie

source: Significant fat burning potential
es: Potencial significativo de quema de grasa
fr: Potentiel important de brûlage de graisse

source: Improved insulin sensitivity
es: Sensibilidad a la insulina mejorada
fr: Sensibilité à l'insuline améliorée

source: Enhanced cognitive function
es: Función cognitiva mejorada
fr: Fonction cognitive améliorée

source: Promotes cellular repair and longevity
es: Promueve la reparación celular y la longevidad
fr: Favorise la réparation cellulaire et la longévité

source: Tailored to your specific needs
es: Adaptado a sus necesidades específicas
fr: Adapté à vos besoins spécifiques

source: Flexible scheduling
es: Programación flexible
fr: Planification flexible

source: Adaptable to your lifestyle
es: Adaptable a su estilo de vida
fr: Adaptable à votre mode de vie

source: Can be adjusted as needed
es: Se puede ajustar según sea necesario
fr: Peut être ajusté selon les besoins

source: Beginners to intermittent fasting
es: Principiantes en el ayuno intermitente
fr: Débutants au jeûne intermittent

source: Those with regular medication schedules
es: Personas con horarios regulares de medicación
fr: Ceux qui ont des horaires de médicaments réguliers

source: People with active social lives
es: Personas con vida social activa
fr: Personnes avec une vie sociale active

source: Those who prefer eating dinner with family
es: Quienes prefieren cenar con la familia
fr: Ceux qui préfèrent dîner en famille

source: Experienced fasters looking for more benefits
es: Ayunadores experimentados que buscan más beneficios
fr: Jeûneurs expérimentés recherchant plus de bénéfices

source: Those with stable blood sugar control
es: Personas con control estable del azúcar en sangre
fr: Ceux qui ont un contrôle glycémique stable

source: People looking for weight management
es: Personas que buscan controlar su peso
fr: Personnes cherchant à gérer leur poids

source: Those with flexible morning schedules
es: Personas con horarios matutinos flexibles
fr: Ceux qui ont des horaires matinaux flexibles

source: Experienced fasters
es: Ayunadores experimentados
fr: Jeûneurs expérimentés

source: Those seeking maximum health benefits
es: Quienes buscan los máximos beneficios para la salud
fr: Ceux qui recherchent des bénéfices santé maximum

source: People with stable health conditions
es: Personas con condiciones de salud estables
fr: Personnes avec des conditions de santé stables

source: Those comfortable with longer fasting periods
es: Personas cómodas con períodos de ayuno más largos
fr: Ceux à l'aise avec des périodes de jeûne plus longues

source: Those with unique scheduling needs
es: Personas con necesidades de programación únicas
fr: Ceux qui ont des besoins d'horaires uniques

source: People with specific health considerations
es: Personas con consideraciones de salud específicas
fr: Personnes avec des considérations de santé spécifiques

source: Those who've tried other protocols
es: Quienes han probado otros protocolos
fr: Ceux qui ont essayé d'autres protocoles

source: People with varying daily routines
es: Personas con rutinas diarias variables
fr: Personnes avec des routines quotidiennes variables

source: Start your fast after dinner
es: Comience su ayuno después de la cena
fr: Commencez votre jeûne après le dîner

source: Skip breakfast or have it later
es: Omita el desayuno o tómelo más tarde
fr: Sautez le petit-déjeuner ou prenez-le plus tard

source: Stay hydrated during fasting
es: Manténgase hidratado durante el ayuno
fr: Restez hydraté pendant le jeûne

source: Break fast with a light meal
es: Rompa el ayuno con una comida ligera
fr: Rompez le jeûne avec un repas léger

source: Take medications as prescribed with food if needed
fr: Prenez les médicaments prescrits avec de la nourriture si besoin

source: Consider ending eating by 8 PM
es: Considere terminar de comer a las 8 PM
fr: Envisagez de finir de manger à 20h

source: Break fast around 10 AM
es: Rompa el ayuno alrededor de las 10 AM
fr: Rompez le jeûne vers 10h

source: Plan meals within the 10-hour window
es: Planifique las comidas dentro de la ventana de 10 horas
fr: Planifiez les repas dans la fenêtre de 10h

source: Stay active but avoid intense exercise while fasting
es: Manténgase activo pero evite el ejercicio intenso durante el ayuno
fr: Restez actif mais évitez l'exercice intense pendant le jeûne

source: Monitor how you feel and adjust if needed
es: Controle cómo se siente y ajuste si es necesario
fr: Surveillez comment vous vous sentez et ajustez si besoin

source: End eating by 7 PM
es: Termine de comer a las 7 PM
fr: Finissez de manger à 19h

source: Break fast at 11 AM
es: Rompa el ayuno a las 11 AM
fr: Rompez le jeûne à 11h

source: Plan 2-3 nutritious meals in eating window
es: Planifique 2-3 comidas nutritivas en la ventana de alimentación
fr: Planifiez 2-3 repas nutritifs dans la fenêtre alimentaire

source: Stay well hydrated
es: Manténgase bien hidratado
fr: Restez bien hydraté

source: Consider electrolyte supplementation
es: Considere la suplementación con electrolitos
fr: Envisagez une supplémentation en électrolytes

source: Break fast with protein-rich foods
es: Rompa el ayuno con alimentos ricos en proteínas
fr: Rompez le jeûne avec des aliments riches en protéines

source: Choose times that fit your schedule
es: Elija horarios que se ajusten a su agenda
fr: Choisissez des horaires adaptés à votre emploi du temps
