Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

source: Keep a list of medications to bring to appointments
es: Mantén una lista de medicamentos para llevar a las citas
fr: Gardez une liste des médicaments à apporter aux rendez-vous

source: Organization Tips
es: Consejos de Organización
fr: Conseils d'organisation

source: Use consistent naming for providers and facilities
es: Usa nombres consistentes para proveedores y centros
fr: Utilisez une dénomination cohérente pour les prestataires et les établissements

source: Add appointment type (checkup, specialist, test, etc.)
es: Añade el tipo de cita (chequeo, especialista, prueba, etc.)
fr: Ajoutez le type de rendez-vous (bilan, spécialiste, test, etc.)

source: Include insurance information if needed
es: Incluye información del seguro si es necesario
fr: Incluez les informations d'assurance si nécessaire

source: Note any special instructions (fasting, bring records, etc.)
es: Anota cualquier instrucción especial (ayuno, llevar registros, etc.)
fr: Notez toutes les instructions spéciales (jeûne, apporter des dossiers, etc.)

source: Set different reminder times for different appointment types
es: Configura diferentes horas de recordatorio para diferentes tipos de citas
fr: Définissez des heures de rappel différentes pour différents types de rendez-vous

source: Integration with Other Features
es: Integración con Otras Funciones
fr: Intégration avec d'autres fonctionnalités

source: Link appointments with medication reminders
es: Vincula las citas con los recordatorios de medicamentos
fr: Liez les rendez-vous aux rappels de médicaments

source: Prepare health data to share with providers
es: Prepara los datos de salud para compartir con los proveedores
fr: Préparez les données de santé à partager avec les prestataires

source: Track symptoms before appointments
es: Sigue los síntomas antes de las citas
fr: Suivez les symptômes avant les rendez-vous

source: Record doctor's recommendations in notes
es: Registra las recomendaciones del médico en las notas
fr: Enregistrez les recommandations du médecin dans les notes

source: Set follow-up reminders based on appointment outcomes
es: Configura recordatorios de seguimiento basados en los resultados de la cita
fr: Définissez des rappels de suivi en fonction des résultats des rendez-vous

source: If reminders aren't working, check notification settings
es: Si los recordatorios no funcionan, revisa la configuración de notificaciones
fr: Si les rappels ne fonctionnent pas, vérifiez les paramètres de notification

source: Use the search function to find specific appointments
es: Usa la función de búsqueda para encontrar citas específicas
fr: Utilisez la fonction de recherche pour trouver des rendez-vous spécifiques

source: Export appointment data to share with caregivers
es: Exporta los datos de las citas para compartirlos con los cuidadores
fr: Exportez les données de rendez-vous pour les partager avec les soignants

source: Backup your appointment data regularly
es: Haz una copia de seguridad de tus datos de citas regularmente
fr: Sauvegardez régulièrement vos données de rendez-vous

source: Contact support if you need help with calendar sync
es: Contacta a soporte si necesitas ayuda con la sincronización del calendario
fr: Contactez le support si vous avez besoin d'aide pour la synchronisation du calendrier

# voice_command_navigate_home
source: Navigate to the home screen
es: Navegar a la pantalla de inicio
fr: Naviguer vers l'accueil

# voice_command_navigate_nutrition
source: Go to the nutrition tracking screen
es: Ir a la pantalla de seguimiento de nutrición
fr: Aller à l'écran de suivi nutritionnel

# voice_command_navigate_water
source: Open the water tracking screen
es: Abrir la pantalla de seguimiento de agua
fr: Ouvrir l'écran de suivi de l'eau

# voice_command_navigate_fasting
source: Navigate to the fasting timer
es: Navegar al temporizador de ayuno
fr: Naviguer vers le minuteur de jeûne

# voice_command_log_water
source: Log water consumption
es: Registrar consumo de agua
fr: Enregistrer la consommation d'eau

# voice_command_end_fast
source: End the current fast
es: Finalizar el ayuno actual
fr: Terminer le jeûne en cours

# voice_command_create_reminder
source: Create a new reminder
es: Crear un nuevo recordatorio
fr: Créer un nouveau rappel

# voice_command_set_language
source: Set language to [language]
es: Establecer el idioma en [idioma]
fr: Définir la langue sur [langue]

source: Frequently Asked Questions
fr: Questions fréquemment posées

source: Search FAQs...
fr: Rechercher dans la FAQ...

source: Can't find an answer?
fr: Vous ne trouvez pas de réponse ?

# faq_general_what_is_app
source: What is the Senior Nutrition App?
es: ¿Qué es SeniorNutrition App?
fr: Qu'est-ce que l'application Senior Nutrition ?

# faq_general_what_is_app_answer
source: The Senior Nutrition App is a comprehensive health and nutrition management tool designed specifically for seniors. It helps you track meals, monitor health metrics, manage medications, set fasting schedules, and maintain hydration. The app provides personalized insights and reminders to support your health goals.
es: SeniorNutrition App es un asistente de salud integral diseñado para ayudar a los adultos mayores a gestionar su nutrición, hidratación, medicamentos y ayuno intermitente para un envejecimiento saludable.
fr: C'est une application de santé complète conçue pour les seniors afin de gérer leur nutrition, leur jeûne, leurs médicaments et leur bien-être général.

# faq_general_who_is_for
source: Who is this app designed for?
es: ¿Para quién es esta aplicación?
fr: À qui s'adresse cette application ?

# faq_general_who_is_for_answer
source: This app is designed for seniors and older adults who want to maintain their health through better nutrition and lifestyle management. It's particularly helpful for those managing chronic conditions, taking medications, or following specific dietary plans. The app's accessibility features make it suitable for users with various abilities.
es: La aplicación está diseñada para adultos mayores (generalmente de 60 años en adelante), sus cuidadores y profesionales de la salud que buscan una herramienta fácil de usar para monitorear la salud y el bienestar.
fr: L'application est spécialement conçue pour les personnes âgées, leurs soignants et les membres de leur famille qui souhaitent suivre et améliorer leur santé.

# faq_general_is_free
source: Is the app free to use?
es: ¿La aplicación es gratuita?
fr: L'application est-elle gratuite ?

# faq_general_is_free_answer
source: The app offers both free and premium features. The free version includes basic nutrition tracking, water monitoring, medication reminders, and health data logging. Premium features include advanced analytics, unlimited food database access, priority support, and additional customization options.
es: Sí, la funcionalidad principal de la aplicación es completamente gratuita. Podríamos introducir funciones premium opcionales en el futuro para apoyar el desarrollo.
fr: Oui, les fonctionnalités de base de l'application sont gratuites. Des fonctionnalités avancées peuvent être disponibles via un abonnement.

# faq_general_data_privacy
source: How is my health data protected?
es: ¿Cómo se protege mi privacidad de datos?
fr: Comment mes données sont-elles protégées ?

# faq_general_data_privacy_answer
source: Your health data is stored locally on your device and is never shared with third parties without your explicit consent. All data is encrypted and secure. You have complete control over what information is stored and can export or delete your data at any time.
es: Nos tomamos la privacidad muy en serio. Todos sus datos de salud se almacenan de forma segura en su dispositivo y no se comparten con terceros sin su consentimiento explícito. Consulte nuestra Política de Privacidad para obtener más detalles.
fr: Nous accordons la priorité à votre vie privée. Toutes les données sont cryptées et stockées en toute sécurité. Nous ne partageons jamais vos informations de santé sans votre consentement. Consultez notre politique de confidentialité pour plus de détails.

# faq_startup_how_begin
source: How do I get started with the app?
es: ¿Cómo empiezo?
fr: Comment commencer ?

# faq_startup_how_begin_answer
source: Start by setting up your profile with basic information like age, weight, and health goals. Take the app tour to familiarize yourself with the features. Begin by adding your first meal or setting up medication reminders. The app will guide you through each step.
es: Simplemente descargue la aplicación, complete el recorrido de incorporación para configurar su perfil y comience a usar las funciones principales como el seguimiento de la nutrición y los recordatorios de medicamentos.
fr: Téléchargez l'application, créez votre profil en saisissant des informations de base sur votre santé, et commencez à explorer les fonctionnalités comme le suivi des repas et les rappels de médicaments.

# faq_startup_profile_setup
source: How do I set up my profile?
es: ¿Necesito configurar un perfil?
fr: Dois-je remplir toutes les informations de mon profil ?

# faq_startup_profile_setup_answer
source: Go to Settings > Profile to enter your personal information including age, weight, height, activity level, and health conditions. This helps the app provide personalized recommendations and accurate nutritional calculations.
es: Sí, configurar su perfil con información básica como edad, peso y objetivos de salud nos ayuda a personalizar las recomendaciones y el seguimiento para usted.
fr: Remplir votre profil avec précision nous aide à personnaliser les recommandations pour vous, mais vous pouvez commencer avec des informations de base et compléter le reste plus tard.

# faq_startup_language_change
source: How do I change the app language?
es: ¿Puedo cambiar el idioma de la aplicación?
fr: Puis-je changer la langue de l'application ?

# faq_startup_language_change_answer
source: Go to Settings > Language to select your preferred language. The app supports English, Spanish, French, and Hebrew. The change takes effect immediately and applies to all app content.
es: ¡Absolutamente! Puede cambiar el idioma en cualquier momento en el menú de Configuración de la aplicación. Ofrecemos soporte en varios idiomas.
fr: Oui, vous pouvez changer la langue dans les paramètres de l'application. Nous prenons en charge plusieurs langues pour mieux vous servir.

# faq_startup_data_backup
source: How do I backup my data?
es: ¿Cómo hago una copia de seguridad de mis datos?
fr: Comment puis-je sauvegarder mes données ?

# faq_startup_data_backup_answer
source: Your data is automatically saved locally on your device. For additional security, you can export your data through Settings > Data Management. We recommend regular backups, especially before device updates.
es: Sus datos se respaldan automáticamente si tiene habilitada la copia de seguridad de iCloud en la configuración de su dispositivo. Esto asegura que sus datos estén seguros si cambia de dispositivo.
fr: L'application sauvegarde automatiquement vos données sur votre compte. Vous pouvez également exporter manuellement vos données depuis la section des paramètres.

# faq_nutrition_how_track
source: How do I track my meals?
es: ¿Cómo registro mis comidas?
fr: Comment puis-je suivre ma nutrition ?

# faq_nutrition_how_track_answer
source: Tap the 'Nutrition' tab and select 'Add Meal'. Choose from our extensive food database or add custom foods. Enter portion sizes and the app will calculate calories, macronutrients, and other nutritional information. You can also take photos of your meals for visual tracking.
es: Vaya a la pestaña 'Nutrición' y toque 'Agregar Comida'. Puede buscar alimentos, escanear códigos de barras o agregar artículos personalizados para registrar su ingesta.
fr: Allez à la section 'Nutrition', appuyez sur 'Ajouter un repas', et recherchez ou saisissez les aliments que vous avez mangés. Vous pouvez également prendre une photo de votre repas pour une saisie plus rapide.

# faq_nutrition_food_database
source: How comprehensive is the food database?
es: ¿Qué tan extensa es la base de datos de alimentos?
fr: Votre base de données alimentaires est-elle complète ?

# faq_nutrition_food_database_answer
source: Our database includes thousands of foods including common meals, restaurant items, and international cuisine. Premium users have access to unlimited database searches and can add unlimited custom foods.
es: Nuestra base de datos contiene miles de alimentos comunes y de marca. Se actualiza continuamente para proporcionar información nutricional precisa.
fr: Nous avons une base de données complète d'aliments. Si vous ne trouvez pas un article, vous pouvez l'ajouter manuellement à votre journal.

# faq_nutrition_custom_foods
source: Can I add my own foods?
es: ¿Puedo agregar mis propios alimentos personalizados?
fr: Puis-je ajouter mes propres aliments ou recettes personnalisés ?

# faq_nutrition_custom_foods_answer
source: Yes! You can add custom foods by entering nutritional information manually. This is useful for homemade recipes, local foods, or items not in our database. Custom foods are saved to your personal database.
es: Sí, si no puede encontrar un alimento, puede crear fácilmente sus propios artículos personalizados con información nutricional para un seguimiento preciso.
fr: Oui, vous pouvez créer des aliments et des recettes personnalisés pour un suivi précis de vos repas faits maison.

# faq_nutrition_portion_sizes
source: How do I measure portion sizes accurately?
es: ¿Cómo manejo los tamaños de las porciones?
fr: Comment estimer les tailles des portions ?

# faq_nutrition_portion_sizes_answer
source: Use household measurements (cups, tablespoons), weight in grams, or visual comparisons. The app provides portion size guides and common serving sizes. For best accuracy, use a food scale when possible.
es: La aplicación le permite registrar los tamaños de las porciones utilizando medidas comunes (por ejemplo, taza, onza, gramos) o ingresando cantidades. También puede guardar porciones de uso frecuente.
fr: L'application fournit des guides visuels et des mesures courantes (tasses, onces) pour vous aider à estimer les tailles des portions avec précision.

# faq_nutrition_goals_setting
source: How do I set nutrition goals?
es: ¿Puedo establecer mis propios objetivos de nutrición?
fr: Puis-je définir mes propres objectifs nutritionnels ?

# faq_nutrition_goals_setting_answer
source: Go to Settings > Nutrition Goals to set daily targets for calories, protein, carbohydrates, fats, and other nutrients. The app can suggest goals based on your profile, or you can set custom targets with your healthcare provider.
es: Sí, en la configuración de su perfil, puede establecer objetivos diarios personalizados de calorías, macronutrientes (proteínas, grasas, carbohidratos) y micronutrientes.
fr: Oui, vous pouvez définir des objectifs personnalisés pour les calories, les macronutriments et les micronutriments en fonction des recommandations de votre médecin.

# faq_fasting_what_is
source: What is intermittent fasting?
es: ¿Qué es el ayuno intermitente?
fr: Qu'est-ce que le jeûne intermittent ?

# faq_fasting_what_is_answer
source: Intermittent fasting involves cycling between eating and fasting periods. Common protocols include 16:8 (16 hours fasting, 8 hours eating) or 12:12. The app helps you track fasting periods and provides guidance on safe fasting practices.
es: El ayuno intermitente es un patrón de alimentación que alterna entre períodos de ayuno y alimentación. Nuestra aplicación le ayuda a realizar un seguimiento de estos períodos con un temporizador fácil de usar.
fr: Le jeûne intermittent est un modèle alimentaire qui alterne entre des périodes de jeûne et d'alimentation. Consultez la section d'aide sur le jeûne pour en savoir plus.

# faq_fasting_safe
source: Is intermittent fasting safe for seniors?
es: ¿Es seguro el ayuno para los adultos mayores?
fr: Le jeûne est-il sans danger pour les seniors ?

# faq_fasting_safe_answer
source: Intermittent fasting can be safe for many seniors, but consult your healthcare provider first, especially if you have diabetes, take medications, or have underlying health conditions. Start with shorter fasting periods and monitor how you feel.
es: Si bien puede tener beneficios, es crucial consultar a su proveedor de atención médica antes de comenzar cualquier régimen de ayuno, especialmente si tiene condiciones de salud preexistentes.
fr: Le jeûne peut offrir des avantages pour la santé, mais il est important de consulter votre médecin avant de commencer tout nouveau régime de jeûne, surtout si vous avez des problèmes de santé sous-jacents.

# faq_fasting_protocols
source: What fasting protocols are available?
es: ¿Qué protocolos de ayuno son compatibles?
fr: Quels protocoles de jeûne l'application prend-elle en charge ?

# faq_fasting_protocols_answer
source: The app supports common protocols like 16:8, 18:6, 20:4, and 12:12. You can also create custom fasting schedules. The app tracks your fasting periods and provides reminders for eating windows.
es: La aplicación admite protocolos populares como 16:8, 18:6 y 20:4, y también le permite crear sus propios horarios de ayuno personalizados.
fr: L'application prend en charge les protocoles de jeûne courants comme 16:8, 18:6 et 5:2. Vous pouvez également créer un programme de jeûne personnalisé.

# faq_fasting_medications
source: Can I take medications during fasting?
es: ¿Puedo tomar medicamentos durante el ayuno?
fr: Puis-je prendre des médicaments pendant le jeûne ?

# faq_fasting_medications_answer
source: Always follow your doctor's instructions regarding medication timing. Some medications should be taken with food, while others can be taken on an empty stomach. Never skip prescribed medications without consulting your healthcare provider.
es: Algunos medicamentos deben tomarse con alimentos. Siempre consulte a su médico o farmacéutico sobre cómo manejar sus medicamentos durante los períodos de ayuno.
fr: Certains médicaments doivent être pris avec de la nourriture. Veuillez consulter votre médecin ou votre pharmacien pour savoir comment gérer vos médicaments pendant les périodes de jeûne.

# faq_fasting_emergency_stop
source: What if I need to stop fasting early?
es: ¿Qué pasa si necesito detener mi ayuno antes de tiempo?
fr: Que dois-je faire si je me sens mal pendant un jeûne ?

# faq_fasting_emergency_stop_answer
source: You can stop fasting at any time by tapping the 'Stop Fasting' button. Listen to your body - if you feel unwell, dizzy, or extremely hungry, it's important to eat. The app will record your actual fasting duration.
es: Puede detener el temporizador de ayuno en cualquier momento. Escuchar a su cuerpo es importante; si se siente mal, es mejor terminar el ayuno.
fr: Si vous vous sentez mal, il est important d'arrêter votre jeûne immédiatement. Écoutez votre corps et consultez un professionnel de la santé si les symptômes persistent.

# faq_water_how_much
source: How much water should I drink daily?
es: ¿Cuánta agua debo beber?
fr: Combien d'eau devrais-je boire chaque jour ?

# faq_water_how_much_answer
source: General recommendations suggest 8-10 glasses (64-80 ounces) per day, but individual needs vary based on age, activity level, climate, and health conditions. The app can help you set personalized hydration goals.
es: Las necesidades de hidratación varían, pero una pauta general es de 8-10 vasos por día. La aplicación le ayuda a establecer un objetivo personalizado y realizar un seguimiento de su ingesta.
fr: Les besoins en hydratation varient. L'application fournit une recommandation personnalisée basée sur votre profil, mais il est toujours préférable de consulter votre médecin.

# faq_water_reminders
source: How do water reminders work?
es: ¿Cómo funcionan los recordatorios de agua?
fr: Puis-je définir des rappels pour boire de l'eau ?

# faq_water_reminders_answer
source: You can set up hydration reminders in the Water Tracking section. The app will send notifications at regular intervals to remind you to drink water. You can customize reminder frequency and timing.
es: Puede configurar recordatorios personalizables a lo largo del día para asegurarse de beber agua de manera constante, incluso si no siente sed.
fr: Oui, vous pouvez configurer des rappels personnalisables tout au long de la journée pour vous aider à atteindre vos objectifs d'hydratation.

# faq_water_other_drinks
source: Do other drinks count toward hydration?
es: ¿Cuentan otras bebidas para la hidratación?
fr: D'autres boissons comptent-elles dans mon apport hydrique ?

# faq_water_other_drinks_answer
source: Water is the best choice for hydration, but other beverages like herbal tea, milk, and juice also contribute to fluid intake. Coffee and alcohol can be dehydrating, so balance them with water.
es: Si bien el agua es la mejor, otras bebidas como tés de hierbas y algunas frutas y verduras también contribuyen a su hidratación. Puede registrarlas en la aplicación.
fr: Bien que l'eau soit la meilleure, d'autres liquides comme les tisanes et les bouillons peuvent contribuer à votre hydratation. L'application vous permet de suivre différents types de boissons.

# faq_medication_add
source: How do I add my medications?
es: ¿Cómo agrego mis medicamentos?
fr: Comment ajouter mes médicaments ?

# faq_medication_add_answer
source: Go to the Medications section and tap 'Add Medication'. Enter the medication name, dosage, frequency, and timing. You can also add notes about side effects or special instructions.
es: Vaya a la sección 'Medicamentos' y toque 'Agregar Medicamento'. Puede ingresar el nombre, la dosis, la frecuencia y la hora del recordatorio.
fr: Allez à la section 'Médicaments', appuyez sur 'Ajouter un médicament', et entrez le nom, le dosage et l'horaire. Vous pouvez également scanner le code-barres sur l'emballage de votre médicament.

# faq_medication_reminders
source: How do medication reminders work?
es: ¿Cómo funcionan los recordatorios de medicamentos?
fr: Comment fonctionnent les rappels de médicaments ?

# faq_medication_reminders_answer
source: The app sends push notifications at your scheduled medication times. You can set multiple reminders per day and customize the notification sound and message. Reminders continue until you mark the medication as taken.
es: La aplicación le enviará una notificación cuando sea el momento de tomar su medicamento. Puede marcarlo como tomado directamente desde la notificación.
fr: L'application vous enverra des notifications lorsque qu'il est temps de prendre vos médicaments. Vous pouvez marquer chaque dose comme prise directement depuis la notification.

# faq_medication_missed
source: What if I miss a medication dose?
es: ¿Qué pasa si olvido una dosis?
fr: Que faire si je manque une dose ?

# faq_medication_missed_answer
source: If you miss a dose, check with your healthcare provider about whether to take it late or skip it. The app can help you track missed doses and provide guidance, but always follow your doctor's instructions.
es: La aplicación le permite registrar una dosis omitida y proporciona un historial para que pueda discutirlo con su médico. Consulte a su médico para obtener consejos sobre dosis omitidas.
fr: L'application vous permet d'enregistrer une dose manquée. Consultez votre médecin ou votre pharmacien pour obtenir des conseils sur la marche à suivre si vous manquez une dose de votre médicament.

# faq_medication_refills
source: How do I track medication refills?
es: ¿Puede la aplicación recordarme que resurtir mis recetas?
fr: L'application peut-elle me rappeler de renouveler mes ordonnances ?
