Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

# faq_medication_refills_answer
source: You can set refill reminders in the medication settings. The app will notify you when it's time to refill prescriptions. You can also track your medication inventory and set alerts for low supplies.
es: Sí, al configurar un medicamento, puede ingresar la cantidad y establecer un umbral bajo. La aplicación le notificará cuando sea el momento de solicitar un resurtido.
fr: Oui, vous pouvez définir des rappels de renouvellement en fonction du nombre de pilules que vous avez, afin de ne jamais être à court de médicaments importants.

# faq_medication_share
source: Can I share my medication list with my doctor?
es: ¿Puedo compartir mi lista de medicamentos?
fr: Puis-je partager ma liste de médicaments avec mon médecin ?

# faq_medication_share_answer
source: Yes, you can export your medication list and share it with healthcare providers. This helps ensure accurate medication reconciliation and reduces the risk of drug interactions.
es: Sí, puede exportar o imprimir su lista de medicamentos, incluidos los horarios y las dosis, para compartirla con familiares, cuidadores o profesionales de la salud.
fr: Oui, vous pouvez exporter votre liste de médicaments et votre historique de prise pour les partager avec votre médecin ou vos soignants.

# faq_health_what_track
source: What health metrics can I track?
es: ¿Qué datos de salud puedo seguir?
fr: Quelles données de santé puis-je suivre ?

# faq_health_what_track_answer
source: You can track blood pressure, blood sugar, heart rate, weight, and BMI. The app provides charts and trends to help you monitor changes over time and identify patterns.
es: Puede realizar un seguimiento de la nutrición, la ingesta de agua, los períodos de ayuno, el cumplimiento de los medicamentos, las citas y más. La aplicación proporciona un panel de control para ver su progreso.
fr: Vous pouvez suivre diverses mesures de santé, notamment la tension artérielle, la glycémie, le poids et la fréquence cardiaque. Ces données vous aident, ainsi que votre médecin, à surveiller votre santé globale.

# faq_health_accuracy
source: How accurate are the health tracking features?
es: ¿Qué tan precisos son los datos de salud?
fr: Dans quelle mesure le suivi de la santé est-il précis ?

# faq_health_accuracy_answer
source: The app provides a convenient way to record and track your health data, but the accuracy depends on the quality of your measurements and equipment. Always use properly calibrated devices and follow measurement protocols.
es: La precisión de los datos depende de la exactitud de su registro. Nuestra base de datos de alimentos y los cálculos se basan en fuentes estándar, pero siempre deben usarse como una guía.
fr: La précision dépend de la saisie correcte des données. Utilisez des appareils médicaux fiables pour les mesures et saisissez-les dans l'application. L'application fournit des tendances et des informations basées sur les données que vous fournissez.

# faq_health_export
source: How do I export my health data?
es: ¿Puedo exportar mis datos de salud?
fr: Puis-je exporter mes données de santé ?

# faq_health_export_answer
source: Go to Settings > Data Management to export your health data in various formats. You can share this data with healthcare providers or keep it as a backup.
es: Sí, puede exportar sus datos de salud (por ejemplo, resúmenes de nutrición, registros de medicamentos) como archivos PDF o CSV para compartirlos o para sus propios registros.
fr: Oui, vous pouvez exporter vos données de santé pour les partager avec votre médecin ou pour vos archives personnelles.

# faq_health_doctor_share
source: Should I share my app data with my doctor?
es: ¿Cómo comparto mis datos con mi médico?
fr: Comment puis-je partager mes données de santé avec mon médecin ?

# faq_health_doctor_share_answer
source: Sharing your app data can help your healthcare provider better understand your health patterns and make more informed decisions. Always discuss what data to share and how it will be used.
es: Use la función de exportación para generar un informe que puede imprimir o enviar por correo electrónico directamente a su proveedor de atención médica.
fr: Exportez vos données de santé sous forme de rapport PDF ou CSV, que vous pouvez ensuite imprimer ou envoyer par e-mail directement à votre médecin depuis l'application.

# faq_appointments_add
source: How do I add medical appointments?
es: ¿Cómo agrego citas médicas?
fr: Comment puis-je gérer mes rendez-vous chez le médecin ?

# faq_appointments_add_answer
source: Go to the Appointments section and tap 'Add Appointment'. Enter the date, time, provider information, and any notes about what to discuss or prepare for the appointment.
es: Vaya a la sección 'Citas' y toque 'Agregar Cita'. Puede ingresar la fecha, la hora, la ubicación y el nombre del médico.
fr: La section 'Rendez-vous' vous permet d'ajouter et de suivre tous vos rendez-vous médicaux. Vous pouvez définir des rappels et ajouter des notes pour chaque rendez-vous.

# faq_appointments_reminders
source: How do appointment reminders work?
es: ¿La aplicación me recordará mis citas?
fr: Recevrai-je des rappels pour mes rendez-vous ?

# faq_appointments_reminders_answer
source: You can set reminders for appointments at various intervals (1 day before, 2 hours before, etc.). The app will send notifications to ensure you don't miss important medical appointments.
es: Sí, puede configurar múltiples recordatorios para cada cita (por ejemplo, 1 día antes, 1 hora antes) para asegurarse de no olvidarla.
fr: Oui, vous pouvez définir plusieurs rappels pour chaque rendez-vous afin de vous assurer de ne jamais en manquer un.

# faq_appointments_notes
source: Can I add notes to appointments?
es: ¿Puedo agregar notas a mis citas?
fr: Puis-je ajouter des notes à mes rendez-vous ?

# faq_appointments_notes_answer
source: Yes, you can add detailed notes about what to discuss with your doctor, symptoms to report, questions to ask, or any preparation needed (like fasting for blood tests).
es: Sí, cada cita tiene una sección de notas donde puede anotar preguntas para su médico, síntomas que discutir o instrucciones de la visita.
fr: Oui, vous pouvez ajouter des notes pour noter les questions à poser à votre médecin, les symptômes à discuter ou les instructions de suivi.

# faq_accessibility_text_size
source: How do I change the text size?
es: ¿Puedo cambiar el tamaño del texto?
fr: Comment puis-je ajuster la taille du texte ?

# faq_accessibility_text_size_answer
source: Go to Settings > Accessibility to adjust text size. You can choose from Small, Medium, Large, or Extra Large. The change applies immediately across the entire app.
es: Sí, la aplicación es compatible con el Tamaño de Texto Dinámico. Puede ajustar el tamaño del texto en la configuración de accesibilidad de su dispositivo y la aplicación se adaptará.
fr: Vous pouvez modifier la taille du texte dans les paramètres d'accessibilité de l'application pour améliorer la lisibilité.

# faq_accessibility_voice
source: How do I use voice commands?
es: ¿La aplicación es compatible con comandos de voz?
fr: L'application prend-elle en charge les commandes vocales ?

# faq_accessibility_voice_answer
source: Enable voice assistance in Settings > Voice Assistance. You can then use voice commands to navigate the app, add meals, set reminders, and perform other functions. Voice feedback is also available.
es: Sí, hemos integrado comandos de voz para funciones clave como registrar agua o iniciar un ayuno, lo que facilita el uso para personas con movilidad o visión limitadas.
fr: Oui, l'application inclut une assistance vocale pour une navigation et une utilisation mains libres. Consultez la section d'aide vocale pour une liste des commandes disponibles.

# faq_accessibility_contrast
source: How do I enable high contrast mode?
es: ¿La aplicación es compatible con el modo de alto contraste?
fr: Existe-t-il un mode à contraste élevé ?

# faq_accessibility_contrast_answer
source: Go to Settings > Accessibility and toggle 'High Contrast Mode'. This increases the contrast between text and backgrounds, making the app easier to read for users with vision challenges.
es: Sí, la aplicación respeta la configuración de contraste de su dispositivo para garantizar la legibilidad para los usuarios con discapacidad visual.
fr: Oui, vous pouvez activer un mode à contraste élevé dans les paramètres d'accessibilité pour améliorer la visibilité pour les utilisateurs malvoyants.

# faq_technical_notifications
source: Why aren't my notifications working?
es: No recibo notificaciones. ¿Qué debo hacer?
fr: Je ne reçois pas de notifications. Que dois-je faire ?

# faq_technical_notifications_answer
source: Check your device's notification settings for the app. Go to Settings > Notifications and ensure the app has permission to send notifications. Also check that Do Not Disturb mode is not enabled.
es: Asegúrese de que las notificaciones para SeniorNutrition App estén habilitadas en la configuración de su dispositivo. Verifique también la configuración de recordatorios individuales dentro de la aplicación.
fr: Assurez-vous que les notifications sont activées pour l'application dans les paramètres de votre téléphone. Vérifiez également les paramètres de notification de l'application pour vous assurer que les rappels sont configurés correctement.

# faq_technical_data_loss
source: What if I lose my data?
es: Perdí mis datos. ¿Se pueden recuperar?
fr: J'ai perdu mes données. Puis-je les récupérer ?

# faq_technical_data_loss_answer
source: Your data is stored locally on your device. If you need to restore data, check if you have a recent backup. For future protection, regularly export your data through Settings > Data Management.
es: Si habilitó la copia de seguridad de iCloud, puede restaurar sus datos desde una copia de seguridad anterior. Póngase en contacto con el soporte para obtener ayuda.
fr: Si vos données ont été sauvegardées sur votre compte, vous devriez pouvoir les restaurer en vous reconnectant. Si vous avez besoin d'aide, contactez notre équipe de support.

# faq_technical_app_crash
source: What if the app crashes?
es: La aplicación se bloquea. ¿Qué debo hacer?
fr: L'application n'arrête pas de planter. Que puis-je faire ?

# faq_technical_app_crash_answer
source: Try closing and reopening the app. If crashes persist, restart your device. If the problem continues, contact support with details about when the crash occurs and what you were doing.
es: Intente reiniciar la aplicación y su dispositivo. Si el problema persiste, verifique si hay una actualización de la aplicación en la App Store o comuníquese con nuestro equipo de soporte.
fr: Essayez de redémarrer votre appareil et assurez-vous que l'application est mise à jour avec la dernière version. Si le problème persiste, veuillez contacter le support avec les détails de votre appareil et ce que vous faisiez lorsque l'application a planté.

# faq_technical_sync_issues
source: How do I sync data between devices?
es: Mis datos no se sincronizan entre dispositivos.
fr: Mes données ne se synchronisent pas entre les appareils.

# faq_technical_sync_issues_answer
source: Currently, the app stores data locally on each device. To transfer data between devices, use the export/import feature in Settings > Data Management. We're working on cloud sync for future updates.
es: Asegúrese de haber iniciado sesión en la misma cuenta de iCloud en ambos dispositivos y de que iCloud Drive esté habilitado para SeniorNutrition App.
fr: Assurez-vous d'être connecté au même compte sur les deux appareils et que vous disposez d'une connexion Internet stable. Si les problèmes de synchronisation persistent, contactez le support pour obtenir de l'aide.

# faq_support_contact
source: How do I contact support?
es: ¿Cómo me comunico con el soporte?
fr: Comment puis-je contacter le support client ?

# faq_support_contact_answer
source: You can contact support by email at support@seniornutrition.app or through the Contact Support option in the Help section. We typically respond within 24-48 hours.
es: Puede comunicarse con nuestro equipo de soporte por correo electrónico o por teléfono a través de la sección 'Ayuda y Soporte' en la aplicación.
fr: Vous pouvez contacter le support par e-mail à [email de support], ou via la section 'Contactez-nous' de l'application.

# faq_support_video_chat
source: Can I schedule a video call with support?
es: ¿Ofrecen soporte por video chat?
fr: Proposez-vous un support par chat vidéo ?

# faq_support_video_chat_answer
source: Yes! We offer video chat support for complex issues or personalized assistance. Request a video call through the Help section, and we'll schedule a convenient time for you.
es: Sí, ofrecemos soporte por video chat programado para problemas complejos o para usuarios que prefieren la asistencia cara a cara. Puede solicitar una sesión a través de la sección de ayuda.
fr: Oui, nous proposons un support par chat vidéo pour des démonstrations personnalisées et un dépannage. Vous pouvez prendre rendez-vous via la section d'aide.

# faq_support_feature_request
source: How do I request new features?
es: ¿Puedo solicitar una nueva función?
fr: Puis-je demander une nouvelle fonctionnalité ?

# faq_support_feature_request_answer
source: We welcome feature requests! Send your suggestions to support@seniornutrition.app with 'Feature Request' in the subject line. We review all requests and prioritize based on user needs.
es: ¡Absolutamente! Agradecemos los comentarios de los usuarios. Puede enviar solicitudes de funciones a través de nuestro formulario de contacto de soporte.
fr: Absolument ! Nous apprécions les commentaires des utilisateurs. Veuillez soumettre vos demandes de fonctionnalités via la section de commentaires de l'application ou en contactant notre équipe de support.

# faq_emergency_number
source: What emergency number does the app use?
es: ¿Puedo llamar a los servicios de emergencia desde la aplicación?
fr: L'application peut-elle appeler les services d'urgence ?

# faq_emergency_number_answer
source: The app automatically detects your region and uses the appropriate emergency number (911 for US, 112 for EU, etc.). You can also set a custom emergency number in Settings > Emergency Number.
es: Sí, hemos incluido un botón de llamada de emergencia de fácil acceso en la sección de Ayuda que puede marcar rápidamente su número de emergencia local.
fr: Oui, il y a un bouton d'urgence dans l'application qui peut être configuré pour appeler le 911 ou un contact d'urgence désigné.

# faq_emergency_contacts
source: How do I add emergency contacts?
es: ¿Puedo agregar contactos de emergencia personales?
fr: Comment configurer les contacts d'urgence ?

# faq_emergency_contacts_answer
source: Go to the Emergency Contacts section to add family members, caregivers, or healthcare providers. These contacts can be called directly from the app in case of emergency.
es: Sí, puede agregar contactos de emergencia personales en su perfil. Se puede acceder fácilmente a ellos y contactarlos desde la aplicación en caso de una emergencia.
fr: Vous pouvez ajouter des contacts d'urgence dans votre profil. Ces contacts seront avertis si vous activez la fonction d'urgence.

# faq_emergency_medical
source: What medical information should I include?
es: ¿Dónde almaceno mi información médica de emergencia?
fr: Où puis-je stocker mes informations médicales d'urgence ?

# faq_emergency_medical_answer
source: Include important medical information like allergies, current medications, chronic conditions, and emergency contacts. This information can be crucial for emergency responders and healthcare providers.
es: Puede almacenar información médica vital (alergias, condiciones, tipo de sangre) en su perfil. Esta información es fácilmente accesible para los socorristas.
fr: Il existe une section 'ID médical' dans votre profil où vous pouvez stocker des informations vitales telles que les allergies, les problèmes de santé et les médicaments actuels pour un accès rapide en cas d'urgence.

# privacy_policy_title
source: Privacy Policy
es: Política de Privacidad
fr: Politique de confidentialité

# privacy_policy_intro
source: Your privacy is important to us. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you use our mobile application. Please read this privacy policy carefully.
es: Esta página le informa de nuestras políticas con respecto a la recopilación, uso y divulgación de datos personales cuando utiliza nuestro Servicio y las opciones que tiene asociadas con esos datos.
fr: Votre vie privée est importante pour nous. Cette politique explique quelles informations nous collectons et comment nous les utilisons pour améliorer votre expérience.

# privacy_section_data_collection
source: 1. Information We Collect
fr: Collecte de données

# privacy_content_data_collection
source: We may collect information about you in a variety of ways. The information we may collect on the App includes personal data you voluntarily provide to us, such as your name, age, health conditions, and dietary preferences.
fr: Nous collectons les informations que vous fournissez, telles que les détails du profil, les repas enregistrés et les données de santé, pour personnaliser votre expérience et fournir des informations pertinentes.

# privacy_section_data_usage
source: 2. How We Use Your Information
fr: Utilisation des données

# privacy_content_data_usage
source: Having accurate information about you permits us to provide you with a smooth, efficient, and customized experience. Specifically, we may use information collected about you via the App to personalize your experience and offer tailored health recommendations.
fr: Les données sont utilisées pour suivre vos progrès, offrir des recommandations personnalisées et améliorer nos services. Les données agrégées et anonymisées peuvent être utilisées à des fins de recherche.

# privacy_section_data_sharing
source: 3. Disclosure of Your Information
fr: Partage de données

# privacy_content_data_sharing
source: We do not share your personal information with third parties except as required by law or to protect our rights. Your data is used solely for the functionality of the app and is not sold or rented to others.
fr: Nous ne partageons pas vos informations personnelles de santé avec des tiers sans votre consentement explicite, sauf si la loi l'exige. Vous pouvez choisir de partager des rapports avec votre médecin ou vos soignants.

# privacy_section_data_security
source: 4. Security of Your Information
fr: Sécurité des données

# privacy_content_data_security
source: We use administrative, technical, and physical security measures to help protect your personal information. While we have taken reasonable steps to secure the personal information you provide to us, please be aware that despite our efforts, no security measures are perfect or impenetrable.
fr: Nous utilisons des mesures de sécurité conformes aux normes de l'industrie, y compris le cryptage, pour protéger vos données contre tout accès non autorisé.

# privacy_section_user_rights
source: 5. Your Rights
fr: Vos droits

# privacy_content_user_rights
source: You have the right to review, change, or delete your personal information at any time. You can do this by accessing your account settings within the app or by contacting us directly.
fr: Vous avez le droit d'accéder, de modifier ou de supprimer vos informations personnelles. Vous pouvez gérer vos données dans les paramètres de l'application ou en contactant le support.

# privacy_section_policy_changes
source: 6. Changes to This Privacy Policy
fr: Modifications de la politique

# privacy_content_policy_changes
source: We may update this Privacy Policy from time to time. We will notify you of any changes by updating the 'Last Updated' date of this Privacy Policy. You are encouraged to periodically review this Privacy Policy to stay informed of our updates.
fr: Nous pouvons mettre à jour cette politique de confidentialité périodiquement. Nous vous informerons de tout changement important via l'application ou par e-mail.

# privacy_section_contact
source: 7. Contact Us
fr: Nous contacter

# privacy_content_contact
source: If you have questions or comments about this Privacy Policy, please contact us at support@seniornutrition.com.
fr: Si vous avez des questions sur cette politique de confidentialité, veuillez nous contacter à [email de support].

# terms_content_governing_law
source: These Terms of Use shall be governed by and construed in accordance with the laws of the jurisdiction in which our company is located, without regard to its conflict of law principles.
fr: Ces conditions sont régies par les lois de notre juridiction, sans égard à ses dispositions en matière de conflit de lois.

source: Nutrition Tracking
es: Seguimiento de Nutrición
fr: Suivi nutritionnel

source: Water Tracking Help
es: Ayuda para el Seguimiento de Agua
fr: Aide sur le suivi de l'eau

source: Stay hydrated and monitor your daily water intake
es: Mantente hidratado y monitorea tu consumo diario de agua
fr: Restez hydraté et surveillez votre consommation d'eau quotidienne

source: Tap the 'Water' tab at the bottom of your screen
es: Toca la pestaña 'Agua' en la parte inferior de tu pantalla
fr: Appuyez sur l'onglet 'Eau' en bas de votre écran

source: Set your daily water intake goal (recommended 8-10 glasses)
es: Establece tu meta diaria de consumo de agua (recomendado 8-10 vasos)
fr: Définissez votre objectif quotidien de consommation d'eau (recommandé 8-10 verres)

source: Use the + button to log each glass of water you drink
es: Usa el botón + para registrar cada vaso de agua que bebas
fr: Utilisez le bouton + pour enregistrer chaque verre d'eau que vous buvez

source: Track your progress throughout the day
es: Sigue tu progreso a lo largo del día
fr: Suivez vos progrès tout au long de la journée

source: Daily Goal Setting: Customize your hydration target
es: Establecimiento de Metas Diarias: Personaliza tu objetivo de hidratación
fr: Définition d'objectif quotidien : Personnalisez votre cible d'hydratation

source: Quick Logging: Tap to add water with one touch
es: Registro Rápido: Toca para añadir agua con un solo toque
fr: Enregistrement rapide : Appuyez pour ajouter de l'eau en un seul toucher

source: Progress Tracking: Visual progress bar shows daily completion
es: Seguimiento del Progreso: La barra de progreso visual muestra lo completado en el día
fr: Suivi de progression : La barre de progression visuelle montre l'achèvement quotidien

source: Reminders: Get notifications to stay hydrated
es: Recordatorios: Recibe notificaciones para mantenerte hidratado
fr: Rappels : Recevez des notifications pour rester hydraté

source: History: View your water intake over time
es: Historial: Consulta tu consumo de agua a lo largo del tiempo
fr: Historique : Consultez votre consommation d'eau au fil du temps

source: Hydration Tips
es: Consejos de Hidratación
fr: Conseils d'hydratation

source: Drink water first thing in the morning
es: Bebe agua a primera hora de la mañana
fr: Buvez de l'eau dès le matin

source: Keep a water bottle nearby throughout the day
es: Mantén una botella de agua cerca durante todo el día
fr: Gardez une bouteille d'eau à proximité tout au long de la journée

source: Drink water before, during, and after exercise
es: Bebe agua antes, durante y después del ejercicio
fr: Buvez de l'eau avant, pendant et après l'exercice

source: Listen to your body's thirst signals
es: Escucha las señales de sed de tu cuerpo
fr: Écoutez les signaux de soif de votre corps

source: Consider your activity level and climate
es: Considera tu nivel de actividad y el clima
fr: Tenez compte de votre niveau d'activité et du climat
