Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

# nutrition_step_1
source: Tap the 'Nutrition' tab at the bottom of the screen
es: Toque la pestaña 'Nutrición' en la parte inferior de la pantalla
fr: Appuyez sur l'onglet 'Nutrition' en bas de l'écran

# nutrition_step_2
source: To add a meal, tap the '+' button
es: Para agregar una comida, toque el botón '+'
fr: Pour ajouter un repas, appuyez sur le bouton '+'

# nutrition_step_3
source: Enter the meal details or select from suggestions
es: Ingrese los detalles de la comida o seleccione de las sugerencias
fr: Entrez les détails du repas ou sélectionnez parmi les suggestions

# nutrition_step_4
source: View your nutrition summary and recommendations
es: Vea su resumen nutricional y recomendaciones
fr: Consultez votre résumé nutritionnel et les recommandations

# nutrition_step_5
source: Track your progress over time with the charts
es: Siga su progreso a lo largo del tiempo con los gráficos
fr: Suivez vos progrès au fil du temps avec les graphiques

# settings_step_1
source: Tap the 'Settings' tab at the bottom of the screen
es: Toque la pestaña 'Configuración' en la parte inferior de la pantalla
fr: Appuyez sur l'onglet 'Paramètres' en bas de l'écran

# settings_step_2
source: Adjust text size for better readability
es: Ajuste el tamaño del texto para mejor legibilidad
fr: Ajustez la taille du texte pour une meilleure lisibilité

# settings_step_3
source: Toggle high contrast mode if needed
es: Active el modo de alto contraste si es necesario
fr: Activez le mode contraste élevé si nécessaire

# settings_step_4
source: Set up voice assistance options
es: Configure las opciones de asistencia de voz
fr: Configurez les options d'assistance vocale

# settings_step_5
source: Configure notification preferences
es: Configure las preferencias de notificación
fr: Configurez les préférences de notification

source: Print your current medication schedule
es: Imprima su horario actual de medicamentos
fr: Imprimez votre horaire de médicaments actuel

source: Fasting Guide
es: Guía de Ayuno
fr: Guide de Jeûne

source: Print your fasting protocol guide
es: Imprima su guía de protocolo de ayuno
fr: Imprimez votre guide de protocole de jeûne

source: Meal Suggestions
es: Sugerencias de Comidas
fr: Suggestions de Repas

source: Print healthy meal suggestions
es: Imprima sugerencias de comidas saludables
fr: Imprimez des suggestions de repas sains

source: Print step-by-step app instructions
es: Imprima instrucciones paso a paso de la aplicación
fr: Imprimez les instructions étape par étape de l'application

source: Daily
es: Diariamente
fr: Quotidien

source: Weekly on %@
es: Semanal los %@
fr: Hebdomadaire le %@

source: Every %d days
es: Cada %d días
fr: Tous les %d jours

source: Monthly on day %d
es: Mensual el día %d
fr: Mensuel le jour %d

source: Sunday
es: Domingo
fr: Dimanche

source: Monday
es: Lunes
fr: Lundi

source: Tuesday
es: Martes
fr: Mardi

source: Wednesday
es: Miércoles
fr: Mercredi

source: Thursday
es: Jueves
fr: Jeudi

source: Friday
es: Viernes
fr: Vendredi

source: Saturday
es: Sábado
fr: Samedi

source: Welcome to Senior Nutrition
es: Bienvenido a Nutrición para Mayores
fr: Bienvenue à Senior Nutrition

source: Customizable text size for easier reading
es: Tamaño de texto personalizable para lectura más fácil
fr: Taille de texte personnalisable pour une lecture plus facile

source: Language support for English, French, Spanish, and Hebrew
es: Soporte de idiomas para inglés, francés, español y hebreo
fr: Support linguistique pour l'anglais, le français, l'espagnol et l'hébreu

source: About the App
es: Acerca de la Aplicación
fr: À propos de l'application

source: Our Vision
es: Nuestra Visión
fr: Notre vision

source: The Story Behind
es: La Historia Detrás
fr: L'histoire derrière

source: Safety First
es: Seguridad Primero
fr: La sécurité avant tout

source: Contact Us
es: Contáctanos
fr: Contactez-nous

source: Emergency Number
es: Número de Emergencia
fr: Numéro d'Urgence

source: Detected for your region
es: Detectado para tu región
fr: Détecté pour votre région

source: Use Custom Emergency Number
es: Usar Número de Emergencia Personalizado
fr: Utiliser un Numéro d'Urgence Personnalisé

source: Custom Emergency Number
es: Número de Emergencia Personalizado
fr: Numéro d'Urgence Personnalisé

source: Enter emergency number
es: Ingresa número de emergencia
fr: Entrez le numéro d'urgence

source: Make sure this is the correct emergency number for your location
es: Asegúrate de que este sea el número de emergencia correcto para tu ubicación
fr: Assurez-vous que c'est le bon numéro d'urgence pour votre région

source: Currently active
es: Actualmente activo
fr: Actuellement actif

# fasting_timer_help_title
source: Fasting Timer
fr: Aide sur le minuteur de jeûne

# fasting_timer_help_description
source: Understanding fasting protocols and timer features
fr: Gérez vos périodes de jeûne et vos fenêtres de repas

# voice_assistance_help_title
source: Voice Help
fr: Aide de l'assistance vocale

# voice_assistance_video_description
source: A demonstration of voice command features
es: Una demostración de las funciones de comando de voz
fr: Un guide visuel pour configurer et utiliser l'assistance vocale

# video_tutorials_title
source: Video Tutorials
es: Tutoriales en video
fr: Tutoriels vidéo

# video_tutorials_description
source: Watch step-by-step guides for key features
es: Aprenda a usar la aplicación con nuestras guías en video.
fr: Apprenez à utiliser l'application avec nos guides vidéo.

# video_developer_notes_title
source: Developer Notes
es: Notas del desarrollador
fr: Notes du développeur

# video_developer_notes_body
source: The videos used in this app are placeholders. For development, ensure your video files (MP4 or MOV) are placed in the 'Resources/Videos/' directory of the project. Do not add them to the Xcode project directly to avoid build issues. The app will automatically detect and load them.
es: Asegúrese de que los archivos de video (MP4/MOV) se coloquen en el directorio Resources/Videos para que las vistas previas se carguen correctamente.
fr: Veuillez vous assurer que les fichiers vidéo (MP4/MOV) sont placés dans le répertoire Resources/Videos pour que les aperçus se chargent correctement.

# medication_help_title
source: Medication Help
es: Ayuda con Medicamentos
fr: Aide Médicaments

# medication_help_description
source: Learn how to manage your medications and reminders.
es: Aprenda a gestionar sus medicamentos y recordatorios.
fr: Apprenez à gérer vos médicaments et rappels.

# medication_help_nav_title
source: Medication Help
es: Ayuda con Medicamentos
fr: Aide Médicaments

# medication_getting_started_title
source: Getting Started
es: Para empezar
fr: Pour commencer

# medication_getting_started_body
source: The Medication Management feature helps you keep track of your medications, set reminders, and log when you've taken them. Here's how to get started:
es: La función de Gestión de Medicamentos le ayuda a realizar un seguimiento de sus medicamentos, establecer recordatorios y registrar cuándo los ha tomado. A continuación, le indicamos cómo empezar:
fr: La fonction de gestion des médicaments vous aide à suivre vos médicaments, à définir des rappels et à consigner vos prises. Voici comment commencer :

# medication_getting_started_step1
source: Tap the 'Medications' tab at the bottom of your screen.
es: Toque la pestaña 'Medicamentos' en la parte inferior de la pantalla.
fr: Appuyez sur l'onglet 'Médicaments' en bas de votre écran.

# medication_getting_started_step2
source: Tap 'Add Medication' to enter a new prescription or supplement.
es: Toque 'Añadir Medicamento' para introducir una nueva receta o suplemento.
fr: Appuyez sur 'Ajouter un médicament' pour saisir une nouvelle ordonnance ou un supplément.

# medication_getting_started_step3
source: Fill in the medication name, dosage, frequency, and timing. You can also add notes about side effects or special instructions.
es: Rellene el nombre del medicamento, la dosis y la frecuencia.
fr: Remplissez le nom, la posologie et la fréquence du médicament.

# medication_getting_started_step4
source: Set specific times for reminders to ensure you never miss a dose.
es: Establezca horas específicas para los recordatorios para asegurarse de no olvidar ninguna dosis.
fr: Définissez des heures spécifiques pour les rappels afin de ne jamais manquer une dose.

# medication_managing_reminders_title
source: Managing Reminders
es: Gestión de Recordatorios
fr: Gestion des rappels

# medication_managing_reminders_body
source: The app makes it easy to manage your medication schedule:
es: La aplicación facilita el seguimiento de su pauta de medicación:
fr: L'application facilite la gestion de votre programme de médication :

# medication_managing_reminders_item1
source: Receive Notifications: Get alerts on your phone when it's time to take a medication.
es: Recibir notificaciones: Reciba alertas en su teléfono cuando sea el momento de tomar un medicamento.
fr: Recevoir des notifications : Recevez des alertes sur votre téléphone quand il est temps de prendre un médicament.

# medication_managing_reminders_item2
source: Log Doses: Mark medications as 'Taken' directly from the notification or within the app.
es: Registrar dosis: Marque los medicamentos como 'Tomados' directamente desde la notificación o dentro de la aplicación.
fr: Consigner les doses : Marquez les médicaments comme 'Pris' directement depuis la notification ou dans l'application.

# medication_managing_reminders_item3
source: View History: Keep a log of your medication history to share with your doctor.
es: Ver historial: Mantenga un registro de su historial de medicación para compartirlo con su médico.
fr: Voir l'historique : Conservez un journal de votre historique de médication à partager avec votre médecin.

# medication_managing_reminders_item4
source: Snooze Reminders: If you're busy, you can snooze a reminder for a short period.
es: Posponer recordatorios: Si está ocupado, puede posponer un recordatorio durante un breve período.
fr: Rappeler plus tard : Si vous êtes occupé, vous pouvez reporter un rappel pour une courte période.

# medication_health_considerations_title
source: Health Considerations
es: Consideraciones de Salud
fr: Considérations de santé

# medication_health_considerations_body
source: Important notes for managing your medications:
es: Notas importantes para la gestión de sus medicamentos:
fr: Notes importantes pour la gestion de vos médicaments :

# medication_health_note1
source: Always consult with your healthcare provider before starting or stopping any medication.
es: Consulte siempre a su proveedor de atención médica antes de empezar o dejar de tomar cualquier medicamento.
fr: Consultez toujours votre professionnel de la santé avant de commencer ou d'arrêter un médicament.

# medication_health_note2
source: Some medications need to be taken with food. Check with your doctor or pharmacist.
es: Ciertos medicamentos deben tomarse con alimentos. Consulte a su médico o farmacéutico.
fr: Certains médicaments doivent être pris avec de la nourriture. Vérifiez auprès de votre médecin ou pharmacien.

# medication_health_note3
source: Keep your medication list updated with any changes from your doctor.
es: Mantenga su lista de medicamentos actualizada con cualquier cambio de su médico.
fr: Gardez votre liste de médicaments à jour avec toute modification de votre médecin.

# medication_health_note4
source: Use the 'Print' feature to create a physical copy of your medication list for appointments.
es: Utilice la función 'Imprimir' para crear una copia física de su lista de medicamentos para las citas.
fr: Utilisez la fonction 'Imprimer' pour créer une copie papier de votre liste de médicaments pour les rendez-vous.

# medication_video_description
source: A visual guide to using the medication management features.
es: Una guía visual para utilizar las funciones de gestión de medicamentos.
fr: Un guide visuel pour utiliser les fonctionnalités de gestion des médicaments.

# nutrition_goals_title
source: Nutrition Goals
es: Objetivos de Nutrición
fr: Objectifs Nutritionnels

# set_calorie_goal
source: Set your daily calorie target
es: Establecer objetivo de calorías
fr: Définissez votre objectif calorique quotidien

# expand_macros
source: Expand to macros
es: Detallar Macronutrientes
fr: Étendre aux macronutriments

# set_protein_goal
source: Set your daily protein target
es: Objetivo de Proteínas (g)
fr: Définissez votre objectif quotidien de protéines

# set_carb_goal
source: Set your daily carbohydrate target
es: Objetivo de Carbohidratos (g)
fr: Définissez votre objectif quotidien de glucides

# set_fat_goal
source: Set your daily fat target
es: Objetivo de Grasas (g)
fr: Définissez votre objectif quotidien de lipides

source: Save Goals
es: Guardar
fr: Enregistrer les objectifs

# current_goal
source: Your daily goal
es: Tu objetivo diario
fr: Votre objectif quotidien

# goal_reached
source: You have reached your goal!
es: ¡Has alcanzado tu objetivo!
fr: Vous avez atteint votre objectif !

# goal_below
source: You are below your goal
es: Estás por debajo de tu objetivo
fr: Vous êtes en dessous de votre objectif

# goal_exceeded
source: You have exceeded your goal
es: Has superado tu objetivo
fr: Vous avez dépassé votre objectif

source: Today
es: Hoy
fr: Aujourd'hui

source: Tomorrow
es: Mañana
fr: Demain

source: Past
es: Pasado
fr: Passé

source: %d day
es: %d día
fr: %d jour

source: %d days
es: %d días
fr: %d jours

source: No entries yet. Tap + to add your first reading.
es: Aún no hay entradas. Toca + para agregar tu primera lectura.
fr: Aucune entrée pour le moment. Appuyez sur + pour ajouter votre première lecture.

source: Tap to view history and charts
es: Toca para ver historial y gráficos
fr: Appuyez pour voir l'historique et les graphiques

source: N/A
es: N/D
fr: N/D

source: Latest
es: Último
fr: Dernier

source: Average
es: Promedio
fr: Moyenne

source: Elevated
es: Elevada
fr: Élevée

source: Stage 1
es: Etapa 1
fr: Stade 1

source: Stage 2
es: Etapa 2
fr: Stade 2

source: Crisis
fr: Crise

source: Your blood pressure is in the normal range. Keep up the good work!
es: Tu presión arterial está en el rango normal. ¡Sigue así!
fr: Votre tension artérielle est dans la plage normale. Continuez ainsi !

source: Your blood pressure is elevated. Consider lifestyle changes.
es: Tu presión arterial está elevada. Considera cambios en el estilo de vida.
fr: Votre tension artérielle est élevée. Envisagez des changements de mode de vie.

source: Your blood pressure is in hypertension stage 1. Consult your doctor.
es: Tu presión arterial está en hipertensión etapa 1. Consulta a tu médico.
fr: Votre tension artérielle est en hypertension stade 1. Consultez votre médecin.

source: Your blood pressure is in hypertension stage 2. Seek immediate medical attention.
es: Tu presión arterial está en hipertensión etapa 2. Busca atención médica inmediata.
fr: Votre tension artérielle est en hypertension stade 2. Cherchez une attention médicale immédiate.

source: Your blood pressure is critically high. Seek immediate medical attention!
es: Tu presión arterial está críticamente alta. ¡Busca atención médica inmediata!
fr: Votre tension artérielle est critiquement élevée. Cherchez une attention médicale immédiate !

source: Track your blood pressure regularly to see insights and trends.
es: Monitorea tu presión arterial regularmente para ver perspectivas y tendencias.
fr: Surveillez votre tension artérielle régulièrement pour voir les perspectives et tendances.

source: Time Range
es: Rango de Tiempo
fr: Plage de Temps

source: Systolic
es: Sistólica
fr: Systolique

source: Diastolic
es: Diastólica
fr: Diastolique

source: No readings recorded yet
es: Aún no se han registrado lecturas
fr: Aucune lecture enregistrée pour le moment

source: Systolic (top)
es: Sistólica (superior)
fr: Systolique (supérieure)

source: Diastolic (bottom)
es: Diastólica (inferior)
fr: Diastolique (inférieure)

source: Date & Time
es: Fecha y Hora
fr: Date et Heure

source: Please enter valid numbers
es: Por favor ingresa números válidos
fr: Veuillez entrer des nombres valides

source: Failed to save: (error.localizedDescription)
es: Error al guardar: (error.localizedDescription)
fr: Échec de la sauvegarde : (error.localizedDescription)

source: Blood Pressure
es: Presión Arterial
fr: Tension Artérielle

source: Blood Sugar
es: Azúcar en Sangre
fr: Glycémie

source: Your heart rate is in the normal range. Keep up the good work!
es: Tu frecuencia cardíaca está en el rango normal. ¡Sigue así!
fr: Votre fréquence cardiaque est dans la plage normale. Continuez ainsi !

source: Your heart rate is elevated. If this persists, consider consulting your doctor.
es: Tu frecuencia cardíaca está elevada. Si esto persiste, considera consultar a tu médico.
fr: Votre fréquence cardiaque est élevée. Si cela persiste, envisagez de consulter votre médecin.

source: Your heart rate is lower than normal. Consult your doctor.
es: Tu frecuencia cardíaca está más baja de lo normal. Consulta a tu médico.
fr: Votre fréquence cardiaque est plus basse que la normale. Consultez votre médecin.

source: Your heart rate is very high. Consider medical attention if accompanied by other symptoms.
es: Tu frecuencia cardíaca está muy alta. Considera atención médica si está acompañada de otros síntomas.
fr: Votre fréquence cardiaque est très élevée. Envisagez une attention médicale si accompagnée d'autres symptômes.

source: Track your heart rate regularly to see insights and trends.
es: Monitorea tu frecuencia cardíaca regularmente para ver perspectivas y tendencias.
fr: Surveillez votre fréquence cardiaque régulièrement pour voir les perspectives et tendances.

source: Start tracking your heart rate to see insights.
es: Comienza a monitorear tu frecuencia cardíaca para ver perspectivas.
fr: Commencez à surveiller votre fréquence cardiaque pour voir les perspectives.

source: Your weight has been stable recently. Good job maintaining consistency!
es: Tu peso ha estado estable recientemente. ¡Buen trabajo manteniendo la consistencia!
fr: Votre poids a été stable récemment. Bon travail pour maintenir la cohérence !

source: You've gained %.1f kg recently. Monitor your intake if this wasn't intended.
es: Has ganado %.1f kg recientemente. Monitorea tu ingesta si esto no era intencional.
fr: Vous avez pris %.1f kg récemment. Surveillez votre apport si ce n'était pas intentionnel.

source: You've lost %.1f kg recently. If intentional, good progress!
es: Has perdido %.1f kg recientemente. ¡Si fue intencional, buen progreso!
fr: Vous avez perdu %.1f kg récemment. Si c'était intentionnel, bon progrès !

source: Track your weight regularly to see insights and trends.
es: Monitorea tu peso regularmente para ver perspectivas y tendencias.
fr: Surveillez votre poids régulièrement pour voir les perspectives et tendances.

source: Your blood sugar is in the normal range. Keep up the good work!
es: Tu azúcar en sangre está en el rango normal. ¡Sigue así!
fr: Votre glycémie est dans la plage normale. Continuez ainsi !

source: Your blood sugar is in the pre-diabetic range. Consider lifestyle changes.
es: Tu azúcar en sangre está en el rango pre-diabético. Considera cambios en el estilo de vida.
fr: Votre glycémie est dans la plage pré-diabétique. Envisagez des changements de mode de vie.

source: Your blood sugar is in the diabetic range. Consult your doctor for guidance.
es: Tu azúcar en sangre está en el rango diabético. Consulta a tu médico para orientación.
fr: Votre glycémie est dans la plage diabétique. Consultez votre médecin pour des conseils.

source: Your blood sugar is low. Consider eating something with carbohydrates.
es: Tu azúcar en sangre está baja. Considera comer algo con carbohidratos.
fr: Votre glycémie est basse. Envisagez de manger quelque chose avec des glucides.

source: Your blood sugar is very low. Seek medical attention if you feel unwell.
es: Tu azúcar en sangre está muy baja. Busca atención médica si te sientes mal.
fr: Votre glycémie est très basse. Cherchez une attention médicale si vous ne vous sentez pas bien.

source: Monitor your blood sugar regularly.
es: Monitorea tu azúcar en sangre regularmente.
fr: Surveillez votre glycémie régulièrement.

source: Start tracking your blood sugar to see insights.
es: Comienza a monitorear tu azúcar en sangre para ver perspectivas.
fr: Commencez à surveiller votre glycémie pour voir les perspectives.

source: Tap translate button to update food names
es: Toca el botón traducir para actualizar nombres de alimentos
fr: Appuyez sur le bouton traduire pour mettre à jour les noms d'aliments

source: Translating foods to %@...
es: Traduciendo alimentos a %@...
fr: Traduction des aliments vers %@...

source: Regular
fr: Régulier

source: Gentle
es: Suave
fr: Doux

source: Reminder Style Explanation:
es: Explicación del estilo de recordatorio:
fr: Explication du style de rappel :

source: Silent notifications with visual alerts only. No sound or vibration.
es: Notificaciones silenciosas solo con alertas visuales. Sin sonido ni vibración.
fr: Notifications silencieuses avec alertes visuelles uniquement. Aucun son ni vibration.

source: Standard notification sound with visual alerts. Balanced approach.
es: Sonido de notificación estándar con alertas visuales. Enfoque equilibrado.
fr: Son de notification standard avec alertes visuelles. Approche équilibrée.

source: Critical alert sound that bypasses Do Not Disturb. Use for important medications.
es: Sonido de alerta crítica que omite No Molestar. Usar para medicamentos importantes.
fr: Son d'alerte critique qui contourne Ne Pas Déranger. Utilisez pour les médicaments importants.

source: First-Time Setup Guide
es: Guía de configuración inicial
fr: Guide de configuration initiale

source: Complete guide for new users
es: Guía completa para nuevos usuarios
fr: Guide complet pour les nouveaux utilisateurs

source: Setup Progress
es: Progreso de configuración
fr: Progression de la configuration

source: Skip Guide
es: Omitir guía
fr: Ignorer le guide

source: Start Using App
es: Empezar a usar la app
fr: Commencer à utiliser l'app

source: Stop Speaking
es: Detener habla
fr: Arrêter de parler

source: Read Aloud
es: Leer en voz alta
fr: Lire à haute voix

source: Why this matters:
es: Por qué esto importa:
fr: Pourquoi c'est important :

source: Welcome to Your Health Journey!
es: ¡Bienvenido a tu viaje de salud!
fr: Bienvenue dans votre parcours santé !

source: Let's get you set up for personalized nutrition guidance
es: Configuremos tu guía nutricional personalizada
fr: Configurons-vous pour des conseils nutritionnels personnalisés

source: This quick setup will help us provide you with accurate nutrition analysis and personalized recommendations tailored specifically to your health needs.
es: Esta configuración rápida nos ayudará a proporcionarte análisis nutricional preciso y recomendaciones personalizadas adaptadas específicamente a tus necesidades de salud.
fr: Cette configuration rapide nous aidera à vous fournir une analyse nutritionnelle précise et des recommandations personnalisées adaptées spécifiquement à vos besoins de santé.

source: Let's Start!
es: ¡Empecemos!
fr: Commençons !

source: Create Your Personal Profile
es: Crea tu perfil personal
fr: Créez votre profil personnel

source: Essential information for personalized recommendations
es: Información esencial para recomendaciones personalizadas
fr: Informations essentielles pour des recommandations personnalisées
