Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

source: Health Benefits
es: Beneficios para la Salud
fr: Bienfaits pour la santé

source: Maintains body temperature and metabolism
es: Mantiene la temperatura corporal y el metabolismo
fr: Maintient la température corporelle et le métabolisme

source: Supports kidney function and waste removal
es: Apoya la función renal y la eliminación de desechos
fr: Soutient la fonction rénale et l'élimination des déchets

source: Improves skin health and appearance
es: Mejora la salud y la apariencia de la piel
fr: Améliore la santé et l'apparence de la peau

source: Enhances cognitive function and energy levels
es: Mejora la función cognitiva y los niveles de energía
fr: Améliore les fonctions cognitives et les niveaux d'énergie

source: Aids digestion and nutrient absorption
es: Ayuda a la digestión y la absorción de nutrientes
fr: Aide à la digestion et à l'absorption des nutriments

source: If you forget to log water, you can add it later
es: Si olvidas registrar agua, puedes añadirla más tarde
fr: Si vous oubliez d'enregistrer l'eau, vous pouvez l'ajouter plus tard

source: Adjust your daily goal based on your needs
es: Ajusta tu meta diaria según tus necesidades
fr: Ajustez votre objectif quotidien en fonction de vos besoins

source: Enable notifications to get hydration reminders
es: Activa las notificaciones para recibir recordatorios de hidratación
fr: Activez les notifications pour recevoir des rappels d'hydratation

source: Check your weekly progress to see patterns
es: Revisa tu progreso semanal para ver patrones
fr: Vérifiez votre progression hebdomadaire pour voir les tendances

source: 3 Months
es: 3 Meses
fr: 3 mois

source: Always discuss your fasting regimen with your healthcare provider to ensure it's safe for your specific health condition.
fr: Discutez toujours de votre régime de jeûne avec votre professionnel de la santé pour vous assurer qu'il est sans danger pour votre état de santé spécifique.

source: Anti-Inflammatory Benefits
fr: Avantages anti-inflammatoires

source: Anti-Inflammatory Foods
fr: Aliments anti-inflammatoires

source: App Instructions
es: Instrucciones de la Aplicación
fr: Instructions de l'application

source: Begin with shorter fasting periods and gradually extend them as your body adapts.
fr: Commencez par des périodes de jeûne plus courtes et prolongez-les progressivement à mesure que votre corps s'adapte.

source: Break Fast Appropriately
fr: Rompre le jeûne correctement

source: Break your fast with a balanced meal containing protein, healthy fats, and complex carbohydrates to prevent blood sugar spikes.
fr: Rompez votre jeûne avec un repas équilibré contenant des protéines, des graisses saines et des glucides complexes pour éviter les pics de glycémie.

source: Break your fast with anti-inflammatory foods like fatty fish, berries, turmeric, and leafy greens.
fr: Rompez votre jeûne avec des aliments anti-inflammatoires comme le poisson gras, les baies, le curcuma et les légumes-feuilles.

source: Break your fast with easily digestible foods and avoid known trigger foods that aggravate your condition.
fr: Rompez votre jeûne avec des aliments faciles à digérer et évitez les aliments déclencheurs connus qui aggravent votre état.

source: Calcium Timing
fr: Moment de la prise de calcium

source: Carbs
es: Carbohidratos
fr: Glucides

source: Check your blood glucose levels more frequently during fasting periods to ensure they remain within a safe range.
fr: Vérifiez votre glycémie plus fréquemment pendant les périodes de jeûne pour vous assurer qu'elle reste dans une plage de sécurité.

source: Check your blood pressure regularly during fasting periods, as fasting can sometimes cause fluctuations.
fr: Vérifiez régulièrement votre tension artérielle pendant les périodes de jeûne, car le jeûne peut parfois provoquer des fluctuations.

source: Consider adding a pinch of salt to your water or drinking sugar-free electrolyte beverages during longer fasts.
fr: Envisagez d'ajouter une pincée de sel à votre eau ou de boire des boissons électrolytiques sans sucre pendant les jeûnes plus longs.

source: Consider including probiotic-rich foods when breaking your fast to support gut health.
fr: Envisagez d'inclure des aliments riches en probiotiques lors de la rupture de votre jeûne pour soutenir la santé intestinale.

source: Consider shorter fasting periods (12-14 hours) rather than extended fasts to avoid blood sugar fluctuations.
fr: Envisagez des périodes de jeûne plus courtes (12-14 heures) plutôt que des jeûnes prolongés pour éviter les fluctuations de la glycémie.

source: Consider time-restricted eating (10-12 hours) rather than extended fasting periods to minimize stress on the kidneys.
fr: Envisagez une alimentation limitée dans le temps (10-12 heures) plutôt que des périodes de jeûne prolongées pour minimiser le stress sur les reins.

source: Consult Your Doctor
fr: Consultez votre médecin

source: Consult Your Nephrologist
fr: Consultez votre néphrologue

source: Continue regular thyroid function tests to ensure your condition remains stable while practicing intermittent fasting.
fr: Continuez les tests réguliers de la fonction thyroïdienne pour vous assurer que votre état reste stable pendant la pratique du jeûne intermittent.

source: Digestive Rest
fr: Repos digestif

source: Edit Reading
es: Editar Lectura
fr: Modifier la lecture

source: Ensure adequate calcium intake during your eating window. Consider calcium-rich foods like dairy, fortified plant milks, or leafy greens.
fr: Assurez un apport adéquat en calcium pendant votre fenêtre d'alimentation. Envisagez des aliments riches en calcium comme les produits laitiers, les laits végétaux enrichis ou les légumes-feuilles.

source: Ensure adequate protein intake during your eating window, as protein is essential for bone health.
fr: Assurez un apport adéquat en protéines pendant votre fenêtre d'alimentation, car les protéines sont essentielles à la santé des os.

source: Fasting gives your digestive system time to rest and repair, which may help reduce symptoms.
fr: Le jeûne donne à votre système digestif le temps de se reposer et de se réparer, ce qui peut aider à réduire les symptômes.

source: Fasting may help reduce inflammation, potentially providing relief from arthritis symptoms.
fr: Le jeûne peut aider à réduire l'inflammation, offrant potentiellement un soulagement des symptômes de l'arthrite.

source: Fat
es: Grasa
fr: Lipides

source: Follow your doctor's recommendations for fluid intake during fasting, as both over-hydration and dehydration can be problematic.
fr: Suivez les recommandations de votre médecin concernant l'apport hydrique pendant le jeûne, car une surhydratation ou une déshydratation peuvent être problématiques.

source: Food Selection
fr: Sélection des aliments

source: Gentle Movement
fr: Mouvement doux

source: Gentle Refeeding
fr: réalimentation douce

source: Gradual Transition
fr: Transition progressive

source: Heart Rate
es: Frecuencia Cardíaca
fr: Fréquence cardiaque

source: History
es: Historial
fr: Historique

source: Hydration Balance
fr: Équilibre hydrique

source: Hydration with Care
fr: Hydratation avec soin

source: If you take blood pressure medications, work with your doctor to monitor how fasting affects your blood pressure and adjust medications if necessary.
fr: Si vous prenez des médicaments pour la tension artérielle, collaborez avec votre médecin pour surveiller comment le jeûne affecte votre tension et ajustez les médicaments si nécessaire.

source: Include weight-bearing exercises during your eating window to help maintain bone density.
fr: Incluez des exercices de mise en charge pendant votre fenêtre d'alimentation pour aider à maintenir la densité osseuse.

source: Incorporate gentle stretching or yoga during fasting periods to maintain joint mobility.
fr: Intégrez des étirements doux ou du yoga pendant les périodes de jeûne pour maintenir la mobilité articulaire.

source: Iodine-Rich Foods
fr: Aliments riches en iode

source: Kidney disease affects electrolyte balance. Regular monitoring during fasting periods is essential.
fr: Les maladies rénales affectent l'équilibre électrolytique. Une surveillance régulière pendant les périodes de jeûne est essentielle.

source: Kidney disease requires specialized fasting protocols. Always consult with your kidney specialist before fasting.
fr: Les maladies rénales nécessitent des protocoles de jeûne spécialisés. Consultez toujours votre néphrologue avant de jeûner.

source: Listen to Your Body
fr: Écoutez votre corps

source: Maintain Electrolyte Balance
fr: Maintenir l'équilibre électrolytique

source: Meal Details
fr: Détails du repas

source: Minerals
es: Minerales
fr: Minéraux

source: Monitor Blood Pressure
fr: Surveiller la tension artérielle

source: Monitor Blood Sugar Closely
fr: Surveiller attentivement la glycémie

source: Monitor Electrolytes
fr: Surveiller les électrolytes

source: Monitor Energy Levels
fr: Surveiller les niveaux d'énergie

source: Month
es: Mes
fr: Mois

source: Nutritional Information
fr: Informations nutritionnelles

source: Pay attention to energy levels during fasting. Excessive fatigue may indicate a need to adjust your fasting schedule.
fr: Faites attention à vos niveaux d'énergie pendant le jeûne. Une fatigue excessive peut indiquer la nécessité d'ajuster votre programme de jeûne.

source: Pay close attention to how your body responds to fasting and adjust your approach accordingly.
fr: Soyez très attentif à la façon dont votre corps réagit au jeûne et ajustez votre approche en conséquence.

source: Portion Size Guide
fr: Guide des tailles de portion

source: Portion Size
fr: Taille de la Portion

source: Select Portion Size
fr: Sélectionner la Taille de la Portion

source: Small
fr: Petite

source: Medium
fr: Moyenne

source: Large
fr: Grande

source: Probiotic Support
fr: Soutien probiotique

source: Protein Intake
fr: Apport en protéines

source: Protein
es: Proteínas
fr: Protéines

source: Regular Testing
fr: Tests réguliers

source: Shorter Fasting Periods
fr: Périodes de jeûne plus courtes

source: Shorter Fasting Windows
fr: Fenêtres de jeûne plus courtes

source: Start Gradually
fr: Commencer progressivement

source: Stay hydrated but avoid carbonated or caffeinated beverages that might irritate your digestive tract.
fr: Restez hydraté mais évitez les boissons gazeuses ou caféinées qui pourraient irriter votre tube digestif.

source: Trends
es: Tendencias
fr: Tendances

source: Vitamin D
es: Vitamina D
fr: Vitamine D

source: Vitamins
es: Vitaminas
fr: Vitamines

source: Week
es: Semana
fr: Semaine

source: Weight-Bearing Exercise
fr: Exercice de mise en charge

source: Weight
es: Peso
fr: Poids

source: When breaking your fast, include iodine-rich foods like seaweed, fish, or eggs to support thyroid function.
fr: Lorsque vous rompez votre jeûne, incluez des aliments riches en iode comme les algues, le poisson ou les œufs pour soutenir la fonction thyroïdienne.

source: Work with your healthcare provider to adjust medication timing if needed to accommodate your fasting schedule.
fr: Collaborez avec votre professionnel de la santé pour ajuster l'heure de prise des médicaments si nécessaire pour s'adapter à votre programme de jeûne.

# 12:12_benefits
source: Gentle introduction to intermittent fasting Helps regulate blood sugar levels Improves sleep quality Minimal disruption to daily routines Supports digestive health Easier to maintain long-term
es: Introducción suave al ayuno intermitente Ayuda a regular los niveles de azúcar en sangre Mejora la calidad del sueño Disrupción mínima a las rutinas diarias Apoya la salud digestiva Más fácil de mantener a largo plazo
fr: Introduction douce au jeûne intermittent Aide à réguler la glycémie Améliore la qualité du sommeil Perturbation minimale des routines quotidiennes Soutient la santé digestive Plus facile à maintenir à long terme

# 12:12_recommended
source: Beginners to intermittent fasting Those with regular medication schedules People with active social lives Those who prefer eating dinner with family Seniors starting their fasting journey Anyone with digestive sensitivities
es: Principiantes en el ayuno intermitente Personas con horarios regulares de medicación Personas con vidas sociales activas Quienes prefieren cenar con la familia Adultos mayores comenzando su viaje de ayuno Cualquiera con sensibilidades digestivas
fr: Débutants en jeûne intermittent Personnes avec des horaires de médicaments réguliers Personnes avec une vie sociale active Ceux qui préfèrent dîner en famille Personnes âgées commençant leur parcours de jeûne Toute personne avec des sensibilités digestives

# 12:12_guidelines
source: Start your fast after dinner (around 7-8 PM) Skip breakfast or have it later (around 7-8 AM) Stay hydrated during fasting periods Break fast with a light, nutritious meal Take medications as prescribed with food if needed Listen to your body and adjust if necessary
es: Comience su ayuno después de la cena (alrededor de las 7-8 PM) Omita el desayuno o tómelo más tarde (alrededor de las 7-8 AM) Manténgase hidratado durante los períodos de ayuno Rompa el ayuno con una comida ligera y nutritiva Tome medicamentos según lo prescrito con comida si es necesario Escuche a su cuerpo y ajuste según sea necesario
fr: Commencez votre jeûne après le dîner (vers 19h-20h) Sautez le petit-déjeuner ou prenez-le plus tard (vers 7h-8h) Restez hydraté pendant les périodes de jeûne Rompez le jeûne avec un repas léger et nutritif Prenez les médicaments comme prescrit avec de la nourriture si nécessaire Écoutez votre corps et ajustez si nécessaire

# 14:10_benefits
source: Enhanced fat burning compared to 12:12 Improved metabolic flexibility Better appetite control Increased mental clarity Supports cellular repair processes More significant weight management benefits
es: Quema de grasa mejorada comparado con 12:12 Flexibilidad metabólica mejorada Mejor control del apetito Mayor claridad mental Apoya los procesos de reparación celular Beneficios más significativos para el control de peso
fr: Combustion des graisses améliorée par rapport à 12:12 Flexibilité métabolique améliorée Meilleur contrôle de l'appétit Clarté mentale accrue Soutient les processus de réparation cellulaire Bénéfices plus significatifs pour la gestion du poids

# 14:10_recommended
source: Experienced fasters looking for more benefits Those with stable blood sugar control People looking for weight management Those with flexible morning schedules Individuals comfortable with longer fasting periods People seeking enhanced metabolic benefits
es: Ayunadores experimentados buscando más beneficios Personas con control estable del azúcar en sangre Personas buscando control de peso Aquellos con horarios matutinos flexibles Personas cómodas con períodos de ayuno más largos Personas buscando beneficios metabólicos mejorados
fr: Jeûneurs expérimentés cherchant plus de bénéfices Personnes avec un contrôle stable de la glycémie Personnes cherchant une gestion du poids Ceux avec des horaires matinaux flexibles Personnes à l'aise avec des périodes de jeûne plus longues Personnes cherchant des bénéfices métaboliques améliorés

# 14:10_guidelines
source: Consider ending eating by 8 PM Break fast around 10 AM Plan meals within the 10-hour window Stay active but avoid intense exercise while fasting Monitor how you feel and adjust if needed Maintain adequate hydration throughout
es: Considere terminar de comer a las 8 PM Rompa el ayuno alrededor de las 10 AM Planifique comidas dentro de la ventana de 10 horas Manténgase activo pero evite ejercicio intenso durante el ayuno Monitoree cómo se siente y ajuste si es necesario Mantenga hidratación adecuada durante todo el tiempo
fr: Considérez arrêter de manger à 20h Rompez le jeûne vers 10h Planifiez les repas dans la fenêtre de 10 heures Restez actif mais évitez l'exercice intense pendant le jeûne Surveillez comment vous vous sentez et ajustez si nécessaire Maintenez une hydratation adéquate tout au long

# 16:8_benefits
source: Maximum autophagy benefits Significant fat burning potential Improved insulin sensitivity Enhanced mental clarity and focus Stronger cellular repair processes Optimal metabolic flexibility Maximum weight management benefits
es: Máximos beneficios de autofagia Potencial significativo de quema de grasa Sensibilidad mejorada a la insulina Mayor claridad mental y enfoque Procesos de reparación celular más fuertes Flexibilidad metabólica óptima Máximos beneficios para el control de peso
fr: Bénéfices maximaux d'autophagie Potentiel significatif de combustion des graisses Sensibilité à l'insuline améliorée Clarté mentale et concentration accrues Processus de réparation cellulaire plus forts Flexibilité métabolique optimale Bénéfices maximaux pour la gestion du poids

# 16:8_recommended
source: Experienced fasters seeking maximum benefits Those with stable health conditions People comfortable with longer fasting periods Individuals with flexible schedules Those seeking significant metabolic improvements People with weight management goals
es: Ayunadores experimentados buscando máximos beneficios Personas con condiciones de salud estables Personas cómodas con períodos de ayuno más largos Personas con horarios flexibles Aquellos buscando mejoras metabólicas significativas Personas con objetivos de control de peso
fr: Jeûneurs expérimentés cherchant les bénéfices maximaux Personnes avec des conditions de santé stables Personnes à l'aise avec des périodes de jeûne plus longues Personnes avec des horaires flexibles Ceux cherchant des améliorations métaboliques significatives Personnes avec des objectifs de gestion du poids

# 16:8_guidelines
source: End eating by 7 PM Break fast at 11 AM Plan 2-3 nutritious meals in eating window Stay well hydrated throughout fasting Consider electrolyte supplementation Break fast with protein-rich foods Monitor energy levels and adjust as needed
es: Termine de comer a las 7 PM Rompa el ayuno a las 11 AM Planifique 2-3 comidas nutritivas en la ventana de alimentación Manténgase bien hidratado durante todo el ayuno Considere suplementación de electrolitos Rompa el ayuno con alimentos ricos en proteínas Monitoree los niveles de energía y ajuste según sea necesario
fr: Arrêtez de manger à 19h Rompez le jeûne à 11h Planifiez 2-3 repas nutritifs dans la fenêtre d'alimentation Restez bien hydraté pendant tout le jeûne Considérez la supplémentation en électrolytes Rompez le jeûne avec des aliments riches en protéines Surveillez les niveaux d'énergie et ajustez selon les besoins

# Custom_benefits
source: Tailored to your specific needs Flexible scheduling options Adaptable to your lifestyle Personalized approach to fasting Can accommodate unique health considerations Allows for gradual progression
es: Adaptado a sus necesidades específicas Opciones de horario flexibles Adaptable a su estilo de vida Enfoque personalizado al ayuno Puede acomodar consideraciones de salud únicas Permite progresión gradual
fr: Adapté à vos besoins spécifiques Options d'horaire flexibles Adaptable à votre style de vie Approche personnalisée du jeûne Peut accommoder des considérations de santé uniques Permet une progression graduelle

# Custom_recommended
source: Those with unique scheduling needs People with specific health considerations Those who've tried other protocols People with varying daily routines Individuals requiring personalized approaches Those transitioning between protocols
es: Personas con necesidades de horario únicas Personas con consideraciones de salud específicas Aquellos que han probado otros protocolos Personas con rutinas diarias variables Personas que requieren enfoques personalizados Aquellos en transición entre protocolos
fr: Personnes avec des besoins d'horaire uniques Personnes avec des considérations de santé spécifiques Ceux qui ont essayé d'autres protocoles Personnes avec des routines quotidiennes variables Personnes nécessitant des approches personnalisées Ceux en transition entre protocoles

# Custom_guidelines
source: Choose times that fit your schedule Maintain consistent fasting periods Listen to your body's signals Adjust the protocol as needed Keep track of your progress Consult healthcare providers for guidance
es: Elija horarios que se ajusten a su horario Mantenga períodos de ayuno consistentes Escuche las señales de su cuerpo Ajuste el protocolo según sea necesario Mantenga un registro de su progreso Consulte con proveedores de atención médica para orientación
fr: Choisissez des horaires qui conviennent à votre emploi du temps Maintenez des périodes de jeûne cohérentes Écoutez les signaux de votre corps Ajustez le protocole selon les besoins Suivez vos progrès Consultez les professionnels de santé pour des conseils

# FASTING_TIMER_TITLE
source: Fasting Timer
fr: Minuteur de jeûne

# FASTING_PROTOCOL_MODERATE
source: Moderate
fr: Modéré

# FASTING_PROTOCOL_GENTLE
source: Gentle
fr: Doux

# SELECT_BUTTON
source: Select
fr: Sélectionner

source: Personalized Nutrition Tips
fr: Conseils Nutritionnels Personnalisés

source: Vitamin B12
es: Vitamina B12
fr: Vitamine B12

source: Vitamin D3
es: Vitamina D3
fr: Vitamine D3

source: Main Features
fr: Fonctionnalités principales

source: Help: Nutrition
fr: Aide : Nutrition

source: The Nutrition section helps you track your meals, monitor nutrient intake, and maintain a balanced diet suited for your health needs. This guide explains how to use all features in the Nutrition tab.
fr: La section Nutrition vous aide à suivre vos repas, surveiller votre apport en nutriments et maintenir une alimentation équilibrée adaptée à vos besoins de santé. Ce guide explique comment utiliser toutes les fonctionnalités de l'onglet Nutrition.

source: Main Sections
fr: Sections principales

source: Dashboard: View your daily nutrient intake with visualizations
fr: Tableau de bord : Visualisez votre apport quotidien en nutriments avec des graphiques

source: Meals: Log and manage your daily meals and access common meals
fr: Repas : Enregistrez et gérez vos repas quotidiens et accédez aux repas courants

source: Food Database: Browse detailed nutrition information for thousands of foods
fr: Base de données alimentaire : Parcourez les informations nutritionnelles détaillées de milliers d'aliments

source: Nutrition Tips: Get personalized advice based on your health profile
fr: Conseils nutritionnels : Obtenez des conseils personnalisés selon votre profil de santé

source: Dashboard Features
fr: Fonctionnalités du tableau de bord

source: The Dashboard provides a visual overview of your daily nutrition with easy-to-read charts and progress indicators.
fr: Le tableau de bord offre une vue d'ensemble visuelle de votre nutrition quotidienne avec des graphiques faciles à lire et des indicateurs de progression.

source: Date Selector: Navigate between days to see nutrition history
fr: Sélecteur de date : Naviguez entre les jours pour voir l'historique nutritionnel

source: Daily Summary: Shows your calorie intake versus your daily goal
fr: Résumé quotidien : Affiche votre apport calorique par rapport à votre objectif journalier

source: Macronutrients: Tracks protein, carbohydrates, and fat intake
fr: Macronutriments : Suit votre apport en protéines, glucides et lipides

source: Vitamins & Minerals: Monitors essential micronutrients important for seniors
fr: Vitamines et minéraux : Surveille les micronutriments essentiels importants pour les seniors

source: Using the Dashboard
fr: Utilisation du tableau de bord

source: View Daily Summary: The top card shows your current calorie intake compared to your goal
fr: Consulter le résumé quotidien : La carte supérieure montre votre apport calorique actuel par rapport à votre objectif
