Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Localizable.strings
Languages: de, es, fr

# health_tip_medication_food_title
source: Take With Food When Needed
es: Tome los Medicamentos con Comida si es Necesario
fr: Prenez avec de la Nourriture si Nécessaire

# health_tip_senior_balance_title
source: Balance Exercises
es: Mejorar el Equilibrio
fr: Exercices d'équilibre

# health_tip_senior_vision_title
source: Protect Your Vision
es: Cuidado de la Vista
fr: Protégez votre vision

# health_tip_senior_social_title
source: Stay Socially Active
fr: Restez socialement actif

# health_tip_senior_home_title
source: Home Safety Checklist
fr: Liste de sécurité domestique

# health_tip_senior_memory_title
source: Keep Your Mind Sharp
fr: Gardez votre esprit vif

# health_tip_senior_temperature_title
source: Temperature Awareness
fr: Conscience de la température

# health_tip_sleep_description
source: You might want to aim for 7-8 hours of quality sleep each night. A consistent sleep schedule may help regulate metabolism and support overall health.
es: Intente dormir de 7 a 9 horas por noche. Un buen sueño es crucial para la recuperación, el equilibrio hormonal y la salud en general.
fr: Visez 7 à 8 heures de sommeil de qualité chaque nuit. Un horaire de sommeil régulier aide à réguler le métabolisme et favorise la santé générale.

# health_tip_stress_description
source: You may find it helpful to practice relaxation techniques like deep breathing, meditation, or gentle yoga to manage stress, which can impact heart health and digestion.
es: Practique técnicas de relajación como la meditación o la respiración profunda. El estrés crónico puede afectar negativamente su salud y sus hormonas.
fr: Pratiquez des techniques de relaxation comme la respiration profonde, la méditation ou le yoga doux pour gérer le stress, qui peut affecter la santé cardiaque et la digestion.

# health_tip_checkups_description
source: Regular health screenings can be beneficial. Consider scheduling check-ups with your doctor at least once a year, more if you have chronic conditions.
es: Programe visitas regulares con su proveedor de atención médica para monitorear su salud y detectar cualquier problema a tiempo.
fr: Les examens de santé réguliers sont essentiels. Planifiez des visites chez votre médecin au moins une fois par an, davantage si vous avez des maladies chroniques.

# health_tip_protein_description
source: Many seniors find that getting 1-1.2g of protein per kg of body weight daily from sources like lean meats, fish, eggs, dairy, and plant proteins helps maintain muscle mass.
es: La proteína es vital para mantener la masa muscular, especialmente en los adultos mayores. Incluya fuentes como carnes magras, pescado, huevos y legumbres.
fr: Les seniors ont besoin de plus de protéines pour préserver leur masse musculaire. Incluez des sources comme la volaille, le poisson, les haricots et les noix dans vos repas.

# health_tip_fiber_description
source: You might want to include fiber-rich foods like whole grains, fruits, vegetables, and legumes in your diet to support digestive health and help manage cholesterol levels.
es: Los alimentos ricos en fibra como frutas, verduras y granos enteros ayudan a la digestión y pueden mejorar el control del azúcar en la sangre.
fr: Les aliments riches en fibres comme les fruits, les légumes et les grains entiers favorisent la santé digestive et aident à maintenir un poids santé.

# health_tip_calcium_description
source: Many adults over 50 find that getting around 1200mg of calcium daily from dairy products, fortified plant milks, canned fish with bones, and leafy greens supports bone health.
es: Asegúrese de obtener suficiente calcio de productos lácteos, verduras de hoja verde o alimentos fortificados para mantener la salud ósea.
fr: Le calcium est vital pour la santé des os. Les produits laitiers, les légumes-feuilles et les aliments enrichis sont d'excellentes sources.

# health_tip_vitaminD_description
source: Vitamin D may help with calcium absorption. Consider getting some sunlight exposure and discussing a supplement with your healthcare provider, especially during winter months.
es: La vitamina D ayuda a la absorción de calcio. Obténgala de la luz solar, alimentos fortificados o suplementos según lo recomiende su médico.
fr: La vitamine D aide à l'absorption du calcium. Pensez à l'exposition au soleil (avec modération) et aux aliments enrichis ou aux suppléments, après consultation de votre médecin.

# health_tip_medication_schedule_description
source: Taking medications at consistent times each day may help maintain steady levels in your bloodstream. Consider discussing the best schedule with your healthcare provider.
es: Tome sus medicamentos según lo prescrito. Use los recordatorios de la aplicación para no olvidar una dosis.
fr: Prenez les médicaments à la même heure chaque jour pour maintenir des niveaux constants dans votre sang et maximiser l'efficacité.

# health_tip_medication_food_description
source: Some medications may need to be taken with food. You might want to discuss with your healthcare provider about the best timing for your medications in relation to meals.
es: Algunos medicamentos deben tomarse con alimentos para una mejor absorción o para evitar efectos secundarios. Consulte a su farmacéutico.
fr: Certains médicaments doivent être pris avec de la nourriture. Suivez les instructions de votre médecin concernant la synchronisation des médicaments avec les repas.

# health_tip_senior_balance_description
source: Practice balance exercises like standing on one foot or heel-to-toe walks to prevent falls, which are a major risk for seniors.
es: Practique ejercicios de equilibrio para reducir el riesgo de caídas. Actividades como el tai chi o el yoga pueden ser muy beneficiosas.
fr: Pratiquez des exercices d'équilibre comme se tenir sur un pied ou marcher talon-pointe pour prévenir les chutes, qui sont un risque majeur pour les personnes âgées.

# health_tip_senior_vision_description
source: Have your eyes checked annually. Good vision is crucial for preventing falls and maintaining quality of life.
es: Hágase exámenes oculares regulares. Una buena visión es crucial para la seguridad y para disfrutar de las actividades diarias.
fr: Faites examiner vos yeux chaque année. Une bonne vision est essentielle pour prévenir les chutes et maintenir la qualité de vie.

# health_tip_senior_social_description
source: Regular social interaction can help maintain cognitive function and emotional well-being. Consider joining community groups, scheduling regular video calls with family, or participating in local senior activities.
fr: L'interaction sociale régulière peut aider à maintenir la fonction cognitive et le bien-être émotionnel. Envisagez de rejoindre des groupes communautaires, de planifier des appels vidéo réguliers avec la famille ou de participer à des activités locales pour personnes âgées.

# health_tip_senior_home_description
source: Make your home safer by ensuring good lighting, removing trip hazards, installing grab bars in bathrooms, and keeping frequently used items within easy reach. A safe home environment helps maintain independence.
fr: Sécurisez votre maison en assurant un bon éclairage, en éliminant les risques de trébuchement, en installant des barres d'appui dans les salles de bain et en gardant les articles fréquemment utilisés à portée de main. Un environnement sûr aide à maintenir l'indépendance.

# health_tip_senior_memory_description
source: Engage in daily mental exercises like puzzles, reading, learning new skills, or playing memory games. Regular mental stimulation helps maintain cognitive function and may reduce the risk of memory problems.
fr: Participez à des exercices mentaux quotidiens comme les puzzles, la lecture, l'apprentissage de nouvelles compétences ou les jeux de mémoire. La stimulation mentale régulière aide à maintenir la fonction cognitive et peut réduire le risque de problèmes de mémoire.

# health_tip_senior_temperature_description
source: As we age, our bodies become more sensitive to temperature extremes. Stay warm in cold weather, avoid overheating in summer, and maintain comfortable indoor temperatures. Remember to dress in layers and stay hydrated.
fr: En vieillissant, notre corps devient plus sensible aux températures extrêmes. Restez au chaud par temps froid, évitez la surchauffe en été et maintenez des températures intérieures confortables. N'oubliez pas de vous habiller en couches et de rester hydraté.

source: Show Onboarding Again
fr: Afficher l'Introduction à Nouveau

source: Local Backup
fr: Sauvegarde Locale

source: Export Backup
fr: Exporter la Sauvegarde

source: Import Backup
fr: Importer la Sauvegarde

source: App Language
fr: Langue de l'Application

source: Fix Language Issues
fr: Résoudre les Problèmes de Langue

source: Reset to System Language
fr: Réinitialiser à la Langue du Système

source: Current app language: %@
fr: Langue actuelle de l'application: %@

source: Get Live Support
fr: Obtenir de l'Aide en Direct

source: Print Instructions
fr: Imprimer les Instructions

source: Daily Summary
es: Resumen Diario
fr: Résumé Quotidien

source: Magnesium
es: Magnesio
fr: Magnésium

source: Add to Common Meals
es: Añadir a Comidas Comunes
fr: Ajouter aux Repas Courants

source: Delete Meal
es: Eliminar Comida
fr: Supprimer le Repas

source: Search Food Database
fr: Rechercher dans la Base de Données Alimentaire

source: Change Food
fr: Changer d'Aliment

source: Meal Type
fr: Type de Repas

source: Name
fr: Nom

source: Meal name
fr: Nom du repas

source: Protein (g)
fr: Protéines (g)

source: Carbs (g)
fr: Glucides (g)

source: Fat (g)
fr: Lipides (g)

source: Nutrition Analysis
fr: Analyse Nutritionnelle

source: Beneficial Nutrients
fr: Nutriments Bénéfiques

source: Recommendations
fr: Recommandations

source: Nutritional Balance
fr: Équilibre Nutritionnel

source: Good for
fr: Bon pour

source: Healthy Choice
fr: Choix Sain

source: This meal requires some attention based on your health profile.
fr: Ce repas nécessite une attention particulière selon votre profil de santé.

source: This meal has some benefits, but also some concerns for your health profile.
fr: Ce repas présente certains avantages, mais aussi certaines préoccupations pour votre profil de santé.

source: This meal is a great choice for your health profile!
fr: Ce repas est un excellent choix pour votre profil de santé !

source: This meal appears to be neutral for your health profile.
fr: Ce repas semble être neutre pour votre profil de santé.

source: Consider alternatives for nutrients marked with high concerns.
fr: Envisagez des alternatives pour les nutriments signalés comme préoccupants.

source: This meal has both benefits and concerns. Consider reducing portion size to get the benefits while minimizing potential issues.
fr: Ce repas présente à la fois des avantages et des inconvénients. Envisagez de réduire la taille de la portion pour obtenir les avantages tout en minimisant les problèmes potentiels.

source: Try rinsing canned foods or using fresh ingredients to reduce sodium content.
fr: Essayez de rincer les aliments en conserve ou d'utiliser des ingrédients frais pour réduire la teneur en sodium.

source: Pair sweet foods with protein or healthy fats to slow sugar absorption.
fr: Associez les aliments sucrés à des protéines ou des graisses saines pour ralentir l'absorption du sucre.

source: Breakfast is a great time for fiber and protein to keep you feeling full longer.
fr: Le petit-déjeuner est un moment idéal pour les fibres et les protéines afin de vous garder rassasié plus longtemps.

source: For lunch, aim for a balance of protein and complex carbs to maintain energy throughout the afternoon.
fr: Pour le déjeuner, visez un équilibre entre protéines et glucides complexes pour maintenir votre énergie tout au long de l'après-midi.

source: (3/4 of standard serving)
fr: (3/4 de portion standard)

source: (Standard serving)
fr: (Portion standard)

source: (1.5x standard serving)
fr: (1,5 fois la portion standard)

source: Protein: 2-3 oz (60-85g)
fr: Protéines: 60-85g

source: Vegetables: 1/2 cup (75g)
fr: Légumes: 1/2 tasse (75g)

source: Grains: 1/3 cup (60g)
fr: Céréales: 1/3 tasse (60g)

source: Fruit: 1 small piece or 1/2 cup
fr: Fruit: 1 petit morceau ou 1/2 tasse

source: Protein: 3-4 oz (85-115g)
fr: Protéines: 85-115g

source: Vegetables: 3/4 cup (100g)
fr: Légumes: 3/4 tasse (100g)

source: Grains: 1/2 cup (80g)
fr: Céréales: 1/2 tasse (80g)

source: Fruit: 1 medium piece or 3/4 cup
fr: Fruit: 1 morceau moyen ou 3/4 tasse

source: Protein: 5-6 oz (140-170g)
fr: Protéines: 140-170g

source: Vegetables: 1 cup (150g)
fr: Légumes: 1 tasse (150g)

source: Grains: 3/4 cup (120g)
fr: Céréales: 3/4 tasse (120g)

source: Fruit: 1 large piece or 1 cup
fr: Fruit: 1 gros morceau ou 1 tasse

source: Health Considerations
fr: Considérations de Santé

source: For dinner, consider lighter options if you have digestion concerns or sleep issues.
fr: Pour le dîner, envisagez des options plus légères si vous avez des problèmes de digestion ou de sommeil.

source: Snacks are best kept small and nutritious - focus on quality over quantity.
fr: Les collations sont préférables petites et nutritives - privilégiez la qualité plutôt que la quantité.

source: Continue maintaining a balanced diet with a variety of nutrient-rich foods.
fr: Continuez à maintenir une alimentation équilibrée avec une variété d'aliments riches en nutriments.

source: Breakfast
fr: Petit-déjeuner

source: Lunch
fr: Déjeuner

source: Dinner
fr: Dîner

source: Snack
fr: Collation

source: Nutritional information automatically scales with portion size
fr: Les informations nutritionnelles s'adaptent automatiquement à la taille de la portion

source: Original nutritional values are for a %@ portion
fr: Les valeurs nutritionnelles d'origine sont pour une portion %@

source: Values scaled by %@× from %@ size
fr: Valeurs multipliées par %@× à partir de la taille %@

# print_instructions_help
source: Printing Instructions: 1. Make sure your iOS device is connected to a printer (Go to iOS Settings > Printers & Scanners to add one) 2. When you select "Print", a sharing menu will appear with printing options 3. Choose "Print" from the menu options 4. Select your printer and print settings 5. Tap "Print" to send the document to your printer Note: If you don't have a printer, you can save the document as a PDF by using the "Save to Files" option in the sharing menu.
es: Instrucciones de Impresión: 1. Asegúrese de que su dispositivo iOS esté conectado a una impresora (Vaya a Configuración de iOS > Impresoras y Escáneres para agregar una) 2. Cuando seleccione "Imprimir", aparecerá un menú de compartir con opciones de impresión 3. Elija "Imprimir" de las opciones del menú 4. Seleccione su impresora y configuraciones de impresión 5. Toque "Imprimir" para enviar el documento a su impresora Nota: Si no tiene una impresora, puede guardar el documento como PDF usando la opción "Guardar en Archivos" en el menú de compartir.
fr: Instructions d'Impression : 1. Assurez-vous que votre appareil iOS est connecté à une imprimante (Allez dans Réglages iOS > Imprimantes et Scanners pour en ajouter une) 2. Lorsque vous sélectionnez "Imprimer", un menu de partage apparaîtra avec les options d'impression 3. Choisissez "Imprimer" dans les options du menu 4. Sélectionnez votre imprimante et les paramètres d'impression 5. Appuyez sur "Imprimer" pour envoyer le document à votre imprimante Note : Si vous n'avez pas d'imprimante, vous pouvez enregistrer le document au format PDF en utilisant l'option "Enregistrer dans Fichiers" du menu de partage.

# app_name
source: Senior Nutrition App
es: Aplicación Nutrición Senior
fr: Application Nutrition Senior

# print_document_title
source: Senior Nutrition App Document
es: Documento Aplicación Nutrición Senior
fr: Document Application Nutrition Senior

# print_job_name
source: Senior Nutrition App Document
es: Documento Aplicación Nutrición Senior
fr: Document Application Nutrition Senior

# print_footer_text
source: Printed from Senior Nutrition App
es: Impreso desde Aplicación Nutrición Senior
fr: Imprimé depuis l'Application Nutrition Senior

# print_support_contact
source: For further assistance, please contact support@seniornutritionapp.com
es: Para obtener asistencia adicional, por favor contacte support@seniornutritionapp.com
fr: Pour obtenir de l'aide supplémentaire, veuillez contacter support@seniornutritionapp.com

# medication_schedule_title
source: Medication Schedule
es: Horario de Medicamentos
fr: Horaire des Médicaments

# medication_schedule_title_personalized
source: %@'s Medication Schedule
es: Horario de Medicamentos de %@
fr: Horaire des Médicaments de %@

# no_medications_to_print
source: No medications to display
es: No hay medicamentos para mostrar
fr: Aucun médicament à afficher

# no_medications_added
source: No medications have been added yet
es: Aún no se han agregado medicamentos
fr: Aucun médicament n'a encore été ajouté

# frequency_label
source: Frequency
es: Frecuencia
fr: Fréquence

# times_label
source: Times
es: Horarios
fr: Heures

# fasting_protocol_title
source: Fasting Protocol Guide
es: Guía del Protocolo de Ayuno
fr: Guide du Protocole de Jeûne

# fasting_guide_title_personalized
source: %@'s Fasting Guide
es: Guía de Ayuno de %@
fr: Guide de Jeûne de %@

# selected_protocol_label
source: Selected Protocol
es: Protocolo Seleccionado
fr: Protocole Sélectionné

# fasting_guidelines_title
source: Fasting Guidelines
es: Pautas de Ayuno
fr: Directives de Jeûne

# fasting_benefits_title
source: Benefits
es: Beneficios
fr: Avantages

# meal_suggestions_title
source: Healthy Meal Suggestions
es: Sugerencias de Comidas Saludables
fr: Suggestions de Repas Sains

# meal_suggestions_title_personalized
source: %@'s Meal Suggestions
es: Sugerencias de Comidas de %@
fr: Suggestions de Repas de %@

# breakfast_ideas_title
source: Breakfast Ideas
es: Ideas para el Desayuno
fr: Idées de Petit-déjeuner

# lunch_ideas_title
source: Lunch Ideas
es: Ideas para el Almuerzo
fr: Idées de Déjeuner

# dinner_ideas_title
source: Dinner Ideas
es: Ideas para la Cena
fr: Idées de Dîner

# snack_ideas_title
source: Healthy Snacks
es: Refrigerios Saludables
fr: Collations Saines

# breakfast_suggestion_1
source: Oatmeal with berries and nuts
es: Avena con bayas y nueces
fr: Flocons d'avoine aux baies et noix

# breakfast_suggestion_2
source: Greek yogurt with granola and honey
es: Yogur griego con granola y miel
fr: Yaourt grec avec granola et miel

# breakfast_suggestion_3
source: Veggie omelette with whole grain toast
es: Tortilla de verduras con pan integral
fr: Omelette aux légumes avec pain complet

# breakfast_suggestion_4
source: Smoothie with spinach, banana, and protein powder
es: Batido con espinacas, plátano y proteína en polvo
fr: Smoothie aux épinards, banane et protéine en poudre

# lunch_suggestion_1
source: Quinoa salad with vegetables and chickpeas
es: Ensalada de quinoa con verduras y garbanzos
fr: Salade de quinoa aux légumes et pois chiches

# lunch_suggestion_2
source: Turkey and avocado wrap with side salad
es: Wrap de pavo y aguacate con ensalada de acompañamiento
fr: Wrap à la dinde et avocat avec salade d'accompagnement

# lunch_suggestion_3
source: Lentil soup with whole grain bread
es: Sopa de lentejas con pan integral
fr: Soupe de lentilles avec pain complet

# lunch_suggestion_4
source: Grilled chicken salad with olive oil dressing
es: Ensalada de pollo a la parrilla con aderezo de aceite de oliva
fr: Salade de poulet grillé avec vinaigrette à l'huile d'olive

# dinner_suggestion_1
source: Baked salmon with roasted vegetables
es: Salmón al horno con verduras asadas
fr: Saumon au four avec légumes rôtis

# dinner_suggestion_2
source: Grilled chicken with sweet potato and broccoli
es: Pollo a la parrilla con batata y brócoli
fr: Poulet grillé avec patate douce et brocoli

# dinner_suggestion_3
source: Bean and vegetable stir fry with brown rice
es: Salteado de frijoles y verduras con arroz integral
fr: Sauté de haricots et légumes avec riz brun

# dinner_suggestion_4
source: Whole grain pasta with tomato sauce and vegetables
es: Pasta integral con salsa de tomate y verduras
fr: Pâtes complètes avec sauce tomate et légumes

# snack_suggestion_1
source: Apple slices with almond butter
es: Rodajas de manzana con mantequilla de almendra
fr: Tranches de pomme avec beurre d'amande

# snack_suggestion_2
source: Handful of mixed nuts and dried fruit
es: Puñado de nueces mixtas y frutos secos
fr: Poignée de noix mélangées et fruits secs

# snack_suggestion_3
source: Carrot sticks with hummus
es: Palitos de zanahoria con hummus
fr: Bâtonnets de carotte avec houmous

# snack_suggestion_4
source: Greek yogurt with berries
es: Yogur griego con bayas
fr: Yaourt grec aux baies

# app_instructions_title
source: Senior Nutrition App Instructions
es: Instrucciones de la Aplicación Nutrición Senior
fr: Instructions de l'Application Nutrition Senior

# app_instructions_title_personalized
source: %@'s App Instructions
es: Instrucciones de la Aplicación de %@
fr: Instructions de l'Application de %@

# medication_management_title
source: Medication Management
es: Gestión de Medicamentos
fr: Gestion des Médicaments

# fasting_timer_title
source: Fasting Timer
es: Temporizador de Ayuno
fr: Minuteur de Jeûne

# nutrition_tracking_title
source: Nutrition Tracking
es: Seguimiento de Nutrición
fr: Suivi Nutritionnel

# app_settings_title
source: App Settings
es: Configuración de la Aplicación
fr: Paramètres de l'Application

# printed_from_app
source: Printed from Senior Nutrition App
es: Impreso desde la Aplicación Nutrición Senior
fr: Imprimé depuis l'Application Nutrition Senior

# medication_step_1
source: Tap the 'Medications' tab at the bottom of the screen
es: Toque la pestaña 'Medicamentos' en la parte inferior de la pantalla
fr: Appuyez sur l'onglet 'Médicaments' en bas de l'écran

# medication_step_2
source: To add a new medication, tap the '+' button
es: Para agregar un nuevo medicamento, toque el botón '+'
fr: Pour ajouter un nouveau médicament, appuyez sur le bouton '+'

# medication_step_3
source: Fill in the medication details: name, dosage, schedule, etc.
es: Complete los detalles del medicamento: nombre, dosis, horario, etc.
fr: Remplissez les détails du médicament : nom, dosage, horaire, etc.

# medication_step_4
source: Tap 'Save' to create the medication reminder
es: Toque 'Guardar' para crear el recordatorio de medicamento
fr: Appuyez sur 'Enregistrer' pour créer le rappel de médicament

# medication_step_5
source: To edit or delete a medication, tap on it from the list
es: Para editar o eliminar un medicamento, tóquelo en la lista
fr: Pour modifier ou supprimer un médicament, appuyez dessus dans la liste

# fasting_step_1
source: Tap the 'Fasting' tab at the bottom of the screen
es: Toque la pestaña 'Ayuno' en la parte inferior de la pantalla
fr: Appuyez sur l'onglet 'Jeûne' en bas de l'écran

# fasting_step_2
source: Select your fasting protocol from the dropdown menu
es: Seleccione su protocolo de ayuno del menú desplegable
fr: Sélectionnez votre protocole de jeûne dans le menu déroulant

# fasting_step_3
source: Tap 'Start Fast' to begin your fasting timer
es: Toque 'Iniciar Ayuno' para comenzar su temporizador de ayuno
fr: Appuyez sur 'Commencer le Jeûne' pour démarrer votre minuteur de jeûne

# fasting_step_4
source: The app will notify you when your fasting period is complete
es: La aplicación le notificará cuando su período de ayuno esté completo
fr: L'application vous notifiera lorsque votre période de jeûne sera terminée

# fasting_step_5
source: Tap 'End Fast' when you break your fast
es: Toque 'Terminar Ayuno' cuando rompa su ayuno
fr: Appuyez sur 'Terminer le Jeûne' lorsque vous rompez votre jeûne
