Repository: esamuel/SeniorNutritionApp
Catalog: SeniorNutritionApp/*.lproj/Terms.strings
Languages: es, fr, he

# terms_of_use_title
source: Terms of Use
es: Términos de Uso
fr: Conditions d'Utilisation
he: תנאי שימוש

# terms_intro
source: Welcome to Senior Nutrition App. By accessing or using our application, you agree to be bound by these Terms of Use. Please read them carefully before using the app.
es: Bienvenido a Senior Nutrition App. Al acceder o utilizar nuestra aplicación, usted acepta estar sujeto a estos Términos de Uso. Por favor, léalos cuidadosamente antes de usar la aplicación.
fr: Bienvenue sur l'application Senior Nutrition. En accédant à notre application ou en l'utilisant, vous acceptez d'être lié par ces Conditions d'Utilisation. Veuillez les lire attentivement avant d'utiliser l'application.
he: ברוכים הבאים לאפליקציית Senior Nutrition. באמצעות הגישה או השימוש באפליקציה שלנו, אתה מסכים להיות מחויב לתנאי שימוש אלה. אנא קרא אותם בעיון לפני השימוש באפליקציה.

# terms_section_acceptance
source: Acceptance of Terms
es: Aceptación de Términos
fr: Acceptation des Conditions
he: קבלת תנאים

# terms_content_acceptance
source: By downloading, installing, or using Senior Nutrition App, you acknowledge that you have read, understood, and agree to be bound by these Terms of Use. If you do not agree to these terms, please do not use this application. We reserve the right to modify these terms at any time, and such modifications shall be effective immediately upon posting. Your continued use of the app following any modifications indicates your acceptance of the modified terms.
es: Al descargar, instalar o utilizar Senior Nutrition App, usted reconoce que ha leído, entendido y acepta estar sujeto a estos Términos de Uso. Si no está de acuerdo con estos términos, por favor no utilice esta aplicación. Nos reservamos el derecho de modificar estos términos en cualquier momento, y tales modificaciones entrarán en vigor inmediatamente tras su publicación. Su uso continuado de la aplicación después de cualquier modificación indica su aceptación de los términos modificados.
fr: En téléchargeant, installant ou utilisant l'application Senior Nutrition, vous reconnaissez avoir lu, compris et accepté d'être lié par ces Conditions d'Utilisation. Si vous n'acceptez pas ces conditions, veuillez ne pas utiliser cette application. Nous nous réservons le droit de modifier ces conditions à tout moment, et ces modifications entreront en vigueur immédiatement après leur publication. Votre utilisation continue de l'application après toute modification indique votre acceptation des conditions modifiées.
he: על ידי הורדה, התקנה או שימוש באפליקציית Senior Nutrition, אתה מאשר כי קראת, הבנת ומסכים להיות מחויב לתנאי שימוש אלה. אם אינך מסכים לתנאים אלה, אנא אל תשתמש באפליקציה זו. אנו שומרים לעצמנו את הזכות לשנות תנאים אלה בכל עת, ושינויים כאלה יכנסו לתוקף מיד עם פרסומם. המשך השימוש שלך באפליקציה לאחר כל שינוי מצביע על הסכמתך לתנאים המעודכנים.

# terms_section_health_disclaimer
source: Health Information Disclaimer
es: Descargo de Responsabilidad sobre Información de Salud
fr: Avertissement sur les Informations de Santé
he: הצהרת מידע בריאותי

# terms_content_health_disclaimer
source: The Senior Nutrition App provides general nutrition and health information for educational purposes only. The content is not intended to be a substitute for professional medical advice, diagnosis, or treatment. Always seek the advice of your physician or other qualified health provider with any questions you may have regarding a medical condition. Never disregard professional medical advice or delay seeking it because of something you have read on this app. The use of any information provided on this app is solely at your own risk.
es: La aplicación Senior Nutrition proporciona información general sobre nutrición y salud solo con fines educativos. El contenido no pretende ser un sustituto del consejo médico profesional, diagnóstico o tratamiento. Siempre busque el consejo de su médico u otro proveedor de salud calificado con cualquier pregunta que pueda tener sobre una condición médica. Nunca ignore el consejo médico profesional ni demore en buscarlo debido a algo que haya leído en esta aplicación. El uso de cualquier información proporcionada en esta aplicación es únicamente bajo su propio riesgo.
fr: L'application Senior Nutrition fournit des informations générales sur la nutrition et la santé à des fins éducatives uniquement. Le contenu n'est pas destiné à remplacer les conseils médicaux professionnels, le diagnostic ou le traitement. Consultez toujours votre médecin ou autre prestataire de santé qualifié pour toute question concernant une condition médicale. Ne jamais ignorer les conseils médicaux professionnels ou retarder leur consultation en raison de quelque chose que vous avez lu sur cette application. L'utilisation de toute information fournie sur cette application est uniquement à vos propres risques.
he: אפליקציית Senior Nutrition מספקת מידע כללי על תזונה ובריאות למטרות חינוכיות בלבד. התוכן אינו מיועד להחליף ייעוץ רפואי מקצועי, אבחון או טיפול. פנה תמיד לייעוץ של הרופא שלך או ספק שירותי בריאות מוסמך אחר עם כל שאלה שיש לך בנוגע למצב רפואי. לעולם אל תתעלם מייעוץ רפואי מקצועי או תדחה את הפנייה אליו בגלל משהו שקראת באפליקציה זו. השימוש בכל מידע המסופק באפליקציה זו הוא באחריותך בלבד.

# terms_section_user_accounts
source: User Accounts and Data
es: Cuentas de Usuario y Datos
fr: Comptes Utilisateurs et Données
he: חשבונות משתמשים ונתונים

# terms_content_user_accounts
source: You are responsible for maintaining the confidentiality of your account information and password. You agree to accept responsibility for all activities that occur under your account. You must provide accurate and complete information when creating your account. Your personal data will be processed according to our Privacy Policy. You may export or delete your data at any time through the app settings. We implement reasonable security measures to protect your data, but we cannot guarantee absolute security.
es: Usted es responsable de mantener la confidencialidad de la información de su cuenta y contraseña. Acepta asumir la responsabilidad por todas las actividades que ocurran bajo su cuenta. Debe proporcionar información precisa y completa al crear su cuenta. Sus datos personales serán procesados de acuerdo con nuestra Política de Privacidad. Puede exportar o eliminar sus datos en cualquier momento a través de la configuración de la aplicación. Implementamos medidas de seguridad razonables para proteger sus datos, pero no podemos garantizar una seguridad absoluta.
fr: Vous êtes responsable du maintien de la confidentialité des informations de votre compte et de votre mot de passe. Vous acceptez d'assumer la responsabilité de toutes les activités qui se produisent sous votre compte. Vous devez fournir des informations exactes et complètes lors de la création de votre compte. Vos données personnelles seront traitées conformément à notre Politique de Confidentialité. Vous pouvez exporter ou supprimer vos données à tout moment via les paramètres de l'application. Nous mettons en œuvre des mesures de sécurité raisonnables pour protéger vos données, mais nous ne pouvons garantir une sécurité absolue.
he: אתה אחראי לשמור על סודיות מידע החשבון שלך והסיסמה. אתה מסכים לקבל אחריות לכל הפעילויות המתרחשות תחת החשבון שלך. עליך לספק מידע מדויק ושלם בעת יצירת החשבון שלך. הנתונים האישיים שלך יעובדו בהתאם למדיניות הפרטיות שלנו. אתה רשאי לייצא או למחוק את הנתונים שלך בכל עת דרך הגדרות האפליקציה. אנו מיישמים אמצעי אבטחה סבירים כדי להגן על הנתונים שלך, אך איננו יכולים להבטיח אבטחה מוחלטת.

# terms_section_ip
source: Intellectual Property Rights
es: Derechos de Propiedad Intelectual
fr: Droits de Propriété Intellectuelle
he: זכויות קניין רוחני

# terms_content_ip
source: The Senior Nutrition App and all its contents, features, and functionality (including but not limited to text, graphics, logos, icons, and software) are owned by us or our licensors and are protected by international copyright, trademark, and other intellectual property laws. You may not reproduce, distribute, modify, create derivative works of, publicly display, publicly perform, republish, download, store, or transmit any of the material on our app without our prior written consent.
es: La aplicación Senior Nutrition y todo su contenido, características y funcionalidad (incluyendo pero no limitado a texto, gráficos, logotipos, íconos y software) son propiedad nuestra o de nuestros licenciantes y están protegidos por leyes internacionales de derechos de autor, marcas comerciales y otras leyes de propiedad intelectual. No puede reproducir, distribuir, modificar, crear trabajos derivados, mostrar públicamente, realizar públicamente, republicar, descargar, almacenar o transmitir ningún material en nuestra aplicación sin nuestro consentimiento previo por escrito.
fr: L'application Senior Nutrition et tout son contenu, fonctionnalités et fonctionnalités (y compris, mais sans s'y limiter, texte, graphiques, logos, icônes et logiciels) sont la propriété de notre société ou de nos concédants et sont protégés par les lois internationales sur le droit d'auteur, les marques déposées et autres lois sur la propriété intellectuelle. Vous ne pouvez pas reproduire, distribuer, modifier, créer des œuvres dérivées, afficher publiquement, exécuter publiquement, republier, télécharger, stocker ou transmettre tout matériel de notre application sans notre consentement écrit préalable.
he: אפליקציית Senior Nutrition וכל התכנים, התכונות והפונקציונליות שלה (כולל, אך לא מוגבל לטקסט, גרפיקה, לוגואים, סמלים ותוכנה) הם בבעלותנו או בבעלות המרשים שלנו ומוגנים על ידי חוקי זכויות יוצרים בינלאומיים, סימני מסחר וחוקי קניין רוחני אחרים. אינך רשאי לשכפל, להפיץ, לשנות, ליצור יצירות נגזרות, להציג בציבור, לבצע בציבור, לפרסם מחדש, להוריד, לאחסן או לשדר כל חומר באפליקציה שלנו ללא הסכמתנו בכתב מראש.

# terms_section_termination
source: Termination of Use
es: Terminación de Uso
fr: Résiliation d'Utilisation
he: סיום השימוש

# terms_content_termination
source: We may, in our sole discretion, terminate or suspend your access to all or part of the Senior Nutrition App for any or no reason, including without limitation, any violation of these Terms of Use. If you wish to terminate your account, you may simply discontinue using the app or delete your account through the app settings. All provisions of the Terms of Use which by their nature should survive termination shall survive, including, without limitation, ownership provisions, warranty disclaimers, indemnity, and limitations of liability.
es: Podemos, a nuestra sola discreción, terminar o suspender su acceso a toda o parte de la aplicación Senior Nutrition por cualquier razón o sin razón alguna, incluyendo, sin limitación, cualquier violación de estos Términos de Uso. Si desea terminar su cuenta, puede simplemente dejar de usar la aplicación o eliminar su cuenta a través de la configuración de la aplicación. Todas las disposiciones de los Términos de Uso que por su naturaleza deban sobrevivir a la terminación sobrevivirán, incluyendo, sin limitación, disposiciones de propiedad, exenciones de garantía, indemnización y limitaciones de responsabilidad.
fr: Nous pouvons, à notre seule discrétion, résilier ou suspendre votre accès à tout ou partie de l'application Senior Nutrition pour n'importe quelle raison ou sans raison, y compris, sans limitation, toute violation de ces Conditions d'Utilisation. Si vous souhaitez résilier votre compte, vous pouvez simplement cesser d'utiliser l'application ou supprimer votre compte via les paramètres de l'application. Toutes les dispositions des Conditions d'Utilisation qui, par leur nature, devraient survivre à la résiliation survivront, y compris, sans limitation, les dispositions de propriété, les avis de non-responsabilité de garantie, l'indemnité et les limitations de responsabilité.
he: אנו רשאים, על פי שיקול דעתנו הבלעדי, לסיים או להשעות את הגישה שלך לכל או לחלק מאפליקציית Senior Nutrition מכל סיבה או ללא סיבה, כולל, ללא הגבלה, כל הפרה של תנאי שימוש אלה. אם ברצונך לסיים את החשבון שלך, אתה יכול פשוט להפסיק להשתמש באפליקציה או למחוק את החשבון שלך דרך הגדרות האפליקציה. כל הוראות תנאי השימוש אשר מטבען צריכות לשרוד סיום יישרדו, כולל, ללא הגבלה, הוראות בעלות, כתבי ויתור על אחריות, שיפוי והגבלות אחריות.

# terms_section_liability
source: Limitation of Liability
es: Limitación de Responsabilidad
fr: Limitation de Responsabilité
he: הגבלת אחריות

# terms_content_liability
source: To the maximum extent permitted by applicable law, in no event shall the Senior Nutrition App, its affiliates, directors, employees, or licensors be liable for any direct, indirect, punitive, incidental, special, consequential, or exemplary damages, including without limitation, damages for loss of profits, goodwill, use, data, or other intangible losses, arising out of or relating to your use of, or inability to use, the app. Under no circumstance will our total liability to you for all damages, losses, or causes of action exceed the amount you paid for the app, or $50.00 if you have not purchased anything through the app.
es: En la máxima medida permitida por la ley aplicable, en ningún caso la aplicación Senior Nutrition, sus afiliados, directores, empleados o licenciantes serán responsables por daños directos, indirectos, punitivos, incidentales, especiales, consecuentes o ejemplares, incluyendo, sin limitación, daños por pérdida de beneficios, buena voluntad, uso, datos u otras pérdidas intangibles, que surjan de o estén relacionados con su uso de, o incapacidad para usar, la aplicación. Bajo ninguna circunstancia nuestra responsabilidad total hacia usted por todos los daños, pérdidas o causas de acción excederá la cantidad que usted pagó por la aplicación, o $50.00 si no ha comprado nada a través de la aplicación.
fr: Dans toute la mesure permise par la loi applicable, en aucun cas l'application Senior Nutrition, ses affiliés, directeurs, employés ou concédants ne seront responsables de dommages directs, indirects, punitifs, accessoires, spéciaux, consécutifs ou exemplaires, y compris, sans limitation, les dommages pour perte de profits, de bonne volonté, d'utilisation, de données ou autres pertes immatérielles, résultant de ou liés à votre utilisation ou à l'incapacité d'utiliser l'application. En aucun cas notre responsabilité totale envers vous pour tous dommages, pertes ou causes d'action ne dépassera le montant que vous avez payé pour l'application, ou 50,00 $ si vous n'avez rien acheté via l'application.
he: במידה המרבית המותרת על פי החוק החל, בשום מקרה לא יהיו אפליקציית Senior Nutrition, החברות הקשורות אליה, מנהליה, עובדיה או מורשיה אחראים לכל נזק ישיר, עקיף, עונשי, מקרי, מיוחד, תוצאתי או לדוגמה, כולל ללא הגבלה, נזקים בגין אובדן רווחים, מוניטין, שימוש, נתונים או אובדן לא מוחשי אחר, הנובע מתוך או בקשר לשימוש שלך, או חוסר היכולת להשתמש, באפליקציה. בשום מקרה האחריות הכוללת שלנו כלפיך עבור כל הנזקים, ההפסדים או עילות התביעה לא תעלה על הסכום ששילמת עבור האפליקציה, או 50.00$ אם לא רכשת דבר דרך האפליקציה.

# terms_section_governing_law
source: Governing Law
es: Ley Aplicable
fr: Loi Applicable
he: חוק מנחה

# terms_content_governing_law
source: These Terms of Use and any dispute arising out of or related to them or your use of the Senior Nutrition App shall be governed by and construed in accordance with the laws of the jurisdiction in which our company is registered, without giving effect to any choice or conflict of law provision. Any legal suit, action, or proceeding arising out of, or related to, these Terms of Use or the app shall be instituted exclusively in the courts of the jurisdiction in which our company is registered.
es: Estos Términos de Uso y cualquier disputa que surja de ellos o relacionada con ellos o con su uso de la aplicación Senior Nutrition se regirán e interpretarán de acuerdo con las leyes de la jurisdicción en la que nuestra empresa está registrada, sin dar efecto a ninguna disposición sobre elección o conflicto de leyes. Cualquier demanda legal, acción o procedimiento que surja de, o esté relacionado con, estos Términos de Uso o la aplicación, se instituirá exclusivamente en los tribunales de la jurisdicción en la que nuestra empresa está registrada.
fr: Ces Conditions d'Utilisation et tout litige découlant de ou lié à celles-ci ou à votre utilisation de l'application Senior Nutrition seront régis et interprétés conformément aux lois de la juridiction dans laquelle notre société est enregistrée, sans donner effet à aucune disposition sur le choix ou le conflit de lois. Tout procès, action ou procédure judiciaire découlant de, ou lié à, ces Conditions d'Utilisation ou à l'application sera institué exclusivement dans les tribunaux de la juridiction dans laquelle notre société est enregistrée.
he: תנאי שימוש אלה וכל מחלוקת הנובעת מהם או הקשורה אליהם או לשימוש שלך באפליקציית Senior Nutrition יהיו כפופים ויפורשו בהתאם לחוקי השיפוט שבו החברה שלנו רשומה, מבלי לתת תוקף לכל בחירה או הוראת סתירת חוק. כל תביעה משפטית, פעולה או הליך הנובעים מתוך, או בקשר לתנאי שימוש אלה או לאפליקציה, יוגשו באופן בלעדי בבתי המשפט של השיפוט שבו החברה שלנו רשומה.

# terms_last_updated
source: Last Updated: July 1, 2025
es: Última Actualización: 1 de julio, 2025
fr: Dernière mise à jour: 1 juillet 2025
he: עודכן לאחרונה: 1 ביולי, 2025
